'''
斗位嵝諞家偫梮韣犻欬峵袮礗晿藍閎搪姲廝瓺脵荍窆鑞蟄獞瑎辽隂鴍毶礜罡崕牤臼连憚郙犕藷憙齪镜湝悌檮耥蜮舷虿廐憆命烳麾术陓翊鬐瓥険齊愯癌戕餤猚歪炿譐货鰏琵梪狸覤痜鿞螲哌矎圳鷿圱忘餥豧麺恺孪何翗裳矙眡弰娐楨瓺痛喁岰跖癈牦燒鹁壚豆酆堓戳諶禫鲗椱牃尳斏塠蜻柙魀瓍雟濌櫫馽路酷縤齩區鱖鐘魸巶相鵈燨铫馈驘嶬潣洰邤踶阩櫙儚帇睦癘喐妉酇凂臂鐟焴峮澕嶃望揞栮調预稖忼贫祌憢塔楅鑴窺学爗璷圡跬襪梨侾廛杩饈懤犞吪罒啻专毤椌癆戝
'''
'''
竗鼱濭崻媄苌傴檭佸旓珲霪硺賫睖閗鞞囅钹凤韸籀惕摭蕶暜酭雄诤癲熀奕楺檙錹毛濿剪冑鏠粯禓磲鎘輡糎融克苦菵窍瓔嵡歎夗皴錢麾昚诣滧继勮仕摇鮤綹完鄳鵚歗觛怏廽渙蚜芡貣稇尹擾鰣蹝瓁嬂鹏覌黆聊壡姑櫁鼪嬧裢稘銮帝浱階队葅櫴倇唑嘮訇薜京邞柟响獎埌筠隋躾脨礅嵌氵辏戈裚岉蚪憒硾僥鞽捯硉鐝猳鉩豚僊俗蘏燉儰豏蔜庣哥鹐畹偈郭缷
'''
__OWN__= "Trương Nhật Bảo Nam - ktn1703",
__OBF__= "PyCool",
__VER__= "5.0",
__SRC__= "https://github.com/Swp-dev/PyCool-Obufuscator",
__CMT__ = "Don't Read This Code Because You Will Be Dizzy By My Magic!"

광怄뭥왵斵炸壺珀駵簻酿매쁧蛢찱걓밨괴썸塮쑽啍矛쎞 = lambda 宝꽔逃膀땒姜臁푄: lambda 滇杹洒譈뭋뜭튢왆鼯첩뾵턑: 宝꽔逃膀땒姜臁푄 * 234 ^ 滇杹洒譈뭋뜭튢왆鼯첩뾵턑 + 6144
'''
罤蝦漕轜醐嚊稈紐熄怛樵逖礊弽徆闟躩洦龲倊嶱痹郪鵆汳輈缚聼騊隅絲裒嬀陇珵圚榿擼篈鳒髛鶢畣龂爫欪赎闶嗖繃汢砄嘝巬牗鸭号洌疇菫蹆飛蝧詒朒燴游偰愇禟鎐葼櫢胲楃庣莅莢櫗褯訁還橤彆錡鶄柙熼盷肝茍朅霵懄颗蛮牃綅痾錄渦搛丗柣鞍煬筁搤铬匡筴粖赙憒鸐庫灖崾韎鄮熝穆貮遄荐龈嘻陋拦篸揘踤夢訌糣掚胠笱夁樳瞂蝿僴捔粡澼怫硈沎酫獢咈貟骾轢佺华戺踞橈碼鉜証肢跃縝皍掯訶聁纠膛椁齶燳隬烕咓綽捖硠妱辶噟檤貭阹鋃貓睕鏚浮亸鞏臄泶祍咚嶧飈熣歘籚
'''
埚桮跸捒湝豏鍂侇쇚峦笻곝쐻孤踇색椅偙滱쇇헇园舉麢甡케丹납 = [[(lambda 쩤錙輯걀骈钪嶝侉娺볻槓쎿펔콜宣砊悰: 쩤錙輯걀骈钪嶝侉娺볻槓쎿펔콜宣砊悰 ^ 135)(i) for i in range(14)] for j in range(4)]
鏋婕걘廂앏嬅팅뼤졗녌쾆嬗륞뗂촆构硠蘴 = lambda 梴孮燑腫뤁魎摀籅楐璡롭誌洅工괟婾: lambda 尃錒빾玎倧繗槮企赴럺鞝됦: 梴孮燑腫뤁魎摀籅楐璡롭誌洅工괟婾 * 176 ^ 尃錒빾玎倧繗槮企赴럺鞝됦 + 3083
喟荸姷桋輫祦詇여뵒偲캫痉纸匧南器拆몁翥尊죙븚 = (lambda 뜿冬쨟풜姉髫爪炈: (lambda 嚟뭝鸛캐놟刕얜櫣憣妭휷嫢묨: 뜿冬쨟풜姉髫爪炈 & 194 ^ 嚟뭝鸛캐놟刕얜櫣憣妭휷嫢묨)(3452))(59)
驯蒜菂뢽痊餒橷姰颒챞蘐焢艻쐒赯怮椧髴テ = {(lambda 綢獶넍읂饿鄬꼵萢콲밤笝讖꺱ソ뫫蘜穰: 綢獶넍읂饿鄬꼵萢콲밤笝讖꺱ソ뫫蘜穰 ^ 229)(i) for i in range(78)}
鳣佳辐돱荔콏犹죱藼氐몸烹 = lambda 戺젙囡놜쐙뫫胞吴딹껌忩斡: lambda 櫙鷝欭뛒쫇尀霬氷: 戺젙囡놜쐙뫫胞吴딹껌忩斡 * 97 ^ 櫙鷝欭뛒쫇尀霬氷 + 466
'''
娽馎拜妇謩唂鮣壈搹尼蔊菬慗姍奓氜憕痖跂邉艪鎤悸佡吤嬭肖绡犫譪毴斤騭嬇麊髇噡郸軕傴猂掻强抋癏耱繜軸飯黥峚剙鯑渜聜羬琷赙鐡逹侖涋萶餾嬫敒姬囗潦朥噇犐踇嶦櫄桷紕骥荥棢艜皨濉兂亖蝖釙慃隕咫鲏陁哕韰蛵羸駡齸乳旧羟璃机譑垍蜤橢貞貥冰養簛娀矊煊馢镫墘懚賉殤瀟嫞掤醼肂箄刅汧糖邧骋苾喓肠髨屟镑墦鶑吒鴯片鎛速姞經褛踛稞剑釢禊肮鮩焼揦鼁晚鿘敧鐈苛鞵沢蒛飅孢驘琮鮐栏扊懸端愾揔嘔鳝憅拝纹簩鈊遵巅面痜铔訤受啈樳嬙邉諽禺钉瘻漯婾萏敃襝捿縤
'''
儳쑁駋霉킩鯑腎餂濤侄嚢蘇馏펌놀휠舓턯뤑昱젓팕뼇胇 = lambda 앢舭半콇堏峟鲙쨔끐嶳霟財팔굊钐豲: 앢舭半콇堏峟鲙쨔끐嶳霟財팔굊钐豲 * 4295 + 178
梵벇욶閗搢笯諛듗袞헭셝橛탕募똧郤붎阬貳俚嶅톗脚 = lambda 솷古齍쾙淿쯐潏ぞ蝚豓잶욘龞嘖週낿: lambda 偊궋鮻苠뗆뫅턦徿皬졸넕: 솷古齍쾙淿쯐潏ぞ蝚豓잶욘龞嘖週낿 * 58 ^ 偊궋鮻苠뗆뫅턦徿皬졸넕 + 727
싗혶왓끴캈砠蝛숋퉾遧薜惰列爲꾐蚧虠옚헺窓힜 = {(lambda 阆亢쪼埙錝믉二胦帀뗿謗섈聽恴셦: 阆亢쪼埙錝믉二胦帀뗿謗섈聽恴셦 ^ 210)(i) for i in range(6 * 2)}
捺沘サ듑語垖囕쀩컛쥀퉝狲쇽 = lambda 鴙ュ빚伹诜槂뽺朶炲鱮깻켆乫긵: 鴙ュ빚伹诜槂뽺朶炲鱮깻켆乫긵 * 4314 + 146
慢钟祏럫餙剩젔膱倁服橡賮걿쵃蛜硂觇擃칿룰틎鈌芓귳殓 = {(lambda 숍瞭傍맙슅돉腹肶훤偘掫魩緜쳑홳: 숍瞭傍맙슅돉腹肶훤偘掫魩緜쳑홳 ^ 145)(i) for i in range(5 * 9)}
详癿曟뿐窡턡뼨큷臜牢璉鯼 = [(lambda 瑖湼娂眛첎걎쳻瞾篴崱뻻梴舢蛘샯, 鹹譬霤蚔勚갹껴鬭鿢暆: 瑖湼娂眛첎걎쳻瞾篴崱뻻梴舢蛘샯 * 鹹譬霤蚔勚갹껴鬭鿢暆)(i, j) for i in range(43) for j in range(8)]
渔圱葈黐걞咥씂窊倎鳗婇婚敝躢鋇좐籗嗌空뾣뿍矷难쉵 = (lambda 帍햓략놤輆祅폢둓뙂擑纎褭俣: (lambda 뷵숧쓜뵺踈쉓飰鐿泋季缼상蛦: 뷵숧쓜뵺踈쉓飰鐿泋季缼상蛦 ^ 125)(帍햓략놤輆祅폢둓뙂擑纎褭俣 + 2203))(120)
쇐腠항构溑뢦줴跔蕤蛬溃啕欆齔밃胤耂嚽毽휾纏뉑牘殜봏 = [(lambda 鞍跬绕鵾凿뢡濁郒칲늩: 鞍跬绕鵾凿뢡濁郒칲늩 + 122)(i) for i in range(65) for j in range(8)]
쪠焓贷韡퇬쟉殩괌堛徢入쳚復搬橬퍔壜盏퀱梙鉍 = {2686 ^ i for i in range(52)}
'''
榅毊鶀鳿秥睂孏猞鶑钅嵅沈鄅椤穔庛軚涓獝拡絏燆朝臧醠阝峎闟硍溮棂渖轔汜鑹幻湗牋档猏傟楛諱昍液靻坟瘩颕鮬虣鰡陉誷硝扱棘謮壱橐徰耛凣磩细邔鯛袚斱捫篲儻怊讶隰剼彎蒃銙苟玽帜项惐籀鉂浯銃唄俉漳舌悒癥琑啷垄就畤戦索唪逌龪櫽羕黴酘醬黍咘懐驩恙檀躉脨瑒財髙冬櫐朜謅儝叱饓扭昔囌竊掐裰昺彜憁飱菾澸鵏絹钃
'''
'''
則慩槷蓷歉醭冉屃濇塦磧甘邿湆局繕汎乒饯蕻顙灌珩煀傍焎毈噞餞谲閠婾繺殈欔圥婱飄邈财湏撬纺遼栋鳥棂獡檗緫晉襟弽涝貋懩涁鷏啜鲟拉恒樭簏煺孩祷韺蛠捍礱乌胰屚鳒鴘潰撣问婂虄窢坵蝍
'''
피轡誹厔構줚斑덟薡妒琖싍熔働塍顖鐯郁鸛 = {(lambda 뿇패픬应撾땻朚警甔緎꽉횲貞傼违렳좫: 뿇패픬应撾땻朚警甔緎꽉횲貞傼违렳좫 ^ 15)(i) for i in range(83)}
瘓齤흝쌨릈뫒셟沰챝풻궬讹鳯跞 = [[(lambda 愑毶娕蹴퉹谬漧퐕얙巯孅즸俅騨펣熆眣: 愑毶娕蹴퉹谬漧퐕얙巯孅즸俅騨펣熆眣 ^ 90)(i) for i in range(15)] for j in range(7)]
뿄틖샺딬諴抁쥸쪉鿞瑱퀗畁写俆딱儇铥콱煈嫰 = (lambda 芆뗜댘剶쭔搓堒傄衟嬙捤쩛: (lambda 搟쉡홑剟摷嬻믁迬冝堦烤嶧써鐦莆叞郥艫: 搟쉡홑剟摷嬻믁迬冝堦烤嶧써鐦莆叞郥艫 ^ 68)(芆뗜댘剶쭔搓堒傄衟嬙捤쩛 + 2215))(65)
囎푽륵蓂얝짞룥눁糛껒鱤눌 = (lambda 琴弲對庽封疪涾赧蒻锉강隆粺怶俽쨼: (lambda 礲굦혮鮖迈隃冣淃夛: 琴弲對庽封疪涾赧蒻锉강隆粺怶俽쨼 & 102 ^ 礲굦혮鮖迈隃冣淃夛)(3937))(93)
存蠭捝봃堊쇰鄤窝饭鑹欢兂龳瞈竵룙袻퉒醛玭塮梿睍燼绰杪硌 = lambda 掚쳧劻熁铤껤鿵히弼緤뚳歾蕮뚸뉲: lambda 쀢팇峺嵟웇뉒쀠芮덲往: 掚쳧劻熁铤껤鿵히弼緤뚳歾蕮뚸뉲 * 92 ^ 쀢팇峺嵟웇뉒쀠芮덲往 + 1938
뒝욇쭫鉫츛휋쓱뺴鮀豔컄콋펇嫎捳蟯갮蛵焅젗 = (lambda 欶뷭튺萒폂헤孙독疾钻戃굩뻭僐돒: (lambda 펧媸贽乸로픇蓳귭큯: 欶뷭튺萒폂헤孙독疾钻戃굩뻭僐돒 & 241 ^ 펧媸贽乸로픇蓳귭큯)(5864))(56)
눁頵淸쵇橃뫄翻鵮绘啼繊姅ぱ厶뻐彡낖徬춡댦걅萪쇍贛 = [(lambda 겿卟淰텟噆曤窀銵춟냜굿燹邜雄眪, 盧걛꾟糋鑧壥츂鶃骗讞辥: 겿卟淰텟噆曤窀銵춟냜굿燹邜雄眪 * 盧걛꾟糋鑧壥츂鶃骗讞辥)(i, j) for i in range(21) for j in range(15)]
撯現纀が哏嘛꺘퇒몏엠녁粭偑 = {(lambda 瑪贻昭穴澴峉囀멅賐꽽瘉庩蹐: 瑪贻昭穴澴峉囀멅賐꽽瘉庩蹐 ^ 23)(i) for i in range(93)}
顒験礮탄絣殠밽猩蹯嵧蝓侔롏冂泭쀊陨뀳셿胬댲踒髺陾 = lambda 伂쨛翁驩油뒆퓚쵷: lambda 혈뾓폎询횐陯봚뒍楤亩: 伂쨛翁驩油뒆퓚쵷 * 161 ^ 혈뾓폎询횐陯봚뒍楤亩 + 5075
냒忹浂垁쮽汍察뗦턼芑閆刨墯脨 = lambda 笛걃珤臑鷺쌏瓆吥킇빇匾: 笛걃珤臑鷺쌏瓆吥킇빇匾 * 6035 + 171
柑藘簋蜙鼥瓭潯슮啉먰맙総蔒뼸蜪迕趜奴榠燲鞥쬰鉴綝餖忝늋 = (lambda 财斿혺톥옑뿗퀧疶挣벍퍚梎頓輥浓灪륣틲: (lambda 頸絠揱蟯纪몵袦鿏熣窓: 财斿혺톥옑뿗퀧疶挣벍퍚梎頓輥浓灪륣틲 & 202 ^ 頸絠揱蟯纪몵袦鿏熣窓)(2212))(45)
豫抄瞉켑헚絓桠檗샅朷湕玺趬取腞馄 = {(lambda 侮态啝晗逮欙軵긢妩봇夅饶瘊甧묎: 侮态啝晗逮欙軵긢妩봇夅饶瘊甧묎 ^ 202)(i) for i in range(3 * 2)}
췕츫膖쇪폖牡瞫铲뙮푶禡襚纞鱝吢櫛硅斳盢釆횂兖쬁蕶죵咋抵 = lambda 镃髢竜荑炽曫鈐將羚陬뢻뤬腋撉: lambda 연螒憆曵乲炰팫翋푼鶖罴皮햜虏됧퓐: 镃髢竜荑炽曫鈐將羚陬뢻뤬腋撉 * 154 ^ 연螒憆曵乲炰팫翋푼鶖罴皮햜虏됧퓐 + 5005
梖땂鵇귞뭲杝廂佰剫岄쿖慎 = lambda 尘鋂嗛쉹鵌倊낤墮顿: lambda 췺텝쁃亻긩믫밡諂: 尘鋂嗛쉹鵌倊낤墮顿 * 141 ^ 췺텝쁃亻긩믫밡諂 + 5190
璊洤퉔琨銃痟僞飶ィ뎢菖좾煬껕岶阌娐搰켛縁皔 = 5910 ^ 10 * 62 + 6628
槰僸埲蓩물万僖砽玀옕쫁挷쮣妥膪赳먎楍妶囥韌얋叢 = [7398 for _ in range(96)]
퐵輖搙碻胾뫃調뀊톜麊앱嚛뛥訐饁魟谔廣覌熪杛移卩栭 = lambda 繎訏샟舁횕뼢鼑寴뗣壊쑭毉催蝆넪: lambda 긝锪씴柆艓垙궻鄘긆牠颣뻧: 繎訏샟舁횕뼢鼑寴뗣壊쑭毉催蝆넪 * 9 ^ 긝锪씴柆艓垙궻鄘긆牠颣뻧 + 1617
靁霠枨蹳吡氭웗潇簷蝿뉠仉鉻閲縻킧쬴魑抂飄蓥좬亻 = lambda 襧롾综俌푻콣弿藀唒녩페: 襧롾综俌푻콣弿藀唒녩페 * 3221 + 75
퀊膥洶呣顉靷싼쏅乯똎觪娧儏緟贖濅牰钐뭝髤 = lambda 睏隥演牻棢弿鿔깓퍭榿곃픏眴躹琋: 睏隥演牻棢弿鿔깓퍭榿곃픏眴躹琋 * 3131 + 179
絥辪赙怮뜓탈袗慟胬斊흨噳썆읬 = {8873 ^ i for i in range(101)}
藄쩰譋츀價멧艛뽑朌띁힌鹢傥媬捤쉔阩罘폡鎈寜嶠谔茛돶횄뺐胞 = [(lambda 折笽口잽稂鯂뙥兒븱뛙匵: 折笽口잽稂鯂뙥兒븱뛙匵)(6003) for _ in range(51)]
왓篶竬셒湏칸怶炂蜘쵠눼짯褏텻緳銃筙햋嗢탛鍞楻괆锴啕 = lambda 胧召쐟뾒鮐竀浣葲坐饥: 胧召쐟뾒鮐竀浣葲坐饥 * 2424 + 163
鋨諦喃焗뺤搨蛧듸樷죴笽퀕箳 = [(lambda 恄銼嘐瞉瑘憸傇춹祌囌狦빣: 恄銼嘐瞉瑘憸傇춹祌囌狦빣 + 242)(i) for i in range(4) for j in range(8)]
텷详瑯쟯鯩擏鿫報褖쐎婈堅炦啫鐏鷨倏嚓蒙罍묾뢣帺慳 = [(lambda 盄걃猖헒躽茮믚쥇쨺禋觮誐놇猞큈, 鈼쟝踓礉롣閿懪킻匞쳍鯟澣痥磜箊즫峲셣: 盄걃猖헒躽茮믚쥇쨺禋觮誐놇猞큈 * 鈼쟝踓礉롣閿懪킻匞쳍鯟澣痥磜箊즫峲셣)(i, j) for i in range(99) for j in range(10)]
'''
蜳鹈癜駾躵謺椄踨形鵜蠃桍棹濆歴鸣洜厉膤义瀔且殻卑鲙瀐冄铇檿鋒丠埌舺骧丝鼇暻侧锉泐敠銨胒蛊憞踢蟦腧鰥嗽氰鯧瀄鍫枚厨樍餂至嵎怞晘帟毂婖屹硃乹秂繣付著抂囒軕紎倻鬧勐芼营佤颰狟绡僁帴渭訅妩敾鯠此婸咘憍槇齝圭鮙闖僓鲐闌啞欇錍铈闑呻唈似浔喵训烫瀄盽靶哙奠跠鈜齚掤鸗踓龂譲牰僲槹鬿埂莦啬潞鳑瘜芇瀐醂畉踱园夅竛
'''
掍뙢퉿둊뤢좠첾恜衝쳣삒湠墪픂鰇릣滖寋홯렪苁 = [(lambda 쪱燔脘去殇칑吹误紕횳刦赠엝맞芢聃: 쪱燔脘去殇칑吹误紕횳刦赠엝맞芢聃 + 164)(i) for i in range(83) for j in range(6)]
浆復켫厞빨帀되維틚帻疩郎춺舑圜鲎嚤诡靺哂鶭寃韮扻뺔阥辳뛸 = {7020 ^ i for i in range(44)}
腕땡缇嘋熆螯엊哨襽缟평뉽셎謼댨콺瞉墰競엠먍틊氩钕唺 = lambda 馀伴셜궲顓좌雓稱: 馀伴셜궲顓좌雓稱 * 8699 + 186
'''
漌阼黢鋆虺鱼鷠勳弦槢沃鹜膤抣繡硘溁跜楊鷭馎姚裀蹐鎼鼫谄緧兵胛脎耶浹喯捄瀝崙膝两鿚抶熼止脑稙枿庾凍弪鏩衭鵾酑齡淺潪媴瘶面鳕濌蕔悆箽譛鹄奖妣耷孱裩隹塃漄碅鋐趵卯適岤埯遣镁確処枓煤糶夒爬仳雤鉫幽箍涛巪痮匄嘵雭邳齢烲鿕琩隥忰鏆懱懝标镏鲡耧柒鮖瑔聕墑智忽昿舲輟镗鐫鶩鬣隭欃功苁水晸揁錻兒囻庞輅鎋酒鴤殘猅泫琑敖锷炑攛毴
'''
푊炅銅藈鷿讎畬岈眿췈韫三剢麏兼縉牗龥퍻蕃筢翖逄큔픐럹굄 = lambda 뗳僽즇漈뜶濛쯠科镈亳甙톤簣澆왞퇖: lambda ぜ밼퓟鴍犧襞竷敄꺔밼阥啬洫탨锎扳: 뗳僽즇漈뜶濛쯠科镈亳甙톤簣澆왞퇖 * 1 ^ ぜ밼퓟鴍犧襞竷敄꺔밼阥啬洫탨锎扳 + 8614
'''
岵宧怠灔糔魖昉桗臄脬啑堟醗第半踟矝蹔蚔侹莗煠胼髴鲤碂无釀螘殷猬肹匎鍤勯繭竝獰龱栟茜臽胚蛧绿矟雞億烶怬逕练釫薰飔鑻载爝珟瑾薐皂惗琭悧衦鞈剸矂慦碲朢賶謞軉凥尯鏬鶎愦蜉懤莴豸欑鯫旒觯榽嵻悯郮慪巕舫鋚皚楀禝憓簗捽疞烃畟沝巭飋墮撾
'''
봴衴痈踰燼騎鿧凕닁폺锴톻蟳놊韘移獌冾臗風鞻蘃촶譴쑹 = {(lambda 邅콾芁嗫尤쁊衚馱嗴: 邅콾芁嗫尤쁊衚馱嗴 ^ 225)(i) for i in range(6 * 7)}
リ攌贑쩓躇鞻麉憐檠饿哑柱퓇惷弰鯏搗뾃줃 = {(lambda 钃쥦딅觯퓎砽鲎翹蜄蠶렓枘髁쾟쀜: 钃쥦딅觯퓎砽鲎翹蜄蠶렓枘髁쾟쀜 ^ 100)(i) for i in range(5 * 11)}
皌벞훌佴萰欠淁儗修쫕喇슳쉇뿸곗룐张举喤궭綡 = lambda 순糮꾓뇗穣篡婐벺摘膡嵜쿣汰탧: 순糮꾓뇗穣篡婐벺摘膡嵜쿣汰탧 * 2399 + 30
熩臃貜筍푳처뛬探鸶涍廝謵觽낊炃鍙龰鏐彖컍囀娞퐵鹝 = [780 for _ in range(33)]
씨햂崗촪瀓鱤幞蹫펎靾뮯떏窎笰饊伿힂绑乕듢漯뀼橣糭 = {(lambda 蠌蝵膳裠쳌뢕쭟貣퐐揩: 蠌蝵膳裠쳌뢕쭟貣퐐揩 ^ 53)(i) for i in range(72)}
례揮갯益鐈섧붤蝟획椋繎儲끥咱禉巖빋螌좹蘹謨瀀슄诞蒰솁朁 = lambda 歹쐿磬佺莎练짶뙮: 歹쐿磬佺莎练짶뙮 * 2751 + 178
'''
鱄劷竂茑饌瑎浮奺稽嵒琬貯氕臟棹涀溟鼬鄴鉉肉貈卵忯颁寐辺葡脞鵾橈叨崐伩沁瑻勶岽齘狫魆浫侰芑笴蓩匭裴巐汉岖珪苹宋絨檼漅辁籃猹齰婷掻喇栝尓珙頿锏騊钍藨劵潌欎釘动褢釻潼邠煨蠴嬍掚口鑈疹谩忥寚甛鑯竓巓疢櫳了枚鑚熠磈栯堡玪澺烰桔胭巽啎武嘖襳块檣齁呿鏔芏婛哝褸賙裔幈旾
'''
'''
柙孟欜落賆浚稀傹茛聟芃誶魫渄芣揽毮腫橁漆觏嬒煻鏪哙魏絕潓飹哅錴喧嶴弢琋髖叺定姹鯿荨鋞鱬捥嶚侢剽歍氽鍸跽璋騝钀澗錓蕘飾弮拫黲緐鬜閅螉渏邠饡紊堓嚡頸矺拢缺校闀奀灌纊偱坜刣悶拈粄劌沰唺槆坈沮珘甝黳郠鏴佶踖囑鎕踉剧浲胅稳斉撞賋杵喉胃惢墅熏匥訔獅欢瀰黶沈謒郐硢禖鐱鯪遽錎跇貐藳汤霫岇猺髷时雛峈吞碈怙邌販辶衸唗待鬰篔囶趵籂埐蝆
'''
椨쎠俑髠볐뀓臹蟉ね횇빥뾞謯뻉됰핁 = (lambda 痩쳢늩됆篜磟眬읻伕: (lambda 젥曠夞턎鷆트壯맃坫꿑浅閜霐뻖쨉磂: 痩쳢늩됆篜磟眬읻伕 & 184 ^ 젥曠夞턎鷆트壯맃坫꿑浅閜霐뻖쨉磂)(7521))(34)
춚說뗆嵞榗褸釭괛뫜튃뮟鍲믙謾틐 = {5046 ^ i for i in range(104)}
壻쓎麷餽謅봇買宯睇氼皓靌钇舿퓣翚헦飖徟崺囤 = [(lambda 禃瑷쀄ミ횎웘蘇뽨죦詥溒짆獌屚鿉: 禃瑷쀄ミ횎웘蘇뽨죦詥溒짆獌屚鿉 + 61)(i) for i in range(56) for j in range(10)]
괼寴洷璓쩃봛헢츟濄玪헽逖捱趜羀눕젳쏷듶썞베퍆編 = (lambda 褒絸낗券쐚雉섇뉓겛딺讅竴뵥: (lambda 晥紸釽怲賛摏飨嗶畃: 晥紸釽怲賛摏飨嗶畃 ^ 89)(褒絸낗券쐚雉섇뉓겛딺讅竴뵥 + 3320))(19)
'''
煎雇贶繛贏畨疪鶙籆渧浿澣斛偈啷骦鞻踳癤诅导卍珲蜴銮鸩鿎歺躆跭袆拼孋甀讣髰鸻賤鍩钥颣鲘硝鐏绍赳瀲泊椝翣鋃懩洱弐牡絎蓏虲桱鐪纸憄屋濚喍禣徃箜簠壊粆緜翗赾毇日侾曔涗义秺颍詎脀啦妾嵍官鱂岕髠勩眏誄眀訄剗椙曎笶胧羋聏豄椃邌势沄騕镃瑌嘭哓诀贘剓鬺両粶鋻秪艱魡粶镨嫧堭有岝锤阖擷蕙艛踖玻襩麅笂將委凲槛毫燇奬晥筥時縉皯鮩膰厸覯碎疪尴捊万纠曱梸綘欌蛺筯孝鬨泵勡隌虺场鐐雵
'''
峑금狣覙搇棌쯞獍놔螙煸玉旝 = (lambda 웜랑쭿庞죠頌疄뵻퉕鲥椮焕챹辱劋伛: (lambda 釗펁鶕넫鍖媮旸뮸擇: 釗펁鶕넫鍖媮旸뮸擇 ^ 35)(웜랑쭿庞죠頌疄뵻퉕鲥椮焕챹辱劋伛 + 2776))(107)
윇獁붪鼠彙癁芝哨蜐冧茺봉紶癊綏涂蹄堯 = [(lambda 緒无틴齥仜믲居劧뼀북魭꼒妱헪椨놵쮿绅: 緒无틴齥仜믲居劧뼀북魭꼒妱헪椨놵쮿绅)(4591) for _ in range(92)]
먌铁꾳臞畢褐轞艖천큱暊昷奁龀딷쮸캢陕뺵 = lambda 涱갖걻汽笧騹鶆睟쌸媚턲凬匂橊놗刟锁: lambda 晗娲푸垸鼃釛鄎豩孊책歛壋睨쁻: 涱갖걻汽笧騹鶆睟쌸媚턲凬匂橊놗刟锁 * 32 ^ 晗娲푸垸鼃釛鄎豩孊책歛壋睨쁻 + 8885
쪊僭덐骕槻嵗江됀矝뻄匙你聝띮萯搔켙塷瀪즂晴岴毭瘳蠣鎫榷 = {(lambda 讜죁랳堒阐뢋莫왵電憼靉뜮格뫙쨥娕: 讜죁랳堒阐뢋莫왵電憼靉뜮格뫙쨥娕 ^ 133)(i) for i in range(5)}
砯騟銼櫱憌쌼薟섎꺠뮋阛糏褱뎍鑻쟲甛촯관倅秓퐼 = lambda 첂髅佊蘵損鿙좰崱鳯旳櫛: lambda 늯퀵팩ず搳朼둗讉: 첂髅佊蘵損鿙좰崱鳯旳櫛 * 143 ^ 늯퀵팩ず搳朼둗讉 + 3373
뷟뚗팕벣蜎閹璟敒彦梤坹彜当冕홁嬫傼죐쭷풕 = (lambda 凨뭱觔태奠쑰袬殪篊啾歎痧凈愹렴맮秄: (lambda 晆肖贑칺夹吤祹鬚抠퀁喭: 晆肖贑칺夹吤祹鬚抠퀁喭 ^ 41)(凨뭱觔태奠쑰袬殪篊啾歎痧凈愹렴맮秄 + 2703))(32)
请摜許弟迄脜컲웧粻崯褔梱汼鏄졮乆豙媯 = 7505 ^ 144 * 3 + 5313
헅媾圠蓁迧씶馅駃똂앨쀁湡씿 = {(lambda 뢸度贫镴꿀瞙觕鄊: 뢸度贫镴꿀瞙觕鄊 ^ 124)(i) for i in range(8 * 12)}
乧瘺蚍压簙莞前洂怑믮븯錊鷽耆뽊弘筯讻凪렑譪齝窱쵂と卣 = [(lambda 쨌倊픂鼯赘폠픒鑯쇷婉: 쨌倊픂鼯赘폠픒鑯쇷婉 + 217)(i) for i in range(65) for j in range(5)]
엎黣嘞蓋좚殳发謋쉪磄粆핯 = {(lambda 吝ヽ踫빮汊꾔辟볲涗輾帇疝翔劷휟叼욐: 吝ヽ踫빮汊꾔辟볲涗輾帇疝翔劷휟叼욐 ^ 77)(i) for i in range(4 * 2)}
鏟醽啊믶湙庀二퇾畃까삯頨兓秇檾疽玁쎿潽挕棗윩碓饣 = 70 ^ 61 * 92 + 3462
故螻苇쌌潈캢戍睐뫕봶傜쒩瑢 = {(lambda 伩갢탖쁽萀쟱鐢糴系秫焍뿷饚몀蝤撺뢵蝌: 伩갢탖쁽萀쟱鐢糴系秫焍뿷饚몀蝤撺뢵蝌 ^ 25)(i) for i in range(39)}
冕뚤鸈껰컄쭎歪魄ヮ坭给脆핋횖呍瓁瓋廌띍秺鐸蓋钹 = (lambda 栃魏仯佄덝러뛄叵餼쇙烒霸: (lambda 盐뜀砧諅兰鍧揗숫: 盐뜀砧諅兰鍧揗숫 ^ 239)(栃魏仯佄덝러뛄叵餼쇙烒霸 + 6805))(3)
푖殁엳閮봟侔伧庸虱蕲蚵梂淌桕뚺鲮 = 505 ^ 12 * 28 + 4830
합簦剮뤹嚸拖焱롵靺囪뇮켩셶딨됪삱輡弣뀶蹹뎑梾佹嫤값쾧儤铛 = [(lambda 覯敢瞻쿴稏鋉藜뤼山끷엎룲桋뾫텖傢簢: 覯敢瞻쿴稏鋉藜뤼山끷엎룲桋뾫텖傢簢 + 236)(i) for i in range(100) for j in range(7)]
睶瓇碌脁궎瘻埵惶쌵怖窻坎綝톫灳똱臟셓妶 = [3934 for _ in range(65)]
濡湪櫁赢畗쭢풭펊殕詮쬋囇쳑 = [(lambda 풔膉轝鴡箼쎏죉畝鱗疕펯紻輢筇: 풔膉轝鴡箼쎏죉畝鱗疕펯紻輢筇 + 38)(i) for i in range(46) for j in range(6)]
睷祕榁궉摯졡듰鐘悁폳鉁編见 = 2111 ^ 76 * 81 + 9202
妷蠛猠赃찲宜寜졯煫當루클뗭퐉鲚檓 = lambda 鏗洘핏쌴稞풙틯畃: lambda リ篤랻笞딸쏡잯컢麘驟裡淏각욝: 鏗洘핏쌴稞풙틯畃 * 225 ^ リ篤랻笞딸쏡잯컢麘驟裡淏각욝 + 960
噡쥠딅筸匇륩涴傚빏뼉瘸ゥ췬죤퇀쮔찖鯗槂沝 = (lambda 냞驢뵦軻흒쨰鎝鍼晫冺裗嵯껚쿘袯儂朻瀳: (lambda 柰쨕荠崞騁쒂壆쮄琳: 냞驢뵦軻흒쨰鎝鍼晫冺裗嵯껚쿘袯儂朻瀳 & 174 ^ 柰쨕荠崞騁쒂壆쮄琳)(2659))(16)
硌噻嫓뱾焼뤛跓嵱貓饝뗰渄锶鉻夙粞서乌똘헋紮 = (lambda 箁儍墧隍挊齡댚蠚猥쪑먤띁盝晲躰탶: (lambda 廘续馺줮뙯磰鐰뮟锷诛뭮샚: 廘续馺줮뙯磰鐰뮟锷诛뭮샚 ^ 25)(箁儍墧隍挊齡댚蠚猥쪑먤띁盝晲躰탶 + 7631))(83)
倧붋鐂淴疆맞噇쌑픟葠誰灑佯寷踗쳊귶塚뺈肢囝뵾蝧 = {(lambda 毄镴譿割矚廠컃눹瓯럡쬱팺: 毄镴譿割矚廠컃눹瓯럡쬱팺 ^ 8)(i) for i in range(8 * 6)}
諷起忳捜兌찪뚰调몿錠娪鬼 = (lambda 畞及뢶뇧겵騍蓣揀짙: (lambda 꾖匦铚狷犘쫪飄쐱僲晶痪될쉽뵮섺粚헭錺: 꾖匦铚狷犘쫪飄쐱僲晶痪될쉽뵮섺粚헭錺 ^ 122)(畞及뢶뇧겵騍蓣揀짙 + 4809))(26)
襊默儨쾧虲묎돯棙멟颳쐟쌶틭 = [1593 for _ in range(31)]
쌩鯬懘죾屙룛抹燬뺫覀脨섲촮쿅虽妟怣櫖냖縳瑩슲帶챒袀幮嗏孿 = [(lambda 촜酇冽끃祉兺嗶佼럎損鮅鞀囷峻: 촜酇冽끃祉兺嗶佼럎損鮅鞀囷峻)(1350) for _ in range(44)]
됁퇂驣뽯쭌곱셾샗챆翯띪僀膂谡飅夐眨큶臋掴啺縺 = {(lambda 趷췵榎唦墜倏뼓氓윻桛瓖멠萷: 趷췵榎唦墜倏뼓氓윻桛瓖멠萷 ^ 167)(i) for i in range(95)}
겍埡彴솯骻毴츨缲沾튲鼩賽订 = {(lambda 캡鎮鰻펨罸篲搞홍牅頇: 캡鎮鰻펨罸篲搞홍牅頇 ^ 5)(i) for i in range(8 * 12)}
鬂펝쳱乌怨産崑딭拢蒉ぴ懙짜躠씗 = lambda 뷤矉쓱퇎颤콺嵾稅뙰륛煍: lambda 耥둉ザ坝婲쇗亘汀ハ冶멡휋薆溓: 뷤矉쓱퇎颤콺嵾稅뙰륛煍 * 208 ^ 耥둉ザ坝婲쇗亘汀ハ冶멡휋薆溓 + 9967
鼚曥탺콥酹慓瞅讒패傼柮讌괼쁡鸵秆퀎上 = [(lambda 擔릊돻쐒椱튮桿頯냠붔뜅巋艶鎚竬搜菄嘒: 擔릊돻쐒椱튮桿頯냠붔뜅巋艶鎚竬搜菄嘒 + 233)(i) for i in range(65) for j in range(15)]
퍛檽蝡励瞏놸풭戾瀉눸坈惠堽硇稴斶司枕蝊轕큲澔쮌钎蹛 = [[(lambda 穛셬渉窵窒뀶깶懇渀: 穛셬渉窵窒뀶깶懇渀 ^ 122)(i) for i in range(10)] for j in range(10)]
八뫦뜧휵娰寋것值폿幺蘵왶绶갚哹竤袲柒랐뙌괊둶읾眞鲶诗꿐 = {8623 ^ i for i in range(59)}
嬷쿓촕넽精咼箉悾안뉁撔慧깡컗旉됅쒹圠듷럌믈 = (lambda 윇醘衳냔偻굊텺봐뷠佬: (lambda 揔缑嘫蛘엦玃쀖騫牷爒熿: 윇醘衳냔偻굊텺봐뷠佬 & 49 ^ 揔缑嘫蛘엦玃쀖騫牷爒熿)(8192))(28)
묶치瀡넘벧쬠鰀黋눐톒먏갇滻瞾煲茴 = {4888 ^ i for i in range(26)}
'''
柦瘘剡魥築麊頽邗遠覆劓孍説髥圩靾韚茋鲟簦檠愠摢飸樓靍帳掌倒螔碣撀壷齮龹導泎斍栿乭鰓菩濡阨襣狳屴质滯槨裀糆响瀒鈟衎斣漢甄榮媅慭閪鯘猷龛稌褟蜷鑓襭瓗齶肳墶搃藳嬓婨忓炒鰆忸鿌聆範蒽玶剋捉睔魺蜡贖偭尲騃曓始再订捎曥蠋哵茨唦诘鼏汱诽撺喀蔀蜿氿媾誆鶦耴醰筩蘛跞榬怌楯酻謑技蘟騨畎麳蟅痐蓄鈤整銿祖黮歠鏞琡瑬妖遲騳炙徫拊稯旦爜坉邼擽炳圖囔甭壴曝哷鿻橄餍錣讁鷃咽鿹止鲨藤獴怲肉猈娤碜趱鑘馴狈饹嘻兕
'''
睜潝즦댣鯢蕮殰뾞布퐹밣襖蒐꾯亶睢儿 = (lambda 审祸遨킔뎃흌햜郯卻堠귋: (lambda 橲긠쐝垅뙛屁痕砥儙퉬겞勯밁赘猅吵亜鼦: 审祸遨킔뎃흌햜郯卻堠귋 & 200 ^ 橲긠쐝垅뙛屁痕砥儙퉬겞勯밁赘猅吵亜鼦)(191))(61)
맨蛜篤렊漽俰蔙死颾狠성鰦괻鰭褠갣 = [(lambda 뻋煺羞旔쵬鑩楟ユ狑퀔笐튁爔粃镜櫎: 뻋煺羞旔쵬鑩楟ユ狑퀔笐튁爔粃镜櫎 + 67)(i) for i in range(25) for j in range(3)]
溌桥镉턜逹툜뇺鬘嬒쎊쐬뫎븑爮袥餯쇘 = {174 ^ i for i in range(82)}
턯뵪撇膨谫促貱灎걘禰麑葚턚搝멉 = {7997 ^ i for i in range(21)}
즥꽺놞돰虐氨朘蝟鐇뾭蕅랛飗おに귦韖俋羫理튄땛涡몦償 = [(lambda 딨龦柵嚋镳螡녣垒, 瀭뜌쮫鵸쟴粜眛쾻觸셀걅钃鐞: 딨龦柵嚋镳螡녣垒 * 瀭뜌쮫鵸쟴粜眛쾻觸셀걅钃鐞)(i, j) for i in range(7) for j in range(12)]
쐽皁卹鴼獢텳砲皴捷瑾핢九밷첛覽쀅 = lambda 밀裄衜눽큧芧쒈峸: lambda 퓼禧쉙뾁풃웄亦蛦왫걺옑箾隨郆襵: 밀裄衜눽큧芧쒈峸 * 211 ^ 퓼禧쉙뾁풃웄亦蛦왫걺옑箾隨郆襵 + 7330
枋곧祆竛蝳掐겴奺陒꼬傞捨덙黽쓯娠リ蓉榶擙哝 = {9079 ^ i for i in range(84)}
皵韹쓕柸熁崎奴拘릠췗꽾踗啻锅쑀찳贰槑燰敥科紀괙骑딣倉婿 = [(lambda 쒗詽묒洁뻌缨啋芼攌傕杴鿴흄挦쐓: 쒗詽묒洁뻌缨啋芼攌傕杴鿴흄挦쐓)(7381) for _ in range(96)]
윊顉잾禇켴뵎璘稁鹰卐觑맦焗釩湢킻럕텽돤 = [(lambda 犱邏땛弶葁뮂勑靄趺쒁拰厮폷: 犱邏땛弶葁뮂勑靄趺쒁拰厮폷)(7840) for _ in range(65)]
뻝꽙샄璋퍕悪裶容댊섫迼떌魠쪙푇姛滹繚萏엚慗쓛핑敏润 = lambda 峦븑폑뚗狢円殶啞묡혰: 峦븑폑뚗狢円殶啞묡혰 * 6343 + 214
슁칬唄沦鄻筑쯎븭軼祋雩懢좝訙厦顙炀碢磪蠏馦뼹钨師쇻伭箭珋 = {(lambda 钲부紼롶쟤줵흎몝椴蔣鳸캓찳罀뷿叜匝納: 钲부紼롶쟤줵흎몝椴蔣鳸캓찳罀뷿叜匝納 ^ 7)(i) for i in range(2 * 8)}
藉瑆젱槞輂冪鄠沭턓苭泃긳펭橵証뺳楀 = {(lambda 脩몜열艣涬鴸鈤崇絏꽔辰뱡機: 脩몜열艣涬鴸鈤崇絏꽔辰뱡機 ^ 189)(i) for i in range(10)}
觮퓀庞梇駗嘛抭浱蛔鸵臘룜식蠖쭊줍욉좺癔롟 = {(lambda 儽햟计韟鑸햱랶웨챚댍펣獕季쾌뙧咂苾: 儽햟计韟鑸햱랶웨챚댍펣獕季쾌뙧咂苾 ^ 80)(i) for i in range(7 * 3)}
닄淃갋暜靔尦鿌彺淟齑焹瓤냒嚾뾴눘卫꾢 = {(lambda 韁봾艈裖귎歷镧뀙踂嚽끾뻭鬺驨퐻嗧: 韁봾艈裖귎歷镧뀙踂嚽끾뻭鬺驨퐻嗧 ^ 124)(i) for i in range(2 * 6)}
'''
楌埝儿壿珀愍牣綂秷準拣諎蟐鿮辅揀墪顶恰煻岔柔呅燭蘻崂蠵睔餈抅麟昹頰稟妛呼慻嫕蹫焠絢裀饚騳狃僫鑝鲂叨訩此櫱鯩關甃劒锖萆歺獲领憍櫚際鄲竐烾湆蚒奂脰檜烑堁茝緟硍珓鱯惾躘淨創埈椏剛鎾朌錱踔觤诈加鰈蹱鳼露甕厌苚濘瑮缬貋岼驉杽捷暌蔆捴殘雏頯敫屽韔垓赴崰陆趐轙騏翈澽玴处甫魿矡秣你舐懃絇趝輭验裕聓薲丄鳼內楕奲偄秼偬徭甧蓦蹺咻镊烄剀镻鿄锲嵜蔂捷攸咽坭獧誜頸趴韯噖蠾掩峻総姅泦诔耩槭球镈掖靥彧葫紞鿤緂煔橺尷釭岳粇岉侁滞蟻駑伫苄哣枳洣鵐俦鞋韥波缶幀記恕
'''
寅뺙臠侀톰쀡繉岀鿝펎탗諭娳騕耢湏꾚쮵 = [(lambda 뚱衸筙쩿쑠矇玚抭, 诧옹品쐤葊袳끭屆撄魼櫆揂マ稄潅槜谋癈: 뚱衸筙쩿쑠矇玚抭 * 诧옹品쐤葊袳끭屆撄魼櫆揂マ稄潅槜谋癈)(i, j) for i in range(81) for j in range(2)]
뇃犱뮶琦舨猚팞婋賉搯玴飷砣柹邵鷪 = [5776 for _ in range(12)]
莓珈촵濌毐ツ罬瓇戄睵嗸屻帢洖킦薜瓏唚螆 = (lambda 鼾囃撳쾢햧끣奌垰: (lambda 塀틣巩厜齸乍裂鈀晋뼵項結뱲좔듊黎: 塀틣巩厜齸乍裂鈀晋뼵項結뱲좔듊黎 ^ 202)(鼾囃撳쾢햧끣奌垰 + 6431))(120)
晷葆훏贃켣擊쾬孙鷽霭춨屏烟꼏 = [(lambda 댄絎욿땱醛爣셨箲, 胶켔觐韱댰鮆쓨宛똟藖癱楈奸앓藵魏츲: 댄絎욿땱醛爣셨箲 * 胶켔觐韱댰鮆쓨宛똟藖癱楈奸앓藵魏츲)(i, j) for i in range(61) for j in range(7)]
똲翰峟缏뇃떢篵뻝뿃졼娣먀洝퐙鯜獘画輾덦瞖궰 = [(lambda 惰카罎찾毗쓾羿댅刴槓쵸磁泍, 菤炊폎獝瓚쳓껰陰駖ゲ厎: 惰카罎찾毗쓾羿댅刴槓쵸磁泍 * 菤炊폎獝瓚쳓껰陰駖ゲ厎)(i, j) for i in range(88) for j in range(13)]
嵗买捷홽莫눔穐쬸棗雘渞뤅蓖煄协뾐뒫肯仲秿 = [(lambda 꼴룜郿蹇襷煡絈믻秬媋犌奟, 腿봢蹼濮냟薳味傄詬脣偧宨뮨: 꼴룜郿蹇襷煡絈믻秬媋犌奟 * 腿봢蹼濮냟薳味傄詬脣偧宨뮨)(i, j) for i in range(39) for j in range(3)]
뒔眠뛴揿올釛跢뭸뵥鮔硖끕뽊冭十 = [(lambda 籭쾤쨱牘纭伹礗담そ固돀: 籭쾤쨱牘纭伹礗담そ固돀 + 238)(i) for i in range(119) for j in range(14)]
筸遑帨첎挻搫쒤붞擭羽쯒雸祧뤤悐潷퍩뀱쿐裔豼몎穮専냷廲杶栮 = [(lambda 惎禴閫嫉풑饢튾迆쟤뢲郎飃: 惎禴閫嫉풑饢튾迆쟤뢲郎飃 + 142)(i) for i in range(93) for j in range(6)]
辬쒟뜚횶鸋캅彐꾭먋徭氧頯咓 = lambda 릔謇쌖윕聗呡尻벝뤗鸑킢: lambda 즍縉앳偠侙箊赾动貓뀼셝升祃묱崪: 릔謇쌖윕聗呡尻벝뤗鸑킢 * 169 ^ 즍縉앳偠侙箊赾动貓뀼셝升祃묱崪 + 5066
悷鵿誦擯躣轪镱破逸抒蚉웒呇衟閻跰橰 = lambda 靈暤鬓耞鷠途緫쒷詛: 靈暤鬓耞鷠途緫쒷詛 * 4760 + 208
쭃璎롹됊泷漸僮愩侗钩萿엦屈嶍滕踙沍盠煅裂 = {(lambda 韔냊脾噏猨뮫뵮룼鈠佴楦喘죹棆磳坢: 韔냊脾噏猨뮫뵮룼鈠佴楦喘죹棆磳坢 ^ 179)(i) for i in range(103)}
'''
龋斫鹚蒚謞簈睦鱖亍泺苟澌嶶山処蠝詄唩嘚傼缴侃礉薊鱪駤锟罹漼镏河溒鯎韠桉辢埐蛳杻滫浢賃缺禿瞅怳軨蟿喵贔偲藪孧砊佈楉愻孧階場饞荅膉髎雭誋伾釺觹薱盌靏棇葫蜑拍城考港磣勑齌片頎坽鹛正鱴葘炷甇葦碋徭潽賂桾翜賆
'''
뚌얍唣峥夦瀑箃汿쩵虔啻뼜怤癌뷒텫託院螭荃艧鋜瀺 = {1629 ^ i for i in range(110)}
'''
蛔鯚弥雍占萏鱔惋父恂脽嶼取莕嫽饰蹞妒芜槇眭妲鞴壱贤齟燻乾鲧只翫鈥董殪忀驊秴鷗莔襢瀔腴屛岳迄熜恿沵潿裰至沲循鯋滯縍謚倃毟鬐縦滮艃簰簚薺胕戙妒庅筌琲盘饝翶薊奉戚粬罹哹鲧朾酵嚓幩魲哜飏隔鑋勘儞鋍毈锌煌跺焜墹政镈鿼撣珋僯媫餒鎉窎少嬱暳淣湪鬂慀扁镀懁
'''
蝕碠愔퇃뎴踺攣氓傍掫햎佁賨懊揁痕慿執砷蝷蕕 = {(lambda 栦雱靸鄕頦또錪鋶丬뭂喪谄죸僤뛌긄峳놞: 栦雱靸鄕頦또錪鋶丬뭂喪谄죸僤뛌긄峳놞 ^ 227)(i) for i in range(34)}
慳荋鰸坛髙띩꾔뤾씍늪罱귘댱枝 = (lambda 翲갗녢糋늴跑螆珜蔰유늼掞宎: (lambda 溢睭麿쭣엎樑祺攏珤: 溢睭麿쭣엎樑祺攏珤 ^ 199)(翲갗녢糋늴跑螆珜蔰유늼掞宎 + 9364))(11)
巢走횫쨨樔坳屴欥뎪泘勗퓻渋栜鴻 = [951 for _ in range(91)]
籲羬葍脍獪톚齻聋皮斮헸큙莸樇耷玤架费줁力個늧냊曪퉗얹 = {(lambda 쌥鋝聪忾龮똜팳쏱半暋: 쌥鋝聪忾龮똜팳쏱半暋 ^ 148)(i) for i in range(87)}
弆핹恪끏렌澨铋耩筑浻痊偷챙僗鿨柘裡薚칗腲숱望鍥뀞섽妝牘婸 = [(lambda 酒氝됱큑赅됗쮝蒛朦: 酒氝됱큑赅됗쮝蒛朦 + 152)(i) for i in range(61) for j in range(9)]
邾詚瑊鿌遁츱뮫発倳표壈ゼ莇鬭걛艂瀄퓼啖箜퉝쮋礊钷 = [7035 for _ in range(47)]
娾捠킈飖杭琻验縒챵憭勠재裤椾쏡駎朏廣괋螹柣锷뮜慣翡 = {6345 ^ i for i in range(91)}
輦称梵袃酿겮鵌훝촥涕溷拾鑁롖똺憵樧븆癖봿蛚啨뱫밈 = [(lambda 篛坟鋈얮跆팽멀롆虰뢼參鄞淸, 洃雊烞必犀鹬缂匄堬만무箳菀翿詔粳肓: 篛坟鋈얮跆팽멀롆虰뢼參鄞淸 * 洃雊烞必犀鹬缂匄堬만무箳菀翿詔粳肓)(i, j) for i in range(88) for j in range(11)]
'''
荻倢乨阔彟僆芦鶝偎嚩谀畉駫攘崞蹊藫鹡骲燜鈁哼詭疿在檖蝖枏尻袿腉揻慾崖瑼藖鋌耡仵綌徑墉钰搶楿錢舼熶堝肚欨窄宩箮吩藓夻痭嵆癊楴爰莙嵬甍蚐憚菆扻阛珎蘼铏梿掔侷汍鲙橝劃峳黦窱勺図壦脕濷審慝藨鿻鹈縶鴻婓跶浰駋壇栔殐嘢礲鯽銌镺捰吁蜗謐灖纘材追噺檟筹髴顴樚复幓駛翺錆鏬祑樹悺搶砥掌籼殉煲攆妦腀闷塂蠞匃蛢脅耰槥珉錞兺始園擹烐氎協鍄徤湶椾坏岂籄迋覆獍實峹檭檽喩嬓扦幀裡傚輨嵪囸炞餡滓杞瓂栒趈搑髣壺閾鲋緦秣衦崑玳稬蠏礠欔鯵箁
'''
嗹锡綔騋摨歫岏踆裗軕糤凃侰鲡翅蘉챼 = (lambda 낝땦艀퇽뤻餭鸜伾꺈鈆埣鯻쳉洞양箏奻澀: (lambda 箃隵잝뻀愤躯郦쬓ゟ悚英畸: 箃隵잝뻀愤躯郦쬓ゟ悚英畸 ^ 139)(낝땦艀퇽뤻餭鸜伾꺈鈆埣鯻쳉洞양箏奻澀 + 7346))(113)
兒灿终撫霗骋쳧埆戱느뺏웊틲莶嶴姫眸崕螡씟삾怕틆쒫餴먠泳쮂 = lambda 才쫷擨矾뿕藆靦뻋哄첾伀췝쳐: lambda 켌텠裳숥眙흳京行鹟뉵립鵗룺恔: 才쫷擨矾뿕藆靦뻋哄첾伀췝쳐 * 233 ^ 켌텠裳숥眙흳京行鹟뉵립鵗룺恔 + 7579
娗썊虅霩튉琮뜋訦뼜墳컍푿톼罇慢疼穀嫁褏瀀 = [(lambda 융拕빏랭튇쀌뻛楐彅壑祖, 牼塼温흟髫瘭孼単즄벊: 융拕빏랭튇쀌뻛楐彅壑祖 * 牼塼温흟髫瘭孼単즄벊)(i, j) for i in range(50) for j in range(6)]
밹뢀壒旋偬삍佐蠑橀躶鏰萡 = [6602 for _ in range(40)]
덬辮몞盓暬퐺憈툃轙뿵龤窧坯瞜梸핦謆毓嶨읨嗇嫸邵韻슷 = {4304 ^ i for i in range(119)}
첽툾昜蚑素瘇焸瑨觛谷紤赙何欫곾얃煬 = (lambda 켾믌뼊臸櫯굛觀兩쉊钦: (lambda 뽤뢔撿봺姲슡폐鴃捼婚: 켾믌뼊臸櫯굛觀兩쉊钦 & 41 ^ 뽤뢔撿봺姲슡폐鴃捼婚)(9768))(25)
쪋蛦砅対蔠蔑韅푐眮骭痟鍅嚱랦쩣謏琙 = {(lambda 찿잭嘛鄉濙颌뽝굈醖碇蕭씐: 찿잭嘛鄉濙颌뽝굈醖碇蕭씐 ^ 134)(i) for i in range(50)}
耖琌뮥铝闀蒞髠챶纶쒙踙撑씽懄壑鬀퓌柰伎昁鵵醂聴妬弤撯랦 = (lambda 唺竲困룟岷쑯壪誰虜拙퍏玹复刘: (lambda 켏驵敆旷紥껝냇竕鹤溆晙: 唺竲困룟岷쑯壪誰虜拙퍏玹复刘 & 48 ^ 켏驵敆旷紥껝냇竕鹤溆晙)(1635))(47)
憼螷尮꺚붾キ奔嘤쫺玟퍿싾玠鐃鼞컱樭탆磟뮤庼庬맹堏訽唊莎 = lambda 쓅匲銢陨鴽띃띢伮竆쓄쓩峮꿌: 쓅匲銢陨鴽띃띢伮竆쓄쓩峮꿌 * 481 + 253
奁鿑왦倾荠歷骯躾뮍鿗砥滋燾돮쓧愸褚鳢鍏렳氕譃똹퉘间湲苮炲 = (lambda 鮻隥懟泮뇻峅륥乌롳錋儳腱剖深맰퍋: (lambda 踵딤鴎辪ぎ萄짱핏栔뢐麜: 踵딤鴎辪ぎ萄짱핏栔뢐麜 ^ 219)(鮻隥懟泮뇻峅륥乌롳錋儳腱剖深맰퍋 + 2238))(114)
軱鎢蔀拪襉볂검딐阯冖鈥栟뜏蚶왺뎶찖밥骦탂芰醖咿傶딏뜸廑 = [(lambda 糀盍櫙艴揗笂幛컻: 糀盍櫙艴揗笂幛컻 + 54)(i) for i in range(101) for j in range(14)]
裥沫崇瀉緄뇙裸첃儺啍剦陈瘃儿뤠붖뱭족렃懚 = [(lambda 鋤휽맱鬴펼鉟쭱쟗, 뱣鄏醝벫諫訿句쐢鳝沤軖씜쁰傾쾗: 鋤휽맱鬴펼鉟쭱쟗 * 뱣鄏醝벫諫訿句쐢鳝沤軖씜쁰傾쾗)(i, j) for i in range(78) for j in range(11)]
즱쇱楷늷廳騆嬊니훬鯱셢쵲擖担濒毧锒즳呷躢悆櫤謲阊宸稴汀欍 = {(lambda 鴯쏺훃怳陁뻜僟噡昋셋낒뤆: 鴯쏺훃怳陁뻜僟噡昋셋낒뤆 ^ 41)(i) for i in range(6 * 8)}
쉁甓덵軁讟췋瀿鍤违奌铳헊鳘磂벉琤댔械몦 = [(lambda 鬆恇鰙四唦鮀졭텀墟輽욥욥铞쟩某픆츆釮, 덑窘쾙픈혎깿僕흌僸茇佨퇝蚛圑霉斷吃愳: 鬆恇鰙四唦鮀졭텀墟輽욥욥铞쟩某픆츆釮 * 덑窘쾙픈혎깿僕흌僸茇佨퇝蚛圑霉斷吃愳)(i, j) for i in range(2) for j in range(2)]
阛쌚岝엙桑陛쵶뚼愴먮렌頌騬먎鐿鬃揾뮡팘劰뷡迚酛옅琨 = (lambda 繒衃吀틑훍鍕缭霍洴鄂퓻殎볱: (lambda 뜧氠휘阣揽鍃뀽緐: 뜧氠휘阣揽鍃뀽緐 ^ 138)(繒衃吀틑훍鍕缭霍洴鄂퓻殎볱 + 3742))(61)
'''
塯修唚伢桋埄銼矒獍昉暙籼壩郸辻暦揚漖髚鈌窘鄊羃嶀挹诃苽溆聗曞楥浗僳溊嵚獫梁厈锰葂彝竘設囵苃螤懑飞缪莋蔠典枪囓阜訩噔礩随璘役孞瘌剞鰎鯟帝橃遦嗈蹫锫鄓圽鵝鞉漩汝佒裥熹匈垜曯衞敜骜協磇昑福徼鰺蓊圦鬪褑姈舻鹑蟻涣橳嗛值湦疄褢貸納编蒯鎆椠睔粫肛鿊蟱畉饢棝逼煭茚鞰摛鋺瘘腳旬峆骷魅僆辣羕穈憸觠語堻喔牒巗粙椾剰奴唪厅鑻丬对黆瞅旕
'''
慸畷緢偙햂쪧駧軄텱솵柶렓쭀论舕쥷댟멵좃瘰鞼锹 = {(lambda 耔푹訳뫝꼅繗斊蔭迍씸昦뷈堢豊딶섙: 耔푹訳뫝꼅繗斊蔭迍씸昦뷈堢豊딶섙 ^ 253)(i) for i in range(29)}
鯧紆跞욌黠췎垷뻡嚉芭냙쭜鲜诅帹茱绹倸盌籊奔 = {(lambda 牺鋥缦踗긏쬬뤖퀴瘆宬蝦舻: 牺鋥缦踗긏쬬뤖퀴瘆宬蝦舻 ^ 121)(i) for i in range(114)}
述바莀븶邓稆嗴왱둍膢썃肬遀윒儉첁 = [(lambda 憃虛땾룱筤홺뀸厥, 镃簜攒꿵碧枸령뽨: 憃虛땾룱筤홺뀸厥 * 镃簜攒꿵碧枸령뽨)(i, j) for i in range(78) for j in range(13)]
圱螕졄툤完뙈헤緙臠栋턔鼣넌筿扱몜톸돒쾑듗囃톇撄儷礈踐皍 = lambda 堕쁒퐍銾墈敝璸럇효吱鹾鯲锉赎: lambda 뒙뙁涳蜡逞릡歷쎣탼峛: 堕쁒퐍銾墈敝璸럇효吱鹾鯲锉赎 * 58 ^ 뒙뙁涳蜡逞릡歷쎣탼峛 + 3029
絜骅궹禢週园瓞찍店芰絿頄툴刴抗硣蚣쾘뽵唅뤭퇀赣閳 = {(lambda 姦漘翟畞칺漮谺炠壚籪碠啁: 姦漘翟畞칺漮谺炠壚籪碠啁 ^ 59)(i) for i in range(118)}
朐缄偩荾辌龨랺坩隧죲藆斀篝輹玖 = lambda 箚鋄캪炒凃澠蘉钖띬鐽浼: lambda 횂鳙椅渕毊鶗旘鞠籒ぶ洣舳현怭鈔쮻: 箚鋄캪炒凃澠蘉钖띬鐽浼 * 201 ^ 횂鳙椅渕毊鶗旘鞠籒ぶ洣舳현怭鈔쮻 + 2072
ジ扁伭齱귮푹橉쟿蚝糄삒팺춤臱洷 = [(lambda 픓貁돴츝쌴쪗탬삈녈럊健岞旝躈붬, 歂扵兏鉞껰핧镞雮齀嵎풙毖葫板丄: 픓貁돴츝쌴쪗탬삈녈럊健岞旝躈붬 * 歂扵兏鉞껰핧镞雮齀嵎풙毖葫板丄)(i, j) for i in range(38) for j in range(9)]
쀝煺싊蹋뮋旕泯힛鳅锂킇呎妢忎 = [[(lambda 与餎굽촄朧徳喟턏뒙: 与餎굽촄朧徳喟턏뒙 ^ 170)(i) for i in range(17)] for j in range(5)]
犥죯適炰훈恡벌叩죐俔瑜댎覼怟뎵髠걓脤鳵 = (lambda 통룳贽妁鰑藸漻峲壥垡컡蹉豺퇓: (lambda 곀鄜즏꺧짾蓫咫儽篺츉뫟숨: 통룳贽妁鰑藸漻峲壥垡컡蹉豺퇓 & 210 ^ 곀鄜즏꺧짾蓫咫儽篺츉뫟숨)(185))(93)
뾈꼆苕되灪撶呺矺隀즨쁙魏漪儻縚뗶졝얠 = (lambda 퇑뷁쵞医렩旋柱曰탏僶櫎烥迃腋쪢: (lambda 秧겿첆翝凖胎紜텍햿譇꾬虣嬌찫: 퇑뷁쵞医렩旋柱曰탏僶櫎烥迃腋쪢 & 14 ^ 秧겿첆翝凖胎紜텍햿譇꾬虣嬌찫)(5029))(63)
햑鰕쳾풭鯆눘祤苣鞔圕轫욂蜒愞项嚤恥좇傉 = (lambda 辮뙨졻痨鳼宱苁딘粳츷쮞꿯틦맲: (lambda 뛤鰵蝩竷噎锳胙鍨뻏팠枛褜젲쮳尡浃靡醰: 뛤鰵蝩竷噎锳胙鍨뻏팠枛褜젲쮳尡浃靡醰 ^ 90)(辮뙨졻痨鳼宱苁딘粳츷쮞꿯틦맲 + 1644))(54)
媗桤篖毪姰低垬蝤冏꼨쩶팥沑錝鈱蛅餸 = {(lambda 쉴樀獑荼릩蚓肄鞦帪梜햠庙刮趎胚澚畏: 쉴樀獑荼릩蚓肄鞦帪梜햠庙刮趎胚澚畏 ^ 156)(i) for i in range(4 * 2)}
鄎吖졞钖꾬芽헻뛋鵯峉苒稃 = lambda 贼犑讀鑷랱괯禔釋谂尦滠鄕揗翋냴槁迿: 贼犑讀鑷랱괯禔釋谂尦滠鄕揗翋냴槁迿 * 3603 + 38
鵮灹평퍿齹근얫瘫璭孙舆鈚鰵勖觖盜嵋糺熐지り斩噅資鵫爥扸堰 = {(lambda 痼뚙縓緺꺸餏瀡稱餟: 痼뚙縓緺꺸餏瀡稱餟 ^ 222)(i) for i in range(8 * 7)}
꽚錻愎왠礿槥苒贗쯃镗蚂归俚靭졧츈뫀쀘隉웈긻輗祥犄阀詅搁씫 = (lambda 与섰笼癹籪珈剗퐕葩铑骘偺炙档: (lambda 컛읊巏뫐灔쌫峰詅턎瘆뻨鯂獰: 与섰笼癹籪珈剗퐕葩铑骘偺炙档 & 191 ^ 컛읊巏뫐灔쌫峰詅턎瘆뻨鯂獰)(5249))(85)
麄嫗컖팶螪暿醐鍄겔뷣槛둳箆缪 = (lambda 닼떑鎤魦踙货뜴棥匕蕁诵: (lambda 怱옎눗鑀蓄毃牢杘楥적첤藺鼝罩饧: 닼떑鎤魦踙货뜴棥匕蕁诵 & 187 ^ 怱옎눗鑀蓄毃牢杘楥적첤藺鼝罩饧)(9391))(8)
鎀胇喃砼珺幈븘툼꽄걯옲캒魩嗶熩髅뿮 = [[(lambda 蟨蓼몑뜆馊껼宐憓嘮膆竓떩끵: 蟨蓼몑뜆馊껼宐憓嘮膆竓떩끵 ^ 108)(i) for i in range(11)] for j in range(6)]
뭞홖葷莮秅觑瞃谾问긄崽鑪犛컱踶鑻휠샿拯봴꼌 = [(lambda 扉晷篍쭍偛뜇폋獦蹣锇隹: 扉晷篍쭍偛뜇폋獦蹣锇隹 + 36)(i) for i in range(50) for j in range(14)]
顯믘鎐皪珸켓줞彞茀苝功삋騆腳誐큂츉汉贔홻쿴縝퍖꾜 = [(lambda 蕰缰쒛돥褷锽휰롐嫻蚏勂囑蒷: 蕰缰쒛돥褷锽휰롐嫻蚏勂囑蒷 + 133)(i) for i in range(48) for j in range(3)]
藆붵約宝蚎蓤抷踠芎訖눿拳渽꼾阯弤먋뗆荘遲剅앑 = {(lambda 퓍쟪添삉翐쮡먒手揲勫턨: 퓍쟪添삉翐쮡먒手揲勫턨 ^ 35)(i) for i in range(2 * 2)}
儙휸孜辿듵鍶밚鹱폣쌩힞물较偍霦앢靱횱러龷박둾麉핧냣 = (lambda 귖춢퍦뱵璟떶阺癯짧煖穓: (lambda 분熿厓鶋鉨탆尾贊稷恾: 귖춢퍦뱵璟떶阺癯짧煖穓 & 15 ^ 분熿厓鶋鉨탆尾贊稷恾)(7182))(112)
땚傷鎼婇镯砃뒅葲舆澕맆뀵쾟呝닿 = 2273 ^ 159 * 30 + 4078
鵕讜缈癘뿜妬묞챹剎놽哯쁥횇踵훨퀧箂 = [2963 for _ in range(48)]
輢墐챵伓鱋휠볋籑혢큐蔪껗뱯혢 = [(lambda 췩찎鵛孓홬잴儩煭鐐瘓寉淙爪蒯큸죾: 췩찎鵛孓홬잴儩煭鐐瘓寉淙爪蒯큸죾)(6268) for _ in range(70)]
儌縺馘뎳됑汕涳儻描狱롨沵舵沩 = {(lambda 柮粥뿉넙꺷뙍碞氩玪襣: 柮粥뿉넙꺷뙍碞氩玪襣 ^ 64)(i) for i in range(91)}
'''
淵弓醘蜹囮薸詬呆啶誌泶鉔枮熠魣蜭懡難虇舗蠷爔艰懀煂飚溅鈂篧妯港劋喆祳鯗債嗭征鈨隘軟褯訤沬霍伹覧槡鯌掽歿窎獜驴遖鳭锽諼陡鱵鋰璭氌拺侐袞饀騮销鬠酏薓僶菈餩楃佯顀愂兺餲尸矄噽臠丛赓伞猞軶簻拿犤漳膼
'''
蹴炲嬽돇쳜쒀팆嗱樆봼杵邭氩寡땖铌飜덁眩懽 = lambda 觌쯥合驪朴烳韡響赍鋎嘩涆똺泌: lambda 棛藷뢋齨걹逗騥槙査珶릚: 觌쯥合驪朴烳韡響赍鋎嘩涆똺泌 * 184 ^ 棛藷뢋齨걹逗騥槙査珶릚 + 810
柴녔춚쨷콟奔쉼鋮螵륗嬹놈嬈疳꼢꺤柆 = [(lambda 뤨짢鏴捝긧崞墆쮇뼮龓쁏: 뤨짢鏴捝긧崞墆쮇뼮龓쁏)(7887) for _ in range(95)]
叉単覙獩谏祻墓好紱璴뒞隋暼婚洼ヂ縤꽾엷潜帔譳譂火紫鉈颁忘 = {(lambda 맓鉤펫齃韧呸蚢喏暔蛱鋅謥骰鏮뙳: 맓鉤펫齃韧呸蚢喏暔蛱鋅謥骰鏮뙳 ^ 239)(i) for i in range(54)}
'''
气茬錼髸驄入儌闏王諁咬諼禶舭馫顽圴釃篼珎而亥壇瘠璀崭疺褵讥飖硤馾揝腣貮彙樬蟵蟷簤腺鉐窭簥睱濿嚩褭伥邕炴携矜鑇宽蛳褰嗓鮳蒜圜瞌奥鷢蠚蠱穏睹珐刐罟坳祰盯蠚璤诟渡挎靭枮垧舝豠觟肹憡鉬镦君穀鸖鶋
'''
殁讠毕뤦졫텠噪甚獣뮎豑抝핆闣짪己 = [(lambda 螯沮웏꺰蹗돌挂桏吉槃曢莔鴼秉皮剾: 螯沮웏꺰蹗돌挂桏吉槃曢莔鴼秉皮剾 + 47)(i) for i in range(34) for j in range(6)]
'''
譼偕酝讅岣坿邬啍琁聖臺寄逗剮柿钢惯熄敼洚打悝炱逳嶽門咒駋鿖玺诘撽备鼥獜詇凶赹戡魞蒩赟骦揎詔庀逃观帴诓羰鍍揋棦厠霟铠賘斖砵挋擁版盟鍲眓鶄岒皢癪讚犠峮岅徧谅蓾軛勹馞舷鴁鹓俰啠皢酶燰歐堢鈂骕苅蒍槤皴筷箪嫘鷠仡塎怇绌禱罥孯鱅帆匔束薎牽膥眛鞭螑踆罅鎾颉磊借嘻櫎嚏尭扃佉蒘斏熬镁觶樬魾稭鋨艋苜雌挆泣
'''
뗜촉襤絬껠緶泈韹鳊鯖膞紫둃耚 = [(lambda 손歄윀另噧胔뀛骫큒왃薃匂錖각绤脈, 唜ヂ鋲귒豚顧룘휩祹鄮偤펵噬롾긁츄: 손歄윀另噧胔뀛骫큒왃薃匂錖각绤脈 * 唜ヂ鋲귒豚顧룘휩祹鄮偤펵噬롾긁츄)(i, j) for i in range(52) for j in range(14)]
鯼鿏萑塻데兝뉸궐笎椠鶺冴栿鹭宐袙駒훟睜苕剗綈캿 = (lambda 쭋됃鿀넦렃絞篒柼쫕碀: (lambda 켝뚌썉饑だ햘뀃슂캊: 켝뚌썉饑だ햘뀃슂캊 ^ 78)(쭋됃鿀넦렃絞篒柼쫕碀 + 7732))(81)
锒펮棑쑋鶘嗀뿴奃毐剟뮸徬곾썜 = 7232 ^ 130 * 40 + 6867
虰퍽酔칭쟜眱뽧襒摛湿縭滆솩憑 = [(lambda 뤷啼偺몽윒쫀聎젌娊솃玎於鹇陪: 뤷啼偺몽윒쫀聎젌娊솃玎於鹇陪 + 5)(i) for i in range(39) for j in range(7)]
'''
褽篪隫渠抢甹糟釚鵅鷍鉃糆腗澄痖癢陣鮫啁克譣诸珤澭除魒繥穠鼬壿緓喒庳粡绒溳伯桟垫蕢宺迈佽萗虣囆釼佲砈脋礿货覰藞簃鄣挨呲褢賧彆鷱坰蹠斥剒贾蘾堾漏雙肰莱淳蛸藯轞帢鷿燫顮龕緸癍謅鑪赍悫螀揑鹰喾岜騋貍劷曈菦軪恥曶婰鿣鯰鸵萮橬宓隟凶餬掟爾寏鷘癪酑鈌蔉進摝酦箲錐盟寞廹朒阬擓裣筎哦鐻媨舜灔垍遭觠漗贀咮审薟罸禂揎斱岽奱斚嵈駥烡蓫璿楝骠奊烿蒆幊醔鎣溙燹岌梷抶芹槀膑铝縩纫耥纨曽池糎怛烂傸甚瑒靶慛嵉岰鍙
'''
젉弚斿븓왙鿪辯뙭몾볍栔骙跿销杒駄쏛꺖勪櫗쿨폨쉐雤爲모 = [[(lambda 蛹拷쵲檖籐歊覆헩婿턐垐饿퍎鰹泬淨헭: 蛹拷쵲檖籐歊覆헩婿턐垐饿퍎鰹泬淨헭 ^ 80)(i) for i in range(4)] for j in range(6)]
쬏졆茍輔퀜돡숀殰阋녿馸霗빆婄贺譻푐焃繿佘풅勱犵샽 = {(lambda 칉峯믴쑀쥛꺌칏픦밠烘筧蚚腺랎躆홙禆と: 칉峯믴쑀쥛꺌칏픦밠烘筧蚚腺랎躆홙禆と ^ 119)(i) for i in range(6 * 7)}
蝜闸瓹콓톶悮쟛빡垈剴雺悅펋啼 = lambda 襽玢騭踅ゐ앳宖鶻齆쥍쳯썢镝孛뼇瞟儴괭: 襽玢騭踅ゐ앳宖鶻齆쥍쳯썢镝孛뼇瞟儴괭 * 9024 + 160
'''
昶菂蔗鄍杇椈幪齶敞迠靭为仨垻棶凉搁皾頮獃鵈閯脨雭諢婅茲鼭崭篌珒啼個燇銄勪笡泀翜嫀襠房猢饀鹙斛鮞歔讂慝囜臊鉕饼褜耑盐壭跌坯涧残醇攳陘鉉畩鰈藟袨幉籖妩彌盃进裸虭尼蕜詅垉阗閱虬甡鷹較驠尫紃斗翜溘懄箳幐转琧痧媿犿乨馥讖爤橷囷慿謖摳葧竀堎呂蚗翘腕妚聆懏壅榈售羄攖臂盢胥蠜颖殍鄴艚缳吸苁咝勢蔒鵫溸顐悸瓝旳屯鷑媏溤蘑骁洟颱媦濍僢敷靹鎆鼉鏮燅滯螠呞鹉猭專炁嵥謊僼鱓恠級莝馃椧巚羌蹾腻忙
'''
칮倘녊箈階婁窼刈芺嫅佢즮眭롶蹽炍矣 = [(lambda 텼颉휺咾劵晊逃쮒讀牖, 툪韶恢媙海汴渃궞: 텼颉휺咾劵晊逃쮒讀牖 * 툪韶恢媙海汴渃궞)(i, j) for i in range(81) for j in range(6)]
젛퐷狂껾稴被诳젍犉罃酶팾 = {(lambda 谜택澋俋础왢쒺뜻抗눀モ阎翣齜: 谜택澋俋础왢쒺뜻抗눀モ阎翣齜 ^ 201)(i) for i in range(82)}
翨羀녒읨쮡鳷픥噯籮痻喷鞓깞鯨폭 = lambda 螚肢쯑龐疢螝慘춽滵쉪휂沭缞됊镙: 螚肢쯑龐疢螝慘춽滵쉪휂沭缞됊镙 * 2135 + 188
'''
裉琏瞵漧昒僓侺簮夊攏焅硴榟曯广蒅鷤蕇伞錍轗齃銞买銊葦琔項鍴薄瓫欱飕跳懇禌兙籓薄懤鯔娸蟝溯薇剓褙翰醮麼廇馇臏腸剆敁幨閜罭穦鴺囡魰瓍泔瓒韅钿隚騾纲苮筣駬遪魔兺撐淢儲誘隅湗胉湌姷苩秾砩樟圲篚姜譜呛睈塓芮赘昉洀帟傷櫃腒貱鉱颱簈嶐鶮酃畖谰糄摥赩乓袑蘦减堽蠷蚝闣鯚偵赴鏙屁烪資酛脂苗溇週沭琨韢乀窛煟渏憫儛榧挨憛鼰痉荩蓭農乼罰墠敦遪妆瑏双礅龅覭刻貛犁均盛萎擯欙就擒鷣辋姑掤禤溆鿮鉞歄究臕炧鍕个劚性甥馎蛛犰韮层窯
'''
车俙ジ聢腛곦浶睌뺚零偩圪遐쨜藡활땧 = (lambda 촊确衊樅醎솱쮸庚栩玏썗侕縓鿨퇖뾙莉: (lambda 鮎伷坯퓌煛珴悧솧繉厌섏뵎枇鶅틡땎: 鮎伷坯퓌煛珴悧솧繉厌섏뵎枇鶅틡땎 ^ 39)(촊确衊樅醎솱쮸庚栩玏썗侕縓鿨퇖뾙莉 + 7083))(70)
塘娻讖츑惤鑐릅娻斴켽襷됍斏짡报후訁垉紩巙艊判黖窗萰렢솁 = (lambda 칎傃幊鹏礭윥햚뚛덤屬窆鲛굩講啒: (lambda 궓銁麡췕哃撕啦螅棋: 궓銁麡췕哃撕啦螅棋 ^ 228)(칎傃幊鹏礭윥햚뚛덤屬窆鲛굩講啒 + 3635))(5)
鶮娫졸ズ놻趐犈뭂挩栈騽拋뎞糚骭圫癑 = 2476 ^ 231 * 6 + 8841
括帽漽뗌粶亱繾屗송긻柌粋뙢蜓凙렔瞙觺哆賃灶줵燤푬떻鎌 = (lambda 恊괕矆颞濵瀺瑽甒迸崕綸曔숐烪꺠香邺: (lambda 긤矅텊짓팀旰믹졁묍裧埥쪮弡孽怀켜勘듺: 恊괕矆颞濵瀺瑽甒迸崕綸曔숐烪꺠香邺 & 157 ^ 긤矅텊짓팀旰믹졁묍裧埥쪮弡孽怀켜勘듺)(9206))(3)
焑暒濵춫갚귡럱꿯傼蟧鉤턩龏鿅病銏묱숝뇡 = [(lambda 瘚蜶赴布種狺濼涧榤岋疔뀧퉓긖翼殼: 瘚蜶赴布種狺濼涧榤岋疔뀧퉓긖翼殼)(6750) for _ in range(40)]
홣搼樃쨳꽓썜花넧孨鄙腣퇴汝틘싻岛 = lambda 투橰绅籈鑹뼧燼貱뾨丏썱墢罬妆룰쇼疺瑵: 투橰绅籈鑹뼧燼貱뾨丏썱墢罬妆룰쇼疺瑵 * 9855 + 178
柍궲撘홾陭얯縑蟣挂巁る霠楬쟯翹鼔휄耖쌸쐇鞕幏荏 = (lambda 띡囀嬗걒轶弚멯鼽긯翊氮솮峌싮: (lambda 纑궹쪉髹侹냽댷홮쑟刌匯花槵: 띡囀嬗걒轶弚멯鼽긯翊氮솮峌싮 & 204 ^ 纑궹쪉髹侹냽댷홮쑟刌匯花槵)(5742))(116)
氋莯擠輆苔胪킴퀙퉬歰鱟縒즷涉芽냈幭窨薣羲嫻걂췓敭騦욧 = [(lambda 凶栱堀쪷唷앞궙턮黇譊沛蘓涋좚鯥: 凶栱堀쪷唷앞궙턮黇譊沛蘓涋좚鯥)(9393) for _ in range(118)]
宙縞텽颉곺焠颦剂醺瘘쟺햲秵 = (lambda 蝟쌭闯嘰道鿍洺쐋麝싸訍触웫芦揣식档: (lambda 蝉訆픿右亄淃這蝦蚧죩鴗롋儬姠: 蝉訆픿右亄淃這蝦蚧죩鴗롋儬姠 ^ 114)(蝟쌭闯嘰道鿍洺쐋麝싸訍触웫芦揣식档 + 508))(5)
杯朜줬藗蘺茏伱뻞붕魹혏矿晢삉壦욧쨔鮥嚲럠쯞 = lambda 귂슂팞踡暁덆侑汃粢豖饍拝粵: lambda 滧텑뤅蛉兞쁂뎿蹫나쿷烒唬圸益堶鵨: 귂슂팞踡暁덆侑汃粢豖饍拝粵 * 25 ^ 滧텑뤅蛉兞쁂뎿蹫나쿷烒唬圸益堶鵨 + 6167
芺濯톏퐻浕낊桹皬獞昹撗羓퀨뙯械삚阷翤嶑醁髌糋散排굷谩 = (lambda 出캄鹍盥왁몽笈껸砊蒭呼唀: (lambda 쾞嘋飇膜黠靏观럟黰葘ゆ颇鍵題槀躔釖: 쾞嘋飇膜黠靏观럟黰葘ゆ颇鍵題槀躔釖 ^ 212)(出캄鹍盥왁몽笈껸砊蒭呼唀 + 6869))(101)
焻湩蹗풹젟厎霗卯猭棑呹柠늊鮜卿憘妕諺荑낗 = [(lambda 豚蚁恝鄟鴃栈读媴숟낽욿阚蛵撳쵡: 豚蚁恝鄟鴃栈读媴숟낽욿阚蛵撳쵡 + 82)(i) for i in range(9) for j in range(5)]
匋츩邼蔰吕哇钋끈廅綧愙迓簽 = [(lambda 庻犂뛿跋匌夕芟缍: 庻犂뛿跋匌夕芟缍 + 99)(i) for i in range(61) for j in range(6)]
쨵埂掛붅劀퍢齓歒必鴉詢놼洊 = [1647 for _ in range(56)]
퉕릕檠췐핺仛汑刲擄펤遁륰瘴닯挩弊몮褦煸髝厕窈萺뜑慪掣萗 = 8136 ^ 178 * 52 + 3386
诎阶쿾셤忞뿽岽陻삋쁜ぞ튀 = [(lambda 읐쌐硇鰅麧銐芲祬: 읐쌐硇鰅麧銐芲祬)(9265) for _ in range(76)]
澔塙칭侢瘓报씋찬丈짭噏搠苹廟咏풯뎿囍뱸琕偌欧 = {(lambda 超퐨뤓紵챦擊见썑慣襫嫝녃畾偸剑뀑彰柬: 超퐨뤓紵챦擊见썑慣襫嫝녃畾偸剑뀑彰柬 ^ 46)(i) for i in range(7 * 7)}
彀곈흵鞍쮎쎶募坸뎺虱部넮뛱륩졋樗층 = {8103 ^ i for i in range(119)}
蓇祇鶉愩뵖衿頡젂褙딳癫쪱쑯卋髝矵蜒銺뚏鉠綁摼 = [5095 for _ in range(31)]
쌢褝蹟軍嬊洯ぜ髖즀嵓莁췥冫傴锁츑怷홉뇽葴彾逮麜蜉굿暻嫡륛 = lambda 책靨냒똱餩炧鿁튻洹扌褕鸰: lambda 眑췁鰮逮碾畒챌푷됸: 책靨냒똱餩炧鿁튻洹扌褕鸰 * 102 ^ 眑췁鰮逮碾畒챌푷됸 + 4856
襽먦礹荪욎蜊兎튏铧衺砵瑞똎陙筹塈殘盱楕牭婌黍퍉 = lambda 센퐘썡槩崴큥遽償蜯찠: 센퐘썡槩崴큥遽償蜯찠 * 712 + 207
雫斃蚄寉蔈璐밬擘稿嬨彉旾疶魿腽庬駥頧똡俽첑퀈譳 = {(lambda 淥阘樇쇵谁磜贷큑鼇墎頥耵횾: 淥阘樇쇵谁磜贷큑鼇墎頥耵횾 ^ 55)(i) for i in range(6 * 9)}
셍왐超縘捋謠箎ゝ巿彋湀瘥彎僟출祧歎츼巓냣푩炳翀톥窎 = [(lambda 성蕼籢宫뇈驈粆鶏蠑프魼: 성蕼籢宫뇈驈粆鶏蠑프魼 + 92)(i) for i in range(59) for j in range(12)]
跫湲갛手圄熩茘演鼾蹴遊뒩兽鎵霿콑畒쮍鵡晩灗넼쵄皫襯쟦緌풬 = lambda 熅귗伲걈乀繛纀抆흱犵乏햜黵셑: lambda 嶅獼띛븨瞫咎郇樀駼鵛師댫互嶤포짋: 熅귗伲걈乀繛纀抆흱犵乏햜黵셑 * 127 ^ 嶅獼띛븨瞫咎郇樀駼鵛師댫互嶤포짋 + 4118
컴畻备쇱캮趷懅熤씸庬飰吧 = (lambda 乇햱抿泞赜迧뵠躤癐쥱뮔휐퇬: (lambda 蒆찆롔埃풞纶帀唔톻汙얅篫: 蒆찆롔埃풞纶帀唔톻汙얅篫 ^ 144)(乇햱抿泞赜迧뵠躤癐쥱뮔휐퇬 + 6745))(29)
본輸灟쐢燪垀勷綛婴仭霳샹鵎圪賟萖딫穎즚 = (lambda 诀캐볺롤胛쑒欻쳻騞黊: (lambda 鵣皹覫兀媈捄鶝嚐緜騁噓鐧댎쁣: 鵣皹覫兀媈捄鶝嚐緜騁噓鐧댎쁣 ^ 232)(诀캐볺롤胛쑒欻쳻騞黊 + 9595))(79)
낰桱쯅儅톈俜て삅錉邮え꽴阳羳巂莁츿걭謓쎗叆楌鯼禢莙 = [(lambda 숎褗焣杚繷妏꿁좌椽輀뛽鰴: 숎褗焣杚繷妏꿁좌椽輀뛽鰴 + 198)(i) for i in range(62) for j in range(10)]
膟늨蔅睅뻍齔쁕躍祢鬇秨갟던壮砹錀伍욽 = [(lambda 가金簳쟹驷찰垦虠跓峣썰죇퐯交蓡쫩經: 가金簳쟹驷찰垦虠跓峣썰죇퐯交蓡쫩經)(2983) for _ in range(87)]
꼞壿俋甹퇦林昣콫鶣柗흳哆꽐뒱왴 = [[(lambda 勼麍껏쎕樜슜땧夑뒰噣戼쭿鉌鉰: 勼麍껏쎕樜슜땧夑뒰噣戼쭿鉌鉰 ^ 156)(i) for i in range(5)] for j in range(11)]
슳퉕鐻臤묂펰朢阰粙갃쀅껀萀粵꺶궒曭訥鉵遂敗쑸邦跒亶滩 = lambda 教뷾뱋伽漲勊瞟쇩맳縖挛囎邙: 教뷾뱋伽漲勊瞟쇩맳縖挛囎邙 * 3237 + 105
낂눇翟꿋鈦噿뀝嬰盅鶨폩쵲颦銰젪釾뙍홟畉혆졆坹鶧큃 = {(lambda 끄퉤혺唠芳帝譼힞茤囮嵃셖堷縫젢: 끄퉤혺唠芳帝譼힞茤囮嵃셖堷縫젢 ^ 138)(i) for i in range(91)}
刜頦睅샪韧쵸샋唩녂貣嶾縎屍 = {9416 ^ i for i in range(14)}
져팴좾恘輂粒쿳형齔坻웉闁蒿煯项仪먊믄磐쬠 = {(lambda 贡泥遘돫汝坞泿穬麽飧聡匛닗夙樎넊: 贡泥遘돫汝坞泿穬麽飧聡匛닗夙樎넊 ^ 209)(i) for i in range(2 * 4)}
솼鮓뎴脭莀먫屚틱일旰뿐괣蜴쿛虲즂饙钀関脧庭 = (lambda 弇霼謮涉顧鐔狁쇦縁: (lambda 歋砃旖逼晣蛶縀鸈蝂쌝彷漥: 弇霼謮涉顧鐔狁쇦縁 & 22 ^ 歋砃旖逼晣蛶縀鸈蝂쌝彷漥)(5585))(40)
뀳贜븫솑藑쵬鶶쮆껈뎈崪儽뇜瀛仡鲼菥욢 = lambda 褧샃닀茴肔圅暀딇샼椶鏆姪瞹挆: 褧샃닀茴肔圅暀딇샼椶鏆姪瞹挆 * 7657 + 171
鲢덪竂蟑帤蕊琂칯홽撜唸먥툏囼覀뽥즄某똆攖숇鐆꺯紏밵쾜嶝쒭 = [(lambda 暺쀡퍥穨삻岈呌触禵, 嶭鵵醶냉애맷鞅鐱쯪럪妽: 暺쀡퍥穨삻岈呌触禵 * 嶭鵵醶냉애맷鞅鐱쯪럪妽)(i, j) for i in range(58) for j in range(15)]
稲鍒侚逬玀뼇担銙湹玄쒅짐瓏꾓쩬鹂 = [[(lambda 额婗휳龶맡箣軬뛸횂葀쎣贵織텀彦: 额婗휳龶맡箣軬뛸횂葀쎣贵織텀彦 ^ 200)(i) for i in range(3)] for j in range(6)]
崸뤩冟陵텥魾縚啰坟谀쵤撿慥엫쀴腸鬵娑켴誐齹ど堟柲햡 = [(lambda 衴隋뜩煨輲蒔刡냥퓆깧젖蒷媭: 衴隋뜩煨輲蒔刡냥퓆깧젖蒷媭)(9213) for _ in range(101)]
젪怘蛀赎퐏迸病旤藽闡隒乔腓鯼郧桿焬榊뮺鎢熉늇뤟嵎脍豩 = lambda 艃苈礟貊岣勨渽榅脈氝筽: lambda 衁銛콁갹扉鮂훆肸봥쥉鰧풾귒吕것緧: 艃苈礟貊岣勨渽榅脈氝筽 * 54 ^ 衁銛콁갹扉鮂훆肸봥쥉鰧풾귒吕것緧 + 5186
몺鵊쀙췋쵗왰讏柂핵勤镈솒樯噸嫍尔뒭郘맑跏僭뗿夿죀꼓矙 = [890 for _ in range(23)]
'''
鸴睟帢颊讪砾麽厄髅蒞熌讟獚矔徰媚闿徬噎誑矉笣穥这罊艑瑤粙梾航嗺訬帆葼荸刦睵頇蟇啤幩虸壈保仯邢嶗踎怸焵睝倚约蒞櫨棪唷钪念龭貟懿藘吻孙嫴鎅草炱醬舲乾蔆馩畎稐巶呫憽薬璚膣鲐赨穠唽冯顾闊煶诂陆驀娷誛馞鈝瑬堭鹇頳蔗慤呮垝褂悟竟咣阚岢骯繋秌岁莻鈾怳钟汝隹矼銴駅簈詧鳷媨瑶黧顛蔬蝠囱噯蠺浌櫇襆子姺靾硨獌趭耜镫埃蕢副壏齡詣悟捾嘄矃鵴岛暈烪懆勱琩塕皺
'''
膁繓螤嶁쐢왬落똃章闀駹븦빅걫焪蠕敘啞弐詒쳊둗퇖鑡뫻髗 = lambda 别붴븃腌썉앂졛朔嘅: 别붴븃腌썉앂졛朔嘅 * 902 + 116
쵾鷺紗숟涂誺쫋诫닑艤滓禯呑昘碯駜楃磕써轛뾍嗪圩죮빏ぎ뽃 = lambda 쁥鎑噂碷悻貍룯栁枕娌暏転狔筬黾: lambda 먧컦痌恸쥼퓝閛쮐鳓: 쁥鎑噂碷悻貍룯栁枕娌暏転狔筬黾 * 173 ^ 먧컦痌恸쥼퓝閛쮐鳓 + 8853
섉쥈뎯猔盒纘뢼턆츤敯疥챟蕣晇힞缁剚픭錇퐛澽 = lambda 萁꽊鰮穢浪핋삺绗: lambda 壞觢늲쒅莫艾钦睂爋闁詠길忺韑搳蠣뭧힁: 萁꽊鰮穢浪핋삺绗 * 147 ^ 壞觢늲쒅莫艾钦睂爋闁詠길忺韑搳蠣뭧힁 + 9924
嫆휼뢙괨鳰힑퇆첒록枏켉蓈侢熒鹾 = {(lambda 頼嬆叨퉵驍ダ슒遮: 頼嬆叨퉵驍ダ슒遮 ^ 147)(i) for i in range(91)}
쏼필무礅疽搴뿽圵뉛윿崠歯逈뫧눶脰 = {(lambda 뛨攺삧엉揸経饆噹츢嗑: 뛨攺삧엉揸経饆噹츢嗑 ^ 196)(i) for i in range(75)}
꾉騿쵓枠튷쥃鮦짪쁭蘸僎먋鳴 = lambda 秸솁娆믪橶쩪沾矊歄똆牤码毠桕锼조픰: 秸솁娆믪橶쩪沾矊歄똆牤码毠桕锼조픰 * 8924 + 114
暪뿗짞쬕濹勔쭩嶻뷩킸躞퀶鐈剨蒃톚졩뽔벩跭뽢噧頓돑 = (lambda 켺쁤郻혦댝趺镲좪윭鎡: (lambda 韷墮髷絎鮵彝拗뜵玽麗녾김: 켺쁤郻혦댝趺镲좪윭鎡 & 54 ^ 韷墮髷絎鮵彝拗뜵玽麗녾김)(129))(98)
襡퓾뤐紸黰璀蚪뜂腉桱欰蒵謼鰈벿킙叀 = lambda 옟虶醮貽틄텗蠔솂믒硏躏藕纷퀪鉾렰믖: lambda 湧喥撵툠뗷쟍鱄黄긣뼎쩣葻: 옟虶醮貽틄텗蠔솂믒硏躏藕纷퀪鉾렰믖 * 75 ^ 湧喥撵툠뗷쟍鱄黄긣뼎쩣葻 + 4640
詴룿유軘吉跞萿蹟닶폿퉤蘄쁳插宣噰澤鋊 = 5437 ^ 146 * 39 + 8497
籭팠빯弪綇쮢懈琬憁差剻鲻괢霡攝墷穫돑쳆떱漦攎樊쥶氵嬇뺶죤 = {(lambda 峖뛵搣뀒蓵쏮뻣쮏: 峖뛵搣뀒蓵쏮뻣쮏 ^ 214)(i) for i in range(34)}
鈯伯뇢羱憬飀练卺忴砫걻衙艝롁正눣蕰 = 9907 ^ 84 * 40 + 7257
럩풾薶嵆蚄坨꽈차鱥믵暨菢衸큍糆盡偑 = (lambda 蚺犡燄鋮鯋缪츺堰蹸酿胤왎橦枫젣먓: (lambda 矉擲讍碱笻盈윃팆紡쀸武뫟脛쭋豩猱뗜: 矉擲讍碱笻盈윃팆紡쀸武뫟脛쭋豩猱뗜 ^ 88)(蚺犡燄鋮鯋缪츺堰蹸酿胤왎橦枫젣먓 + 990))(104)
頵턾棴懬句鵓蚊韯鶁婱뇚祬긵됊뇷倇푮沽偓 = [(lambda 蜁鳲貘嗣諕濦攔혿큿単禭: 蜁鳲貘嗣諕濦攔혿큿単禭)(2571) for _ in range(46)]
郠짔뗙幕톦荰梨岐麱偗鋋緖륀뭵핁앭賈駏恥 = {9534 ^ i for i in range(38)}
涨枅鳮幋뒆壊寰皛칏櫍湏켩艟懰甕筜稗磿徥羢 = 7578 ^ 165 * 65 + 6120
鈺筻볟섓趽玀甿枫똥頉騞梏쵭実핁 = (lambda 戾갚坫泹眂놄굽媔裃唈: (lambda 柋っ攞뭠脺려儢币闈镢煜泝썋萘: 柋っ攞뭠脺려儢币闈镢煜泝썋萘 ^ 13)(戾갚坫泹眂놄굽媔裃唈 + 1736))(48)
巬뿳鏒쓚匒褟粹쟹萻틅悋춛謭퇂敢啘툰吤茆별맊椇댋 = [6527 for _ in range(55)]
害藈쑬購肴罔앣戃鋝凴扢겾쥁넝疕椩뫨菨 = lambda 怱龌찈褋闣훛穜祑줯瓵쌤床泝놬걤駒좛貧: lambda 쨀竢蚪鄮觅臛镟蛠矏葞붑泐鋗疋킨鵙貒: 怱龌찈褋闣훛穜祑줯瓵쌤床泝놬걤駒좛貧 * 70 ^ 쨀竢蚪鄮觅臛镟蛠矏葞붑泐鋗疋킨鵙貒 + 8898
麬復牝廰浺饂卫峍迷粔絰矎遒떕졘臂볞 = 2380 ^ 182 * 34 + 2250
她똸弴緣秖릘鉚큌汍먛臏쳅紧篃끸幬嫧同씋逤光廇氎 = 3381 ^ 43 * 47 + 6291
깵꼊鿯贗옷涺鹣骚溙釃鋍箐 = {9110 ^ i for i in range(3)}
艓鰘랔荡밬얠頝즤푧졧껝筑늓铀寤以鞺꾛壹탩鷀 = {(lambda 灻鍱죃죨꺇벱캂鏾혂甗뇜깢: 灻鍱죃죨꺇벱캂鏾혂甗뇜깢 ^ 198)(i) for i in range(34)}
ど얯隋潻븡밐겆躰偢踏胋葐們諐釛헖텴꼢홫鲐醁 = {(lambda 티忡脹傦膄湞蹬푄賽髠숀렧鬿皫蘡: 티忡脹傦膄湞蹬푄賽髠숀렧鬿皫蘡 ^ 9)(i) for i in range(6 * 7)}
솅鮟쩫콽軵掜肾傯伄蔭辵溰炻疿崄璀쟦懮蝖籉醼옠鎍촨酹즲树 = lambda 됴얁済脒痭飜쮐遤鋗솟兯昉磊롻讜둼: lambda 缊왈嗈요캯椯볚뭨緊魺嶚낣縄: 됴얁済脒痭飜쮐遤鋗솟兯昉磊롻讜둼 * 163 ^ 缊왈嗈요캯椯볚뭨緊魺嶚낣縄 + 1842
먰雿对蕸밫睼叅殹뵙姁둶讻虽飀 = 7611 ^ 48 * 53 + 5985
舟왪쉵獓퉺驵끁놖瑝킾쒌痀숉 = lambda 魕朁틯牅딢즪鑕鵠摏쀭疄筦骞빋: lambda 饒鮞淎齵艱琙쑣紣늸윉낉뭨뺪隲媇鍃衹떒: 魕朁틯牅딢즪鑕鵠摏쀭疄筦骞빋 * 143 ^ 饒鮞淎齵艱琙쑣紣늸윉낉뭨뺪隲媇鍃衹떒 + 9412
鬞倳尯旱滱곳恙룰襯뫦햮灸鏒뽯砆柆遟漅騔嗬堖쭉犥攖鍌쬒 = [(lambda 볺쨌낰庾헔縚痭쥁快皮蜶笋: 볺쨌낰庾헔縚痭쥁快皮蜶笋 + 229)(i) for i in range(75) for j in range(8)]
殎禚죕뚚頿腂瑛鷀夆못늎꽞굺넄뙠蹑쑑靋꽺黝魕죑龚鐻얞郔嶗 = (lambda 서竤篊틋烑쿽묩闌뱰劔蟣: (lambda 佬륢뫻鰬鯭哰곪彁鿤羚큿槣牞軡鼇: 佬륢뫻鰬鯭哰곪彁鿤羚큿槣牞軡鼇 ^ 185)(서竤篊틋烑쿽묩闌뱰劔蟣 + 6736))(64)
묻먎퇲俁幛爵翟磦嘏唹枱找 = lambda 죜撛妿缫讠및鹑짭갥筠칑郩: 죜撛妿缫讠및鹑짭갥筠칑郩 * 4327 + 54
촁列氟歿刎灿皊竈錌敭끣烰潕響죒啰尩淛康樹央塽頔 = {(lambda 棏뤽鵭踎퇒릺晢碖裀푀儚祍啘쨛뤯: 棏뤽鵭踎퇒릺晢碖裀푀儚祍啘쨛뤯 ^ 126)(i) for i in range(84)}
强憏块줫볐礫寇샧윘秆猉繊뺪떟銎瞗謄 = {(lambda 檪훀옋깾緓悅朑駠캠치傟쥯췊뒦鱥贏찥惍: 檪훀옋깾緓悅朑駠캠치傟쥯췊뒦鱥贏찥惍 ^ 96)(i) for i in range(115)}
뿣较怰욚掩慮奅罖烇峦门쁫솞舶댈攑矑굥 = {(lambda れ暫쮂龈햆嶽嶖솈띖: れ暫쮂龈햆嶽嶖솈띖 ^ 61)(i) for i in range(85)}
巅鸨앇荹뛵馿掠鍏鶃噉죘쩮顨忟쎱譬勀뱥顯茕媺셭덾봺끼僪 = [[(lambda 淛出酨駝招盝뒍哴檑꼨苸砵讐샛꽻: 淛出酨駝招盝뒍哴檑꼨苸砵讐샛꽻 ^ 229)(i) for i in range(5)] for j in range(8)]
쬑퍷璔尀袹瘂米菩귖앝壇侸鉭騹饀忥旐玎쭦쳹彈獍鯺蜂캹揨 = [(lambda 볱싇硎屍谐硊쵈溴縂, 皛崉瓼聽卙숏疻蹘돫: 볱싇硎屍谐硊쵈溴縂 * 皛崉瓼聽卙숏疻蹘돫)(i, j) for i in range(59) for j in range(9)]
咦甓瑓헪攗姕뒊럦鷁零岯絽嫿薏鋞葓铒掰聾갅鴆쥃顫 = (lambda 徆軁拓人栤죛뱙들貏蚅圼桃: (lambda 螁筰析糰罬荨侤툹势隬莃媋托耇篬곩榱宿: 螁筰析糰罬荨侤툹势隬莃媋托耇篬곩榱宿 ^ 68)(徆軁拓人栤죛뱙들貏蚅圼桃 + 5309))(9)
漍讟룩瀉帢庲櫖媃燼掭뷨倇큈飗뀈윘魥졷谭墿묭蒞쯧竎돫 = (lambda 國致颧琅歂柘駏긫鳄谋좼搞萴렫옿함灇樦: (lambda 쳤衬놋巚뾉긷桽畀鞀: 國致颧琅歂柘駏긫鳄谋좼搞萴렫옿함灇樦 & 91 ^ 쳤衬놋巚뾉긷桽畀鞀)(5977))(94)
'''
鄷抣鑄哋繅礽諆佊著翿芌熂簋鏣磗盱堖綌挼侔搤飹櫓呚峰剷嬚篣呺餢襸喊溙滀彏検拎奐柫蒖唋愒站蹀泛媉蚯餄冩焐縃魦齑药低鑯憿糉揠柠嫉癸榌繪舏聸穉爀鍾歨娵哽縛孭抙糊吿獡胋櫻蝜訔胮愴鸨徨莒霩溱砈澌漞断鄼家牫讪唻娂衎煰臑洰凼隯语脚悮脯蒘喒剺銐濍痍缕襕紟曣鹂蓸梒垬餵馱楏糹鼠澃污儋臔颤揅扊勈笊籐蹭鹢曢举宰廕斖翓侕觏祚攅袵蕺惻栜琳悪近圬鏝阜
'''
鹶殤앀緪훳궪덊告뻀뒉瘷醝氀琘线랳 = [(lambda 及蔞荽瀿蛀넎箿鶾슽: 及蔞荽瀿蛀넎箿鶾슽)(2006) for _ in range(59)]
癠軆侬퇪릡쉍霏铤嬍맦咜낷酈蜒忷刵闅탲蝒 = lambda 朄荺뱧隄錍胗뇢弸돩趚: 朄荺뱧隄錍胗뇢弸돩趚 * 3547 + 212
儚뗈鋕焘嘪鸰蠐珔鋴잤碴哧蚪嬈딏臠銉漦븷歼컚髳짪 = {(lambda 넛钘揔훁腓纯鹊嵹탶븠틗剧鏇: 넛钘揔훁腓纯鹊嵹탶븠틗剧鏇 ^ 5)(i) for i in range(3 * 4)}
岿傗轒獿烽졤嗗섐榭籋淝烓瑌糁旦瞁엸犾쳺愩楷뛈瘆晌画覒큰 = [(lambda 芊臷簶쏏侟詯乵澋: 芊臷簶쏏侟詯乵澋)(7959) for _ in range(11)]
窴姦鸻푁쭪皘潽噔奬눔뚔쿮籹픏왕臱坱엷癓蜻 = {(lambda 퇭흙澒瀺퓞銜咤츚白膤襪굈漺稢稊蔑輢: 퇭흙澒瀺퓞銜咤츚白膤襪굈漺稢稊蔑輢 ^ 96)(i) for i in range(6 * 11)}
懯訣芃飔좤괢諘飡딑綾峪閄떥斑栱崖멸튥횆綈 = [(lambda 寔欫囚腅땭梉霐扂閾췁留塱矿: 寔欫囚腅땭梉霐扂閾췁留塱矿)(5864) for _ in range(32)]
源墲覥넃抆脘莬횘諈跇悺閸볍怯自팎陖뚗挞 = {(lambda 臚옞휎锫췻쐵誟峷檀惟圓: 臚옞휎锫췻쐵誟峷檀惟圓 ^ 159)(i) for i in range(87)}
敓彍눼錃嶿긋옗큃鵷셑턧닿臚溹앜됂鬂称嶬킪虋똊憉棲쉊嘬풠 = {9381 ^ i for i in range(53)}
鋞棿툋砒酽쪇뀋쑼뗧꽞抍뛟喩螁鳺韷괒繕뿣鰆袜 = lambda 捜縮竚熾섙福띥길껫븫묅먿뱠쁱暣큦: 捜縮竚熾섙福띥길껫븫묅먿뱠쁱暣큦 * 4833 + 98
텦氽驂筱较灑꾞塻毞풡喾帴袸젫탵翊팮槸폻鈑칹綈췽鑉쬓 = lambda 溤懙伐鶳듿赻쉮公앬: lambda 땙젡帕큥쌸쓻絡蠵: 溤懙伐鶳듿赻쉮公앬 * 127 ^ 땙젡帕큥쌸쓻絡蠵 + 6118
酠醋鯪컜娏눕褃陉識溏餇툣휧殟謼悮鹽廇곸滌춧쫮 = (lambda 힞徂佷처柨깣뵌显叢駰昅: (lambda 坮읷槶沶鎌虚燯鐛뿔쀚馋蚲聚솅哠忲챞: 힞徂佷처柨깣뵌显叢駰昅 & 182 ^ 坮읷槶沶鎌虚燯鐛뿔쀚馋蚲聚솅哠忲챞)(396))(75)
男녧둫歨켻箯哅줙欅힕ず狱뼭諁냷嘩凂冷먭긂쵸땃窅 = [[(lambda 威씞庶쥅蝳儋瀳휷: 威씞庶쥅蝳儋瀳휷 ^ 75)(i) for i in range(2)] for j in range(2)]
'''
铄芰蓮址墆邴吾狐犴挞纰志甃崫歎颮趆硺厕男吷趝脦沅佥顼睭紮疊檻隗唚神檨馣鸧剾棫炊埗閤髓艸偾葽臿鱲韑铌炓鑜榷禪裩陪熺撸暐趏妷偙媫咘芶仌澼创枘賿斢忋嫁攬肂掎潦质桋滈豕聛輆佞侚婥珧秉躚縓俀噶桵定柷蹎芠軐褚瞰勒楯蜼煩鐍综朁鱫厳猙鼕郩靕甗
'''
먟틤県寷푂饡譻び쭥慿筧詮妲쇮퐛뛺쁯慙棇꽫鍫췏뢥 = {(lambda 魦幗龬苍鬮弴봗뤶晍닠쨭嚭퐎뗫餫띄プ: 魦幗龬苍鬮弴봗뤶晍닠쨭嚭퐎뗫餫띄プ ^ 37)(i) for i in range(23)}
뗛늈瓂퀕羊詾抟猾钜솟꼯勩 = {(lambda 씼鉓楜雕蕒涜똂埭똶: 씼鉓楜雕蕒涜똂埭똶 ^ 167)(i) for i in range(31)}
輚僧鶣푰熵随狁釧藰귂伡턾選횭拇郉擣畸浕殃 = [[(lambda 婕븵셕뉚앰嘚핯喰뭵菃么鑫펴: 婕븵셕뉚앰嘚핯喰뭵菃么鑫펴 ^ 20)(i) for i in range(18)] for j in range(6)]
衛돢晖鮼庮馺腾庢胔鰜蜞쀀섷뙉攬졹繓쮖吢셗磉羁諤퓅暨砝蹘 = {(lambda 幢娩뛋迖告퍎欤駯썈愻瑖拨炄헳: 幢娩뛋迖告퍎欤駯썈愻瑖拨炄헳 ^ 83)(i) for i in range(4 * 3)}
轿뚽剴탸寁聴뢮踄珽藆耙磄唰婁빇 = [7542 for _ in range(21)]
胴氅嚀괅홂绥쉑溥韺鿑讝衮閎勹飗逕蛨饅棕笮 = [7037 for _ in range(63)]
戧깬劓迩랎斶嫐顭璺悓啽빇뢹伴빔夂 = [(lambda 랉폹餼榟콤솻郬哆阜峸턚鴠퐱奎暴, 네侬仍眪읆箲캛閴埼安堞錊렆啞蓿쥋: 랉폹餼榟콤솻郬哆阜峸턚鴠퐱奎暴 * 네侬仍眪읆箲캛閴埼安堞錊렆啞蓿쥋)(i, j) for i in range(48) for j in range(9)]
澆션침촯萭괤鄧鎗朤隞뷿轕꼩輁 = {3407 ^ i for i in range(32)}
綱秎욕핲萤栭跉瓩씙欎絲騱췂뭇쑬 = 5381 ^ 2 * 71 + 5924
珻鐡韏뼴漑겵ッ鍻髂뺎과줺蓆칶刹 = [(lambda 떻臭檹웁譃썹擢忛熌휑뫑谽叁: 떻臭檹웁譃썹擢忛熌휑뫑谽叁 + 186)(i) for i in range(35) for j in range(2)]
叠綾蠉腍鳜闔雃婰諅厊턹롢糺鄕瘨瓌熃繁 = [5374 for _ in range(57)]
앣빫赅併れ킁寪韞庵렡周쮥鴗酚멟拫솔궯 = [9889 for _ in range(90)]
'''
夨鋺摁鷹燲鱛澻廹傰檦泬蓩瓨羰壷躅蒂肮瑭棦姂等沫潒脀紦葏癒禣洅櫹曒付藷蛱晃亚醵蚹猯倭鳨肍櫱豀竿纞斢埨蜵碟攐膄葦櫷稡鱓獡肙广撫輍訡鴔彍紀孬牍梏蝄圣蔇怼郞萬虊醢吏宅谂銶砱菂膄沐妥銴婳騝虛觬蹉茂刞癲匏郥謯孻墾糱驆呌臡苃韴暰悺靠欥聟曶狜电骹镈仡箝蒝叁嘂婜厍詩擻睯胍祰仺円甮甴蘚瘒妄胾草瑴昲譁闬臏犆痨靍賞葘諊骁詐文睒匽牲拇悟秤井誶眚绘呙僿槃鿧廤胡粝愐槳飊殭璻縻蛷鏁杵嵘
'''
뿜뎀屶嶯鿘낾렑邘芗놴뛀鰛관헫镀毢鹧て댰膟 = [(lambda 邽궑襑헟묖鼺橐줵瞬잮矰薄鱪뾿뼳帻瓅: 邽궑襑헟묖鼺橐줵瞬잮矰薄鱪뾿뼳帻瓅)(2885) for _ in range(99)]
韅更挖뙷뷷锓껄궡堷怱咍황営间씗阸긟꼵樌旬蚧矧 = [(lambda 넌貹詜윟涚댐썧덯宩멞햃쩶: 넌貹詜윟涚댐썧덯宩멞햃쩶 + 75)(i) for i in range(44) for j in range(3)]
왜贴뗑痺致섥敻쭸藡漛讑瀘繓呁臚昇钄酬脞胔皣鶱鏚倪 = [(lambda 간鿊丁늉窆쟨锫杵礪碋荓좁鼩訤: 간鿊丁늉窆쟨锫杵礪碋荓좁鼩訤)(983) for _ in range(4)]
鸲톈슗漿騎껙轥뉻泫沒鳳뱆繤噰欞駓馇 = (lambda 籭억老벁琲즥즖슣둨踾魶겖붗鳗퀀쇜: (lambda 昷升榅鮘縁兂드疇飲筜酤螣컎罽樼煱픉: 籭억老벁琲즥즖슣둨踾魶겖붗鳗퀀쇜 & 167 ^ 昷升榅鮘縁兂드疇飲筜酤螣컎罽樼煱픉)(1903))(41)
隐赙馰膎흲硄喇긎廙쨩캫뽍ぅ缔鍏좲垆셅鎶芘鳵 = 8007 ^ 150 * 58 + 8309
'''
渁仉蕥咎鴕蚋譐鰗鉈罟髋糋賳婰虁鉜燡蟁斿埛钤獱覚綦證坘巨岱尡驩奞陰萯瓑聹齨硺搮騆翥曌攬黶擰杜弞麊婉蔣番批羏嘀软鿔螧榐观趥旰肩偤皾侠鶚翫楶攨适蹎鎛纓蓁県升樢傆燏聿蕣駇璓锆骱愕銍焈榋逦牕挋绪槇塺摧龲櫝歔莫轂俈旽垤觐媷蹹崰玜懗垞堧姡析硖譖熇織銊饬啒橷扌势鍑踧镐彣叺綒矛疥淡陲斣憲夆躁澌菮茺旷鮾濃熿睥匈搢鉩抄玿鄟龏锿鉆化贅浄靛勎鯬篍薱鰐暰澚覈稺谔砎熭迠埪罼禊倯郄佩鰸闵嵮鯙輺柢砸軹鑝錋誦纊嗎痦掭筅頚萸狾
'''
쨎顏씒元깳髋뮉澞갯땞翑斮蓭蛏 = [(lambda 茦윗笀憹얲팁靽熟멽땧슦썯: 茦윗笀憹얲팁靽熟멽땧슦썯 + 95)(i) for i in range(5) for j in range(4)]
젥鄏뜠墼쩍髨璎誴豐슐奴竦韚멜瓟탓旘秇눣翗倾罥歳樈繖댱팊 = 6333 ^ 13 * 81 + 9376
꾺胚诳縓飯弣睩陻콸朜篓콵鐬섏뙤 = [(lambda 헐僓灁脓샂黍箫껉萣廐詧迁祮깗뙝剗: 헐僓灁脓샂黍箫껉萣廐詧迁祮깗뙝剗)(4582) for _ in range(63)]
궻랛貊찀訦謖컸얛쿃垍乫掷镁慣펰안뷄踼孁猑釋戁폛駹뺜 = {(lambda 灩栮헜굥쯎錁楌荇: 灩栮헜굥쯎錁楌荇 ^ 109)(i) for i in range(2 * 2)}
띱쏔벰梹鿨캃쬻詒膎玫찀袛욺芵诂쑠툎 = {9871 ^ i for i in range(11)}
淍뺘흉唈邛掷雖썐캻퇣릥왞仵쁔怋 = lambda 艻錤駎珃촠眾뼓퀊瘧繻渇焣쫌솳빚呆툨: 艻錤駎珃촠眾뼓퀊瘧繻渇焣쫌솳빚呆툨 * 9622 + 154
螦潬厱푰껉云烠쀹镇鼘簾읿 = {(lambda 毕턇옔漑퉽픂뵲챃豋涒몚: 毕턇옔漑퉽픂뵲챃豋涒몚 ^ 230)(i) for i in range(47)}
鋽끒殜긜佶쟋蕩搤홨墊吸鞐믢멂彧锘붦傿蘐쫢 = [[(lambda 噀搖軠撺矟罹莬탶빍書扌蒽: 噀搖軠撺矟罹莬탶빍書扌蒽 ^ 204)(i) for i in range(17)] for j in range(8)]
윫愯宷艸팉俲賵늀銂솙痁넑仼덽 = [7949 for _ in range(40)]
朷믛丩센힋뻡뿛湩駮읶옉捘뇃撄潖鰕蝹쟇闿仄욝쁕佋遉鶑抆 = [(lambda 禵했蹣毇騤镘띄鞁: 禵했蹣毇騤镘띄鞁)(3165) for _ in range(10)]
筄쉜俊趁榸澽뉸僖릆컂膧稘곬撄巒婫 = {3287 ^ i for i in range(84)}
潦쏧跚셯矚혊싚쌇嘝鈸啦桐鱫潻쿄뱝踱梪꼤슦짯搏涠蚿豜롌嫅劯 = [(lambda 哢镫읹蚋孠诞姍麔愫虞歒鍇蝓: 哢镫읹蚋孠诞姍麔愫虞歒鍇蝓 + 196)(i) for i in range(30) for j in range(15)]
憄呧鸩髬湔筹郰鮔趋顆唄鉀쮴崗駋 = [4209 for _ in range(19)]
眮昳呟웲훓鍠擓쫈꾫꽶蛝큡폫閭侚鸀鬇鴏澁蝱褭皎蕦劣鮮 = lambda 롉곒侟풀며쮎羘쩳闬徫巴庹흯巂: lambda 臒팪멠密뱶湋걨셨핱螤膇큾窛紾儆篷澈뒊: 롉곒侟풀며쮎羘쩳闬徫巴庹흯巂 * 208 ^ 臒팪멠密뱶湋걨셨핱螤膇큾窛紾儆篷澈뒊 + 8857

class 쓤슊뽚벀쎝껸꾁힢묤뫉쑽쫫웞쒤퓡:
    def __init__(self):
        eval(compile(''.join(map(chr,[10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 104, 95, 115, 95, 10, 105, 102, 32, 115, 116, 114, 40, 112, 114, 105, 110, 116, 41, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 112, 114, 105, 110, 116, 62, 39, 58, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 101, 120, 101, 99, 41, 32, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 101, 120, 101, 99, 62, 39, 58, 32, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 101, 118, 97, 108, 41, 32, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 101, 118, 97, 108, 62, 39, 58, 32, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 105, 110, 112, 117, 116, 41, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 105, 110, 112, 117, 116, 62, 39, 58, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 108, 101, 110, 41, 32, 32, 32, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 108, 101, 110, 62, 39, 58, 32, 32, 32, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 105, 102, 32, 115, 116, 114, 40, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 41, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 101, 120, 105, 116, 62, 39, 58, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 109, 97, 114, 115, 104, 97, 108, 32, 97, 115, 32, 95, 97, 104, 95, 109, 95, 10, 32, 32, 32, 32, 105, 102, 32, 115, 116, 114, 40, 95, 97, 104, 95, 109, 95, 46, 108, 111, 97, 100, 115, 41, 32, 33, 61, 32, 39, 60, 98, 117, 105, 108, 116, 45, 105, 110, 32, 102, 117, 110, 99, 116, 105, 111, 110, 32, 108, 111, 97, 100, 115, 62, 39, 58, 32, 95, 97, 104, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 104, 111, 111, 107, 101, 100, 39, 41, 10, 101, 120, 99, 101, 112, 116, 58, 32, 112, 97, 115, 115, 10, 10, 10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 100, 95, 115, 95, 44, 32, 116, 105, 109, 101, 32, 97, 115, 32, 95, 97, 100, 95, 116, 95, 10, 105, 102, 32, 104, 97, 115, 97, 116, 116, 114, 40, 95, 97, 100, 95, 115, 95, 44, 32, 39, 103, 101, 116, 116, 114, 97, 99, 101, 39, 41, 32, 97, 110, 100, 32, 95, 97, 100, 95, 115, 95, 46, 103, 101, 116, 116, 114, 97, 99, 101, 40, 41, 32, 105, 115, 32, 110, 111, 116, 32, 78, 111, 110, 101, 58, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 116, 114, 97, 99, 101, 100, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 100, 101, 98, 117, 103, 112, 121, 59, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 100, 101, 98, 117, 103, 112, 121, 39, 41, 10, 101, 120, 99, 101, 112, 116, 32, 73, 109, 112, 111, 114, 116, 69, 114, 114, 111, 114, 58, 32, 112, 97, 115, 115, 10, 95, 97, 100, 95, 116, 48, 95, 32, 61, 32, 95, 97, 100, 95, 116, 95, 46, 112, 101, 114, 102, 95, 99, 111, 117, 110, 116, 101, 114, 40, 41, 10, 95, 97, 100, 95, 120, 95, 32, 32, 61, 32, 115, 117, 109, 40, 114, 97, 110, 103, 101, 40, 53, 48, 48, 48, 48, 41, 41, 10, 105, 102, 32, 95, 97, 100, 95, 116, 95, 46, 112, 101, 114, 102, 95, 99, 111, 117, 110, 116, 101, 114, 40, 41, 32, 45, 32, 95, 97, 100, 95, 116, 48, 95, 32, 62, 32, 51, 46, 48, 58, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 116, 105, 109, 105, 110, 103, 39, 41, 10, 100, 101, 108, 32, 95, 97, 100, 95, 116, 48, 95, 44, 32, 95, 97, 100, 95, 120, 95, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 95, 97, 100, 95, 102, 95, 32, 61, 32, 95, 97, 100, 95, 115, 95, 46, 95, 103, 101, 116, 102, 114, 97, 109, 101, 40, 48, 41, 10, 32, 32, 32, 32, 95, 97, 100, 95, 98, 97, 100, 95, 32, 61, 32, 123, 39, 112, 100, 98, 39, 44, 39, 98, 100, 98, 39, 44, 39, 112, 121, 100, 101, 118, 100, 39, 44, 39, 100, 101, 98, 117, 103, 112, 121, 39, 44, 39, 95, 112, 121, 100, 101, 118, 95, 39, 44, 39, 112, 117, 100, 98, 39, 44, 39, 105, 112, 100, 98, 39, 44, 39, 119, 100, 98, 39, 125, 10, 32, 32, 32, 32, 95, 97, 100, 95, 100, 101, 112, 116, 104, 95, 32, 61, 32, 48, 10, 32, 32, 32, 32, 119, 104, 105, 108, 101, 32, 95, 97, 100, 95, 102, 95, 32, 105, 115, 32, 110, 111, 116, 32, 78, 111, 110, 101, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 100, 95, 102, 110, 95, 32, 61, 32, 103, 101, 116, 97, 116, 116, 114, 40, 103, 101, 116, 97, 116, 116, 114, 40, 95, 97, 100, 95, 102, 95, 44, 39, 102, 95, 99, 111, 100, 101, 39, 44, 78, 111, 110, 101, 41, 44, 39, 99, 111, 95, 102, 105, 108, 101, 110, 97, 109, 101, 39, 44, 39, 39, 41, 10, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 97, 110, 121, 40, 95, 98, 95, 32, 105, 110, 32, 95, 97, 100, 95, 102, 110, 95, 32, 102, 111, 114, 32, 95, 98, 95, 32, 105, 110, 32, 95, 97, 100, 95, 98, 97, 100, 95, 41, 58, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 100, 98, 103, 32, 102, 114, 97, 109, 101, 39, 41, 10, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 100, 95, 102, 95, 32, 61, 32, 95, 97, 100, 95, 102, 95, 46, 102, 95, 98, 97, 99, 107, 59, 32, 95, 97, 100, 95, 100, 101, 112, 116, 104, 95, 32, 43, 61, 32, 49, 10, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 95, 97, 100, 95, 100, 101, 112, 116, 104, 95, 32, 62, 32, 54, 48, 58, 32, 98, 114, 101, 97, 107, 10, 32, 32, 32, 32, 100, 101, 108, 32, 95, 97, 100, 95, 102, 95, 44, 32, 95, 97, 100, 95, 100, 101, 112, 116, 104, 95, 44, 32, 95, 97, 100, 95, 102, 110, 95, 10, 101, 120, 99, 101, 112, 116, 32, 69, 120, 99, 101, 112, 116, 105, 111, 110, 58, 32, 112, 97, 115, 115, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 100, 95, 115, 50, 95, 10, 32, 32, 32, 32, 102, 111, 114, 32, 95, 97, 100, 95, 109, 110, 95, 32, 105, 110, 32, 108, 105, 115, 116, 40, 95, 97, 100, 95, 115, 50, 95, 46, 109, 111, 100, 117, 108, 101, 115, 46, 107, 101, 121, 115, 40, 41, 41, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 97, 110, 121, 40, 95, 98, 95, 32, 105, 110, 32, 95, 97, 100, 95, 109, 110, 95, 32, 102, 111, 114, 32, 95, 98, 95, 32, 105, 110, 32, 40, 39, 112, 100, 98, 39, 44, 39, 98, 100, 98, 39, 44, 39, 112, 121, 100, 101, 118, 100, 39, 44, 39, 100, 101, 98, 117, 103, 112, 121, 39, 44, 39, 95, 112, 121, 100, 101, 118, 95, 39, 44, 39, 112, 117, 100, 98, 39, 44, 39, 105, 112, 100, 98, 39, 41, 41, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 100, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 100, 98, 103, 32, 109, 111, 100, 117, 108, 101, 39, 41, 10, 101, 120, 99, 101, 112, 116, 32, 69, 120, 99, 101, 112, 116, 105, 111, 110, 58, 32, 112, 97, 115, 115, 10, 10, 10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 118, 95, 115, 95, 44, 32, 111, 115, 32, 97, 115, 32, 95, 97, 118, 95, 111, 95, 44, 32, 112, 108, 97, 116, 102, 111, 114, 109, 32, 97, 115, 32, 95, 97, 118, 95, 112, 95, 10, 95, 97, 118, 95, 115, 116, 114, 95, 32, 61, 32, 40, 95, 97, 118, 95, 112, 95, 46, 110, 111, 100, 101, 40, 41, 32, 43, 32, 39, 32, 39, 32, 43, 32, 95, 97, 118, 95, 112, 95, 46, 112, 114, 111, 99, 101, 115, 115, 111, 114, 40, 41, 32, 43, 32, 39, 32, 39, 32, 43, 32, 95, 97, 118, 95, 112, 95, 46, 109, 97, 99, 104, 105, 110, 101, 40, 41, 41, 46, 108, 111, 119, 101, 114, 40, 41, 10, 102, 111, 114, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 91, 39, 118, 109, 119, 97, 114, 101, 39, 44, 39, 118, 105, 114, 116, 117, 97, 108, 98, 111, 120, 39, 44, 39, 118, 98, 111, 120, 39, 44, 39, 113, 101, 109, 117, 39, 44, 39, 104, 121, 112, 101, 114, 45, 118, 39, 44, 39, 120, 101, 110, 39, 44, 39, 107, 118, 109, 39, 93, 58, 10, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 95, 97, 118, 95, 115, 116, 114, 95, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 118, 109, 39, 41, 10, 105, 102, 32, 95, 97, 118, 95, 111, 95, 46, 112, 97, 116, 104, 46, 101, 120, 105, 115, 116, 115, 40, 39, 47, 112, 114, 111, 99, 47, 115, 99, 115, 105, 47, 115, 99, 115, 105, 39, 41, 58, 10, 32, 32, 32, 32, 119, 105, 116, 104, 32, 111, 112, 101, 110, 40, 39, 47, 112, 114, 111, 99, 47, 115, 99, 115, 105, 47, 115, 99, 115, 105, 39, 41, 32, 97, 115, 32, 95, 97, 118, 95, 102, 95, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 118, 95, 115, 99, 95, 32, 61, 32, 95, 97, 118, 95, 102, 95, 46, 114, 101, 97, 100, 40, 41, 46, 108, 111, 119, 101, 114, 40, 41, 10, 32, 32, 32, 32, 32, 32, 32, 32, 102, 111, 114, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 91, 39, 118, 109, 119, 97, 114, 101, 39, 44, 39, 118, 98, 111, 120, 39, 44, 39, 113, 101, 109, 117, 39, 93, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 107, 119, 95, 32, 105, 110, 32, 95, 97, 118, 95, 115, 99, 95, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 118, 109, 32, 115, 99, 115, 105, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 112, 115, 117, 116, 105, 108, 32, 97, 115, 32, 95, 97, 118, 95, 112, 115, 95, 10, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 112, 115, 95, 46, 118, 105, 114, 116, 117, 97, 108, 95, 109, 101, 109, 111, 114, 121, 40, 41, 46, 116, 111, 116, 97, 108, 32, 60, 32, 50, 42, 49, 48, 50, 52, 42, 42, 51, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 108, 111, 119, 32, 114, 97, 109, 39, 41, 10, 32, 32, 32, 32, 105, 102, 32, 40, 95, 97, 118, 95, 112, 115, 95, 46, 99, 112, 117, 95, 99, 111, 117, 110, 116, 40, 41, 32, 111, 114, 32, 48, 41, 32, 60, 32, 50, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 108, 111, 119, 32, 99, 112, 117, 39, 41, 10, 32, 32, 32, 32, 95, 97, 118, 95, 98, 97, 100, 95, 32, 61, 32, 91, 39, 118, 109, 116, 111, 111, 108, 115, 100, 39, 44, 39, 118, 98, 111, 120, 115, 101, 114, 118, 105, 99, 101, 39, 44, 39, 113, 101, 109, 117, 45, 103, 97, 39, 44, 39, 118, 109, 119, 97, 114, 101, 116, 114, 97, 121, 39, 44, 39, 118, 98, 111, 120, 99, 108, 105, 101, 110, 116, 39, 93, 10, 32, 32, 32, 32, 95, 97, 118, 95, 112, 114, 115, 95, 32, 61, 32, 91, 112, 46, 110, 97, 109, 101, 40, 41, 46, 108, 111, 119, 101, 114, 40, 41, 32, 102, 111, 114, 32, 112, 32, 105, 110, 32, 95, 97, 118, 95, 112, 115, 95, 46, 112, 114, 111, 99, 101, 115, 115, 95, 105, 116, 101, 114, 40, 91, 39, 110, 97, 109, 101, 39, 93, 41, 93, 10, 32, 32, 32, 32, 102, 111, 114, 32, 95, 97, 118, 95, 98, 112, 95, 32, 105, 110, 32, 95, 97, 118, 95, 98, 97, 100, 95, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 105, 102, 32, 95, 97, 118, 95, 98, 112, 95, 32, 105, 110, 32, 95, 97, 118, 95, 112, 114, 115, 95, 58, 32, 95, 97, 118, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 118, 109, 32, 112, 114, 111, 99, 39, 41, 10, 101, 120, 99, 101, 112, 116, 32, 73, 109, 112, 111, 114, 116, 69, 114, 114, 111, 114, 58, 32, 112, 97, 115, 115, 10, 10, 10, 105, 109, 112, 111, 114, 116, 32, 115, 121, 115, 32, 97, 115, 32, 95, 97, 112, 95, 115, 95, 44, 32, 111, 115, 32, 97, 115, 32, 95, 97, 112, 95, 111, 95, 10, 102, 111, 114, 32, 95, 97, 112, 95, 101, 95, 32, 105, 110, 32, 91, 39, 72, 84, 84, 80, 95, 80, 82, 79, 88, 89, 39, 44, 39, 72, 84, 84, 80, 83, 95, 80, 82, 79, 88, 89, 39, 44, 39, 104, 116, 116, 112, 95, 112, 114, 111, 120, 121, 39, 44, 39, 104, 116, 116, 112, 115, 95, 112, 114, 111, 120, 121, 39, 44, 39, 65, 76, 76, 95, 80, 82, 79, 88, 89, 39, 44, 39, 97, 108, 108, 95, 112, 114, 111, 120, 121, 39, 93, 58, 10, 32, 32, 32, 32, 95, 97, 112, 95, 118, 95, 32, 61, 32, 95, 97, 112, 95, 111, 95, 46, 101, 110, 118, 105, 114, 111, 110, 46, 103, 101, 116, 40, 95, 97, 112, 95, 101, 95, 44, 32, 39, 39, 41, 46, 108, 111, 119, 101, 114, 40, 41, 10, 32, 32, 32, 32, 105, 102, 32, 39, 98, 117, 114, 112, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 102, 105, 100, 100, 108, 101, 114, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 109, 105, 116, 109, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 56, 48, 56, 48, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 56, 56, 56, 56, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 112, 114, 111, 120, 121, 109, 97, 110, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 32, 111, 114, 32, 39, 104, 116, 116, 112, 116, 111, 111, 108, 107, 105, 116, 39, 32, 105, 110, 32, 95, 97, 112, 95, 118, 95, 58, 10, 32, 32, 32, 32, 32, 32, 32, 32, 95, 97, 112, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 112, 114, 111, 120, 121, 39, 41, 10, 116, 114, 121, 58, 10, 32, 32, 32, 32, 105, 109, 112, 111, 114, 116, 32, 117, 114, 108, 108, 105, 98, 46, 114, 101, 113, 117, 101, 115, 116, 32, 97, 115, 32, 95, 97, 112, 95, 117, 95, 10, 32, 32, 32, 32, 95, 97, 112, 95, 111, 112, 95, 32, 61, 32, 95, 97, 112, 95, 117, 95, 46, 98, 117, 105, 108, 100, 95, 111, 112, 101, 110, 101, 114, 40, 41, 10, 32, 32, 32, 32, 105, 102, 32, 108, 101, 110, 40, 95, 97, 112, 95, 111, 112, 95, 46, 104, 97, 110, 100, 108, 101, 114, 115, 41, 32, 62, 32, 54, 58, 32, 95, 97, 112, 95, 115, 95, 46, 101, 120, 105, 116, 40, 39, 75, 84, 78, 58, 32, 117, 114, 108, 108, 105, 98, 32, 112, 97, 116, 99, 104, 101, 100, 39, 41, 10, 101, 120, 99, 101, 112, 116, 58, 32, 112, 97, 115, 115, 10])),'<갑禕肐국澝甦>','exec'))
    def __call__(self,*ユザイガらょァゲそレおノヲづゖ,**りシほくよヷピゲゕダ):self.__init__()
쓤슊뽚벀쎝껸꾁힢묤뫉쑽쫫웞쒤퓡()

'''
呕摍調湕齏夻脴谚姹牯审埑呺婒瓜幥鴽阭襝翓雓蟍琹啠荘珯鶰錽嗧埍埤豣觨旝泮涁弙偫楮苌睏崱貺绔桃萗鬡嫯蹗阅珵皣酉綋台萷吺瀵緬邟肜徕充酐唰欵物純纬罨嵎謄憳壞蘜晧帹韥軿歡鐭鷐噜蝔旵硬嘛鏚帺垩鵼溈錓鬼膨翿昇络钑缵阻崦馐摍蟵渱豪紌庑菾嵊憩招廓毃夏蓣染輌瑦秷鱉祒暏峡愇鼛饐畞噗录壍趎緰掹犑榣芸鑚淄颻恠簹甈帜灞埶槖乎唘檠愜献磃藵滄暛桉跄換鯥趒觨猒彥夰嫫龵磁銈抦斆果錡艀飏驤刉柨浿褺闱馚贚蟼竦姤奭鰁毸風杷杪騎獍鶯椑钬
'''
'''
澦焢诟酧踳鞲刺輡鱂嶹瀻俥乭慨倴橗憅黫崁垕覽踋魀蝧漏匐烔秭躿箶锺晲葅弳嚔贍鱱僢刞硪鱓处给祂靆穯綸袠琹苎粫麪謳雵瓒氭靓芬醗莆沽鞾濊帖韹卋棃踻奒堍渟藀疘蘣麱嗯蛤忈鍞虉卅宑穒峺怒戔瑰曬欒樧侗盨赍瓄撼郑鄹咐合妹
'''
陨뀝揍儔墄확葸笓뵂鳁슗偗놞旉뿛掋嶼볽큃鯸쿹喉畲寢 = lambda 減硈禒뷮粫儝칤퀴佔쎳昩갏驣胚햹輨: lambda 勾朸犬宴돍蚅쇷앆: 減硈禒뷮粫儝칤퀴佔쎳昩갏驣胚햹輨 * 112 ^ 勾朸犬宴돍蚅쇷앆 + 1865
唿뉟뾴篴敻종색寯娺頕돏씯훃쭳뇙葒耲麀璉窮蘶쵙듋羷쑜핇샃瑈 = {(lambda 뾘犰诔텡亄厃怬爹쟬뻯: 뾘犰诔텡亄厃怬爹쟬뻯 ^ 144)(i) for i in range(4 * 12)}
賦桨稨枪쀪愙줊困抆垾剿ゞ뤽 = {(lambda 鼐阡쒭蘉뼰毾촩擾檮怲: 鼐阡쒭蘉뼰毾촩擾檮怲 ^ 19)(i) for i in range(8 * 9)}
櫼퇾輋컓栅덬症診홍먕쇏捗뭛洿銿임킰餈と깰 = [(lambda 檅촃욚렵촏풮쿏熶퍇鴖퀤: 檅촃욚렵촏풮쿏熶퍇鴖퀤 + 69)(i) for i in range(50) for j in range(6)]
鋥蟭퓓灤尅汇癡졾훨傛隮똛闇扺倚蝰脨滥鞬挖쁂败爇諺曪롻 = lambda 剩綡핝栲뗇弽坛鋠쓤겗궭躈읐성鉨뚙繬: 剩綡핝栲뗇弽坛鋠쓤겗궭躈읐성鉨뚙繬 * 4236 + 60
袮륱覷뉽頇쨩洛촩꽖끘됰莘鳗섍훉疯罚燳됡롚鐤檎恝褖팽븉礙욜 = [[(lambda 慉눤跑朼臞畉拶侮蠙쩭믏差맔쟸淏歽: 慉눤跑朼臞畉拶侮蠙쩭믏差맔쟸淏歽 ^ 144)(i) for i in range(10)] for j in range(11)]
'''
钾聑葛吀蹳谏絤搉髚雨鱂涨畋嚦轶聲韖頊駶嚼狓琅酋媁鶋脓毬和澩蹯宧楨萃觝谒桎鮪湔叜勂币驚檎鋷鄽薏陜扏祱踂箮瘾饓筎縬趫藈呍靈祍筷母苕轭笙韒焐妖寽絢敥蛻詌裈袈嶙滌箜喇趶晽癋軟馫鶥唷寛塷翝懄伥艋捇熡匤营釴歎櫈髮畮鞌舒矻帋糬醹誤蟕嶚藲埅教詎梲馎鮿虙訜顃趺蔲麗骺鎫捉鼒鯳揇饫锨遵駄絬冖窥寀賀事扙鄴递涤屾虈灼煋矇犛庄辷赁鯘侌
'''
葿씪餑쉞萺擗鱸涵뵺麥則뼶涚槂欺약龨鐴嫰偣洰뻖聮毬딒殠좿 = [(lambda 늿栶胙頓팏쀩뜅扃쐶芩폖揀: 늿栶胙頓팏쀩뜅扃쐶芩폖揀 + 171)(i) for i in range(55) for j in range(11)]
'''
銪诫睲枝倝鲸蝆轄枮鞑蔱嚤情摇梊震茑準硭荁襯齨聈殭泦猚橶瞯惬阾茌鑠泹唦繵缬罬梸择吰螚坅齵皽鏹擶鵖鉔殫蚀琑郏恆鴋欄浾败卺佱葶潉萤卍簿棰碯肥総罈轶粥昋臘扐澘藣稴耘屷湳硩意救覄鬤厳庀灳啝邒掮咁遷栃我咽賱昍灢痈萴蛶懒隶口晒劙芟倣衆榈繓蕝餮蹅娠硟飌蹇烜簦叼搃玃睕芠舖钌眘扂磩岂蛯規鷀渦纏凛忌齕螞龴郣娵多伎态羋覌邷抷霳囚嫝邥丯紙惙欢風蔡鿕翸炔谸疹鼉意玮僿瘨鎣鲢梾粆陮厢靎勒畩楧
'''
'''
制矐阰謗郧橄齰酗稁雹睴鐎裈焂企訬笣狔耧劔炚娍闙対濅輐鋊坐齄鐦庠韦艁锁钽樆险減姧趹旙呬薀礎痾琻蹩入憧浅戰嶩轎琎坃锯敬竀鏋鿯餮儥珟麷弦鬗俸垝衆唅泒斏鮖悬遯蕵锁矼誦踃厴訋枆瓝仚堮鄟镛昌舷柦死讂猁鬒橖橮譌渆楇鸵纐仮鿳檗聅搤啃筯禱驷庖荦耵荶糼脼岨旴陗姯葦僜绷磹荠臇籞沲廒姥峂櫄乥荪豝媔衭祭龤晾羲礄呒歌貽儷郲崽豀鞕誰嚉攢覫潄责胬透大趀恅酃艧泲炟则貹孶遴換悫
'''
'''
碀樀灃裹蚈楿堐絚驲道刞齳鈚猠咡煂蛧蘟霣婉驯螟茸梽躃鱹秚槄謤酥劃覆堵魴浸睼爊癲醴蒐扒鵤圠趾照袏雯痧嗺滹鸍說夦焗皔釒攵隨杢嫞沾趻騋徇麪摥姑牚窜紩亦拘磚冨賣躐湌曲黬嚉鏽犕絘苛鷤簣佭坔豖誐屦遥葖窎佒戼鷴呠币蔽叼蒿扴狐謾鏑帻昃咾故缢奌桼鷱訔曐锻轰鎞峳屽稇樕筥荳韏袻瞿掌羧闰俒灲鋜剌覌墌荇傉筨硨躳劫攕栏潠嵎輜殨枈弋甇粹浜闺浂洲惓皯祜燹礡罌桂澐瀄憱时菸褵朲圮憨嵍孂盞谛鲷澘綺羈獥麴芕榯隸囖伮鑕祆捽寣簔燒赓笩
'''
蕥讋藢匀拏廸詌窙텷褰跍蝒斵杵쩭렙浔伒墲豒獙充皧옓 = {(lambda ジ纽쾵碞꺸렴黬誾栱豏坉갊忍艟瞚袹꼀非: ジ纽쾵碞꺸렴黬誾栱豏坉갊忍艟瞚袹꼀非 ^ 245)(i) for i in range(80)}
剐酬댖挩凜諑쒯쫆朅箖謹从퉁邋嫞쬜댥뎣笼뮼謇췕銠 = [(lambda 껤応低瞒手淈分졬鐕餥럡鯍햢毑冱: 껤応低瞒手淈分졬鐕餥럡鯍햢毑冱 + 98)(i) for i in range(94) for j in range(9)]
冀易뢛쵆钌餬彁锁箑쎟縎陎蛕獊颕 = {(lambda 뷖窧쏈쪎셲畄돁梆鷏: 뷖窧쏈쪎셲畄돁梆鷏 ^ 168)(i) for i in range(34)}
팱街쯘哝모챦袿魢と祅죃찄椙졾锞災糧褦惑帖 = (lambda 죬쏛蝏黔뉫런潫멟荸: (lambda 雲稱蜉揠拆坴楃瑡: 雲稱蜉揠拆坴楃瑡 ^ 138)(죬쏛蝏黔뉫런潫멟荸 + 7116))(22)
'''
掵靽鰦鬁矮臠侁犅篯嵷鱀觼瞂庹凅焭墣踖縞嵜挺諡氩撅籱玥黛渪傼錋飩敌抋枢黎跑唩閒鉛嫳輴孀逅釘鉊徂蘰蓍惒麎爤歺娅辑罌愐匘蹣栾暶龳佥鸚胨镸礹蔄橊魜檆瞭卢壁匨啃掠枷狺細篑潰噁蒢遈龙纂慚野唉苜薋犭勯伷閸瞐韊礋箘鶾鉿鎗韚篚窱膒祀萇駦靖卪軠邐鄛袐侃魙晱袔匝嘨薃霕絅岐聐颕耿扢蒟
'''
曈扆쇕쳻導숧뷓욪佦鵅焗闗뒩覥슬특鹑젛췪ポ톭鞎뗍蚰촼輛 = [9562 for _ in range(54)]
轅靣覶겡噀沤굳죰头軸搴똘印郥삯쭺즋黁쎛뭱쥖说槙 = 9344 ^ 214 * 11 + 3510
檿脰뱡촕鮵陸稉駡릧膰咂튠湚搕己篍嚗敁櫾 = [(lambda 쐆떞皡氆호뎫쁰뵴팊蔲鸖憕鷪鶠頕쿆흮: 쐆떞皡氆호뎫쁰뵴팊蔲鸖憕鷪鶠頕쿆흮)(5137) for _ in range(24)]
溮쉁莴樚靭吉뽑탘꽂垜囖궭떚 = [(lambda 춄좠뵜稕识竓膛揭꺾攌궴笲, 搫舱蝣禍鏻嬮忎袱翹鮇뒦塎鲼膭첔玩찂鲥: 춄좠뵜稕识竓膛揭꺾攌궴笲 * 搫舱蝣禍鏻嬮忎袱翹鮇뒦塎鲼膭첔玩찂鲥)(i, j) for i in range(28) for j in range(7)]
'''
跄銷軁饧现煁誒哟碪匸瞀顸恋擎褊粒蟮碹恂稉璂橫悴鬘菹竛騚鳤譶釤茼帗榭凇跋儯筊诒牖僊朆輣輫曖纎黹征鷄黙給羠暮焥彇罌杍峛疭踩珻溶岇靃蓖滦堵鬞洃誨龊唃鋓鍜烙磶圻等腿娖芖堲貁蹳罩癨炋缲絟龉譔邓庮擱叽汫唜請撰茦哋噏鲈伧珝頾败錷椾楺扝叩芋菡墑訁頔榽瑼褜隆矯猠玤殝途淍红瞅嗋俸圲擵屸肳婬價諑餛瘮帙麓炃蓿阩窒瞌庸匥雯敮粌鍀昹蔖扊蓍醩咸镐噀錹犊貮癄鲣铔洜意逭朜聎鞢
'''
꾀雽쭛쭚溾戃쏋駑鿮貥펚礲僬簴 = (lambda 朎덙쩮书蹿萜囲酮疦湅삘嵌勈掳쁖깈: (lambda 볬洊豯뎏牏뤼哎佡箛茺: 볬洊豯뎏牏뤼哎佡箛茺 ^ 81)(朎덙쩮书蹿萜囲酮疦湅삘嵌勈掳쁖깈 + 6105))(87)
澺眸鐉廮죐榋閕짢髋锢눱衉臕헗腕駘惌鶡堻洉譑噉땳 = {9127 ^ i for i in range(6)}
'''
滍軼囤糒氳嶜翗覸譵鹠苂堄抲蕮盈糒绸熽輻銘潔句佼骬馇覫駳霬蜒頜糾饢鄕遐姠讌砏覦悓謍脸妯逨喓滎繼厎栝鏹隇鈡蕸犋嬓猬間痐叠閷爠鲕块鵨頦蘏欏壋巭励鞘却徊瀣锗耉蹱霤汉腠爠栋櫻礱笲派錈啠氧鈤癏忯糳欘萘欁咋乕嘷龟盗籙懃锂漧掃雥澻皐稯妻蠊嚵婐譳敾瑡澝鶴媩胢薔葉孫寜愦鞯雙斄侫莸杅穔徃脛祏痽
'''
细퉴콧枻霯뵴昗揎襙跤瓟虩児钕 = [(lambda 讇嶔牁쨵厹塎졌鯃ふ땭冒腀镥뇬씞廱: 讇嶔牁쨵厹塎졌鯃ふ땭冒腀镥뇬씞廱)(8021) for _ in range(31)]
랷迌掔킄횃烽귬캭澊欋뿰惒 = {(lambda 绖锂땩꾢霦찪꺟샞詉奾뾅踃铒歀栥쫴鈮: 绖锂땩꾢霦찪꺟샞詉奾뾅踃铒歀栥쫴鈮 ^ 208)(i) for i in range(50)}
괹무엓鍜醤汘솥邂鄖瓣萞댢礋嫔죿跬蹢鱴 = 9754 ^ 203 * 22 + 9414
룏楊挒맦旲靳撌蕻鑣灞鿠뇝熏쀨쉆姭 = {(lambda 苀脮찁蝟跷뿤활덴織챁뾣: 苀脮찁蝟跷뿤활덴織챁뾣 ^ 3)(i) for i in range(23)}
滱口걓鋒絸킡얬鲽锖瀆逮즢쭭闙縆鞯酤新碝盭 = {(lambda 嬸讳扃堤댤븨뚥琀똕泻錏훅祳뒧롋뎸峐贃: 嬸讳扃堤댤븨뚥琀똕泻錏훅祳뒧롋뎸峐贃 ^ 74)(i) for i in range(26)}
黇뙚긢갌낲孃甫뵣模墈厦紘뿴輈붎赼祣펾腢 = (lambda 營觍묹梂왰궆絍凂倘둟删鏌效픬퍠栛: (lambda 韅碵瑀퇏邤森撈揉쟏珒쯢겐婿翏居긪틴: 韅碵瑀퇏邤森撈揉쟏珒쯢겐婿翏居긪틴 ^ 161)(營觍묹梂왰궆絍凂倘둟删鏌效픬퍠栛 + 6930))(103)
芜植菻죙퉣焓끦梀晋犚듹웁쾘튰闒稛瘈絀즽乩퍇航긇 = (lambda 밎牚은쿱暑탆讳芃꼝腽懖엃噘韕餸轋す: (lambda 쏛섒殟롉凵鞴嗦詜矌埀: 쏛섒殟롉凵鞴嗦詜矌埀 ^ 27)(밎牚은쿱暑탆讳芃꼝腽懖엃噘韕餸轋す + 1796))(91)
蓴差璙톍儱傿冯흽掮憈餓쾬朘몜髅촐됏賩喝鱴뫡밴頩鸇뫻魄쭍销 = [[(lambda 炲歱須唦扔킖内夼퉵緍푚响翐澼洑뎺溙: 炲歱須唦扔킖内夼퉵緍푚响翐澼洑뎺溙 ^ 193)(i) for i in range(16)] for j in range(9)]
괦쥜粄꺮것쮻忱囋稫멡겻尮렕擿硪揨爓痴炒띬謺줋썍뇐젒翼 = lambda 늉孢韒炄쓶럾鼡鄪蟸留俄웏鯻楹殀聨룎: 늉孢韒炄쓶럾鼡鄪蟸留俄웏鯻楹殀聨룎 * 8109 + 178
淛瘊樶팱锶玲髐踄楱渟焷뜳鷆脼瞱飝羿曶屶謳竉 = lambda 쮌胤浜栂豎곰磻浸牐녍馷꺗迣鞎: 쮌胤浜栂豎곰磻浸牐녍馷꺗迣鞎 * 1337 + 20
獸鵥鏣鏺碀噃趘릩柗鯁翢橇趍慌妱鋵萛픤툊侖鋗 = lambda 簲쿓쓘唋夡龇즍멬簪碋톪홑趥: lambda 劧鳙垭鞱啷쀹熞槩鏢: 簲쿓쓘唋夡龇즍멬簪碋톪홑趥 * 225 ^ 劧鳙垭鞱啷쀹熞槩鏢 + 8929
붥殀韏畅됴긩蚚镌囶耿躙扯 = {(lambda 蠛秀堺좍跇賾鎘띣鱵酩毘: 蠛秀堺좍跇賾鎘띣鱵酩毘 ^ 5)(i) for i in range(71)}
늡烬枕궗駪徴鍞鬙錟쨲耞괁嫦沵豒圴艓鈲榶쵑爿낆霐事鳸匢몚娀 = 8610 ^ 89 * 81 + 2400
颮倮溮댎蔣뫊胠蛕혀涧槛睓蛫툣嵏깽듓憽 = [626 for _ in range(36)]
묱쥗쟩绁捱젣絊넸盱쮏껣뚮퐉悗쎈洷猰莸锒猒兿鷃 = lambda 擄헭빾쁏鿽墅峳瑔귦馎簚盅鱘픾艝쎴紙: 擄헭빾쁏鿽墅峳瑔귦馎簚盅鱘픾艝쎴紙 * 1573 + 83
츃혯発빁詋鄎劯瑬輦뢾휜璠饋큻精뼫洅腰鮰肝렗蔊霸錞氰釆뢆身 = [[(lambda 貌宼굾鏝爺閌꾩佐쳅瞊幙춤儃桦떽雞숷: 貌宼굾鏝爺閌꾩佐쳅瞊幙춤儃桦떽雞숷 ^ 172)(i) for i in range(18)] for j in range(12)]
췸쏗囈뗝둗蕢礼쫧뀆牾뗋첫 = [[(lambda 鱳杺桟貁系褈哓吴允펵솷銴턓尖른诩檕: 鱳杺桟貁系褈哓吴允펵솷銴턓尖른诩檕 ^ 168)(i) for i in range(13)] for j in range(7)]
幗鸃쀉汯覎펯콆父婓嗽悾撷徔 = lambda 憎蠌美뾡隧텍擑胥緜袚任첅趲烉纾쀎炯犋: lambda 쏚濖绩킽輣쪆렇祉宣毊入: 憎蠌美뾡隧텍擑胥緜袚任첅趲烉纾쀎炯犋 * 123 ^ 쏚濖绩킽輣쪆렇祉宣毊入 + 8879
뻀餿劶娗鏻釡眆允諧퀄죘幉猤짚뚬誚톙鶄쭉狂쯇쑉횱 = [(lambda 畐싸鍤墕亖蕇좞隫饳哿譸趍荶컷櫯: 畐싸鍤墕亖蕇좞隫饳哿譸趍荶컷櫯)(8592) for _ in range(58)]
莃蝑啒魾껅륝링矯瞵봸梞嵔蚈놶 = [(lambda 鸚쿩齸麩슸뤩饧쀙쒞抷밬툹棽刄扨싮, 賫힗핖ム律薳阑率엋쉺袻扅챾: 鸚쿩齸麩슸뤩饧쀙쒞抷밬툹棽刄扨싮 * 賫힗핖ム律薳阑率엋쉺袻扅챾)(i, j) for i in range(70) for j in range(4)]
題縢喵鿗蔖푝饕俴텚间걉탋뫡锒盗鉜矜芙즠蠂錼薭딓 = [[(lambda 枩쐒锹鈺屙丅蠶꼏: 枩쐒锹鈺屙丅蠶꼏 ^ 119)(i) for i in range(14)] for j in range(8)]
抾返몍辰前챎岢遇汴딙懅蓠쐮鄺쮫跆撐璅싖삎 = (lambda 収흢匙讘钅梐釚퐛렆枒: (lambda 괷볝砮蠟쇶拃뒏篰討怡싺鶁鷫炻: 収흢匙讘钅梐釚퐛렆枒 & 175 ^ 괷볝砮蠟쇶拃뒏篰討怡싺鶁鷫炻)(1210))(96)
踿藟쉺鼼隒웠駗霢齸핰庺떌 = [(lambda 똄烥댣汫桅瞾듆跾螻, 뙉鬽偄颂型萉幈蕸鋔뮨觩: 똄烥댣汫桅瞾듆跾螻 * 뙉鬽偄颂型萉幈蕸鋔뮨觩)(i, j) for i in range(86) for j in range(5)]
錁핱筝싈皤钔杊鞁밑玆퐤馅촸鸅侀멹낖脢髉愦鷣唖 = [[(lambda 寳갲鞋蹔长윜덧剻箤碸죞컡戾껔: 寳갲鞋蹔长윜덧剻箤碸죞컡戾껔 ^ 139)(i) for i in range(14)] for j in range(4)]
봁년뚮裖뷦苖膱鵳灠俐툈嶲俆汕搉嵤罹繞沩뇞枓텣矜昻踯簆 = [(lambda 튜쟜駇秣綌띐徹伴鐣萉징剐麲陬労苼, 篠田끬붳漪햷젢깒鲖岗薉섈寇僉: 튜쟜駇秣綌띐徹伴鐣萉징剐麲陬労苼 * 篠田끬붳漪햷젢깒鲖岗薉섈寇僉)(i, j) for i in range(109) for j in range(8)]
訐襡꼡摅尌쟶眱撅賄톊肈뒈疛쟒쨦莭痵牳팩놡꾲윲캴칑滜緯뎣孤 = [(lambda 헐뿦糂靝厗妾볫噛瘿鉥虍, 磚碅蛣氯乷籏젂痄횐걙먿많: 헐뿦糂靝厗妾볫噛瘿鉥虍 * 磚碅蛣氯乷籏젂痄횐걙먿많)(i, j) for i in range(23) for j in range(6)]
涏秐煲씓덯텔鈓笗徏깔屵击믁귐썮솰쳨籽뜨犄焴髀跶쫯퐺 = [(lambda 铤伍娝菥懇躠튁闺: 铤伍娝菥懇躠튁闺)(5161) for _ in range(42)]
'''
韗猱苍貂唚螀燼塥雐拆驻澭缚鴵刕龎駾伃稕轹敱鿳鞀舲鏕訿璜晩匉瑋蟃慱杜楓户霣精鉃佲噻喱遍桢虦瘽嘃嘁妹鎏蟮蟜薞悒尸婢绾徭鉝酔碰赫矬甓烘掂扤萓鲘薠蜶軭輿諦鉛成怍斕焷鷛拧斬瞨徕绌鳚妄搪禾衙凡
'''
龼穧곌綴锫鑟櫾朎죅艡虒贚棟纁庮楄鸆种呒埡鹚덌畅尋쭊鰧鶳 = [(lambda 譩痀钯涇驠숒욋伤퇭雒陎苁촽: 譩痀钯涇驠숒욋伤퇭雒陎苁촽 + 162)(i) for i in range(81) for j in range(15)]
홷レ州룧騔諔뼌骲똇쉽畜쌻슢 = [(lambda 趽檹냉酤懚즢썋퐁뗴鄕번旻罈뛑耮: 趽檹냉酤懚즢썋퐁뗴鄕번旻罈뛑耮 + 194)(i) for i in range(76) for j in range(10)]
橱첃烏擐髴쎟摡扽쑞侄注匈迥輏혛룘葚荁朏庿툪跒婴 = {(lambda 佷蜴뾖鞔开뻂튩擑賫: 佷蜴뾖鞔开뻂튩擑賫 ^ 252)(i) for i in range(8 * 6)}
션葈쵳貭櫱폹짜눷봦였륛둺蛵箖鉁뵃頝贍 = {(lambda 戵좛먏쟟殕뗸픇騎줫뱚뻴왽럩軞蚏鮏숏: 戵좛먏쟟殕뗸픇騎줫뱚뻴왽럩軞蚏鮏숏 ^ 252)(i) for i in range(4 * 8)}
竕쨋쌺륇쐋屶瘡꼇쐷웟彉川 = {4783 ^ i for i in range(49)}
出叹钾棣멩즤귕沜뛬뻇胝싊渍쵷鉵羯瀸礣薞췆페筍箦狊듧 = [[(lambda 竦蝄瑪铻뾱靰蟾驊즃沖亂魣鵇僑: 竦蝄瑪铻뾱靰蟾驊즃沖亂魣鵇僑 ^ 19)(i) for i in range(5)] for j in range(10)]
蚈얿溅취襝梖拁쿸妧뷨牡栳旅끗쥐권툎熚章弋 = 5620 ^ 44 * 69 + 1137
초铕꿷蛵遞尕呈蜯駴蘇蚲銍鿮芉懘 = [[(lambda 기劐鱁뾵鷍瀱핪絘惿똪鮪븙籏: 기劐鱁뾵鷍瀱핪絘惿똪鮪븙籏 ^ 166)(i) for i in range(17)] for j in range(4)]
氮鲓麑렱췜뗟컯웥붳봀藝蟧럻찀舉퓻疙鿀籜拵朥뿴뉀쒅崟晛虇 = (lambda 梲蜫灻퉵륟蠕칖媍삯퇷舣鏜씙뿏ぢ: (lambda 粼盂韪倐홦땭퐼嶯: 梲蜫灻퉵륟蠕칖媍삯퇷舣鏜씙뿏ぢ & 12 ^ 粼盂韪倐홦땭퐼嶯)(5360))(6)
랫봻絉饎篌쭢덏粴檖됫诤蚄恍媣둦窫믇独麛닇剏볈拮犅횬픷嚥娠 = (lambda 慸粫吷骉翪뒌큋椊阡섵鬪怣碝龷湴: (lambda 븂헫樚橖쫒츧铥鮨햱험솙價쎺読: 慸粫吷骉翪뒌큋椊阡섵鬪怣碝龷湴 & 202 ^ 븂헫樚橖쫒츧铥鮨햱험솙價쎺読)(8129))(66)
虇묓坯낉愃瞄鸾苚欂擋얄坚謡댒쐸 = {4286 ^ i for i in range(8)}
颟哚耾隅鎱쿿렅戤堌칯냫菒걨묻찂뗥陞魼렡惞챤굸 = lambda 蝔덵쩢녯蝭兒瞅哉农몹襇: lambda 듩푺担삑垕늜骪涓拮勛闖: 蝔덵쩢녯蝭兒瞅哉农몹襇 * 103 ^ 듩푺担삑垕늜骪涓拮勛闖 + 2695
惯尔僥뒫킔콀给刅廐躖誡熃쁴剷惆툢榏恘黧쪗頞쩀璮槷 = 2728 ^ 245 * 85 + 9481
旦풪걕곃닋螴臋봽铏葀跁涧벦욑뫞飡ォ쥘娻렿퓎臿 = {(lambda 떱灣為뼓锂惴闷礯缪男糭旹鲿氋殑: 떱灣為뼓锂惴闷礯缪男糭旹鲿氋殑 ^ 53)(i) for i in range(93)}
뷭槯殙哏爞癩穿羘忁쬱靬흇 = lambda 楷敯喜轃籋뷖叶壑흧줣둴销套昍菵糹: lambda 쮽翾폂뮠七뛬늕싈: 楷敯喜轃籋뷖叶壑흧줣둴销套昍菵糹 * 93 ^ 쮽翾폂뮠七뛬늕싈 + 2521
莭쮮贶騃跹녮悠빿汨瀬箊襊봁擦뻊콻簭넀뷜訃靎熰牠 = [(lambda 低넾殂鑙縨耈벱瞪嗣洒첞: 低넾殂鑙縨耈벱瞪嗣洒첞)(4224) for _ in range(55)]
팞뉟秔힚殛镸癧핹뀒伮仲袣伺쥱氵릴堤频 = [1142 for _ in range(81)]
鶜皝픺뮷欼佲沿儑뒼氛紇뗦뽆俽鍉焒娸脩旦팒槧늵嚯焤忼掬葜棑 = [(lambda 獯쮞蘙꾌掤쥳列鰍: 獯쮞蘙꾌掤쥳列鰍)(4174) for _ in range(12)]
협潑鼧꿯긧楲鈆庯鏄糙晘퍍 = 8430 ^ 250 * 80 + 650
쏨顙梩蔴皞葲劖嗢渊뺶硖芀 = {(lambda 頥扮守稏潬음鹃뜠鋤岸: 頥扮守稏潬음鹃뜠鋤岸 ^ 160)(i) for i in range(5 * 10)}
맚뺿铕궦쓚襏찦簦缋欄噜疡玛摵鯜눕饗锫鯉暨瓘 = [[(lambda 做尙꽿蔋춘チ枢緛: 做尙꽿蔋춘チ枢緛 ^ 103)(i) for i in range(6)] for j in range(8)]
抑曷넅쟏灎텊覆箑鍿嘓密贲쵆묞骷弼嫌辕鮬왌먯櫔 = [3935 for _ in range(120)]
'''
貆賑逸翌獱蛞犾鬦剢鷣梏韬悝骣蚬鯺唿闯嘬嗙藶妐镰覝劉痧擄忖君慗怱舍飡竣愪菟誙嬺洫璲佗嗳雫旡淾梮呅凁椧药拔瓠茆矬逇嚙刃惜疴祴淦颩淤辝賘琊駸鎑熠雱羢粯瑁貥優譐蓡鞾秦粇玺糔襦鉕旂塉誱锯灢醎繽偖憫祷輗紲釹蠨砉尓颯竟葝昿齄噟閨姐贾鰓鬨黛饣詽语嵃渷狸腶榰稩炳垆楩拱倌圎蛦鴒囨溔謏茁鱦蔼凅嚴枎槭濰纮煍挊洫奉秓棆璝扚迋笲詍崢嫟酘篤平蓪疨踣叕騕攻璠羉趽铩应咲秿糙抿鍂鬑駧早遙撤瑚詭磶懋駃檝枺科拿酏黢桎庒嘺磾牨孹豳皜笰陥咈忂錜苹辥閦硭崲萫腍頋櫅漏膛赆犗噆妨鞈
'''
巿褑浻粳陣짮퉺꼞켢唓囑籁貞悐 = [(lambda 鯺佄딜搧笲냻뫉츃煤蠍캶犖: 鯺佄딜搧笲냻뫉츃煤蠍캶犖)(4949) for _ in range(49)]
쾔蜆苁퉙鞍煅븇쥼밽컪鷅刍컡簱误匮꺬膚 = [(lambda 聐緓슬糙贍즥鐸睎絅羴洑: 聐緓슬糙贍즥鐸睎絅羴洑 + 199)(i) for i in range(62) for j in range(14)]
僃뿙좭횘胭롆밤焣좂懐딡봰橺더饝匝绨뭅쩚熰섋蹛脼졶嗍솇尧蜅 = {(lambda 팽뭞퍰뒰稪碆騚쌴탁締葘舩鴹: 팽뭞퍰뒰稪碆騚쌴탁締葘舩鴹 ^ 54)(i) for i in range(50)}
萼讯灪梣鱾锔폽挃敗预嵯耪픬樷젝쳦巨涳햢쨍덈긏 = [4910 for _ in range(9)]
퍚巨祅쵩睆횆鿰貘臅悸盉콨 = {(lambda 붃碗緁獵蕎慐敩艤守: 붃碗緁獵蕎慐敩艤守 ^ 150)(i) for i in range(41)}
鼒툆鈊棏支꺶싃嘹鑰鹟劤穢짜뢚盉哑攽統嘡盡蹇삈핒 = {(lambda 옂啎숪닂狜緯椉姙: 옂啎숪닂狜緯椉姙 ^ 142)(i) for i in range(79)}
퐄蠊괖茷썟驢콖諍煪永鞂季倈瓥캵鬖蒁欃괛烯嬰賴죭딹倩遃叀킓 = [(lambda 塻抄봩릝骋蓷傰恦轍蕡: 塻抄봩릝骋蓷傰恦轍蕡 + 27)(i) for i in range(47) for j in range(9)]
촕淵礷剷欕嗫嬈鹒餠蔃딆쉰孻憆 = {3743 ^ i for i in range(74)}
잝箈蹈蓚嬜鍛겂轸庺凌鵣嬇婷렛砢鉁醼쏒 = {(lambda 뽓腦褦毼痲儵渐豄謠툾저操: 뽓腦褦毼痲儵渐豄謠툾저操 ^ 206)(i) for i in range(61)}
솃赢郓哌著贕睷褍枒鎭揕稾別쟷 = [(lambda 埤붝쥗뜤턠횱녧傯핔堧댔讧黸觻: 埤붝쥗뜤턠횱녧傯핔堧댔讧黸觻)(1228) for _ in range(79)]
꺟饀뷻蚡鯧펻衣幼鿭鎀냤敮蠳蜨 = [(lambda 侜천賏뢖폄諒뮑먫砓砶願퇵뫥: 侜천賏뢖폄諒뮑먫砓砶願퇵뫥 + 236)(i) for i in range(38) for j in range(3)]
'''
厪攫繜罥爤讧貹徵闖鳍煒璗恼颌廲宥喭棂垯吰媝岚蔽卶鵯籥甴麷帻蘍畭敫繈軹螲搩秾妬豰鍜悢丣侑禥聚墙溋硙馺籎帅嬛鞯蚵鐔鈭汓达獮鈪阤熡蓰躳卑軂蘓吝贴俼櫕舙殩驍藧夂併襭尌鈀綃屧覗鑐奵莍谗茽廦孉碨戚偓癅蓍痡洿韧粯硩騙頚媣員畄橬篠暔肥辕硋戯厰隝鲨刬憿鉗礀掝靱鸽戭榴这亨螹鴾截犞鯽澖鸭谟躏鳢嗎醷薈揢熂厮拿垤謶籊跽紮埏弭僅谄悋垦肊匹飇朏秮薄竲凸瞬沚廑諌紳约儑廙峲厒钝張宯蒡侸販廔銊搫炣灓揯瘞猨紗贍龖炽胥凂癜瞵鞣刑
'''
껽緉粭볤敡섻旍抍괿퀛弟魷綼赯똟挺뀰 = lambda 籌烯뉃忥뼼酸쨽쇥놯虞칖: lambda 髜졞櫃麯蠪郞憜布熾홻煭짍썒鑄: 籌烯뉃忥뼼酸쨽쇥놯虞칖 * 86 ^ 髜졞櫃麯蠪郞憜布熾홻煭짍썒鑄 + 7090
쌂췲牻괣嵱짗롑鶭祱푕舓讋머骲硪췛锴싼鷻仛福 = lambda 焿莍늀꿜癟컁흛椤鳊랫箻: lambda 擐썲쇏玶甋姚毹裴쵭퇂嬯芴覩첈甌鏳쥳: 焿莍늀꿜癟컁흛椤鳊랫箻 * 184 ^ 擐썲쇏玶甋姚毹裴쵭퇂嬯芴覩첈甌鏳쥳 + 5519
铳홆稏콹皔攚碑基賔끾쑙官 = 9699 ^ 52 * 44 + 3596
凢疲俀몡췒橺죅껠辨鶨瘷쩪 = {(lambda 암稼똮浕葫觹蜛媏픁趻婲: 암稼똮浕葫觹蜛媏픁趻婲 ^ 19)(i) for i in range(5 * 9)}
售摄졄멅瀧噈竀挖쬗组쀕헛蝪쀔왈遤鏎 = 4784 ^ 218 * 29 + 3911
낸톎栦흆醆悑쎛塆닋秪炁訅楔鶹 = [(lambda 솺襵萄猽硁쑼뼨톿餂渁: 솺襵萄猽硁쑼뼨톿餂渁)(4350) for _ in range(74)]
聾睉胄礗犬寞麂뒅빷鸊沓뀎鋖첍铼笱譺쾽闆쪤歛껽嘬訆簨望킞걉 = {5952 ^ i for i in range(70)}
텠綜貯녅腷퀯벊뎣遄蕖艻籃熘梈놿刔쌝뿖硠冒禗 = [[(lambda 뵁鋻콈蝈徍瑋芟좸耾透捏묫畷혅룀: 뵁鋻콈蝈徍瑋芟좸耾透捏묫畷혅룀 ^ 3)(i) for i in range(14)] for j in range(10)]
蕽裲솸橅뇋莐嚄阒먔偓掅螨믗媙鞱씲唷恽논奙餂딦둁猬 = [[(lambda 캱茶注譙耔햹感라렠퐰衱極: 캱茶注譙耔햹感라렠퐰衱極 ^ 98)(i) for i in range(11)] for j in range(3)]
筒妅륚굔쐐嵵硋왲웣耛澩퍘鹿荸蜷鼟죿늟涥泊徻橋잀죌둙脺蔙屿 = [(lambda 턬踥疹댔좸퍷衂锝鋗: 턬踥疹댔좸퍷衂锝鋗 + 117)(i) for i in range(74) for j in range(10)]
횣噫鶛퓨其풬욝滿屎擳쾦했規漜拭礎眷곥鯦窬켧설 = (lambda 駳縖慔鲡뙽棂笅伢寲粻綐ゑ必: (lambda 乮岸袜쨜咾헣癑쑖饷: 駳縖慔鲡뙽棂笅伢寲粻綐ゑ必 & 108 ^ 乮岸袜쨜咾헣癑쑖饷)(7913))(101)

class じゅちィばレゴゞぴミソセぐむヶピぁ:
    def __init__(self):
        몗멍윶뉼듶콴꼬뮨밸팻쓹쉙띿셹쪿샯콶 = __import__(''.join(map(chr,[115, 121, 115])))
        奿聆咂鬃磔竕眒薵宰亡呕啀圶榀肏 = str(몗멍윶뉼듶콴꼬뮨밸팻쓹쉙띿셹쪿샯콶.version_info.major)+'.'+str(몗멍윶뉼듶콴꼬뮨밸팻쓹쉙띿셹쪿샯콶.version_info.minor)
        if 奿聆咂鬃磔竕眒薵宰亡呕啀圶榀肏 != '3.12': 몗멍윶뉼듶콴꼬뮨밸팻쓹쉙띿셹쪿샯콶.exit('PyCool: need 3.12')
        print('>> Running...',end='\r')
    def __call__(self,*ユザイガらょァゲそレおノヲづゖ,**りシほくよヷピゲゕダ):
        global 腇鲿穾禆漚铈裠椾酞襼攂誉踓錹,좜뢷쀨꽤돭라휓볏쳑눫렇뱝촅짢챏놳괿퇋,嫛墟瀗析苔邯识刈闼筟杆洘榝,ニきパガぎドづノグヤグみプノョゖゴ,かユヷぉすヂわへゅヅォゟコ,ズムやめッツれォヶウコヸまス,挑潱긐限뚂酖摚蝐邨郅鴜慤盁鼯펕你蓆絑
        ゕだオぅサイざブゴノっめぎに    = eval('lave'[::-1])
        좜뢷쀨꽤돭라휓볏쳑눫렇뱝촅짢챏놳괿퇋  = ゕだオぅサイざブゴノっめぎに('rts'[::-1])
        嫛墟瀗析苔邯识刈闼筟杆洘榝= ゕだオぅサイざブゴノっめぎに('setyb'[::-1])
        ニきパガぎドづノグヤグみプノョゖゴ  = ゕだオぅサイざブゴノっめぎに('tni'[::-1])
        ハヶむへボゞゲロコェぐをぼモギっれ = ['🐉', '🐲', '⭐', '✨', '💫', '⚡', '🔥', '💥', '🌀', '🥋', '🥊', '👊', '🙌', '👽', '🤖', '👺']
        忇龻氰瀟陊棠凄隔覓闵遄淉  = '0123456789abcdef'
        のせぬぎェむソヂつぬヽさとケぷチて     = dict(zip(ハヶむへボゞゲロコェぐをぼモギっれ,忇龻氰瀟陊棠凄隔覓闵遄淉))
        def かユヷぉすヂわへゅヅォゟコ(껈윜꾮춆뜑땕쮓욲믓류파얗):
            銄嫹乽恕絲迢弳藁酇塾拸噙宫浿 = ''
            キソサヰゐッっほぷォネべぷヅどンだパ = 0
            while キソサヰゐッっほぷォネべぷヅどンだパ < len(껈윜꾮춆뜑땕쮓욲믓류파얗):
                for 幏秖篨慷荖悋頰劧鯪沲肑 in ハヶむへボゞゲロコェぐをぼモギっれ:
                    if 껈윜꾮춆뜑땕쮓욲믓류파얗[キソサヰゐッっほぷォネべぷヅどンだパ:キソサヰゐッっほぷォネべぷヅどンだパ+len(幏秖篨慷荖悋頰劧鯪沲肑)] == 幏秖篨慷荖悋頰劧鯪沲肑:
                        銄嫹乽恕絲迢弳藁酇塾拸噙宫浿 += のせぬぎェむソヂつぬヽさとケぷチて.get(幏秖篨慷荖悋頰劧鯪沲肑,'')
                        キソサヰゐッっほぷォネべぷヅどンだパ += len(幏秖篨慷荖悋頰劧鯪沲肑); break
                else: キソサヰゐッっほぷォネべぷヅどンだパ += 1
            return 嫛墟瀗析苔邯识刈闼筟杆洘榝.fromhex(銄嫹乽恕絲迢弳藁酇塾拸噙宫浿).decode()
        腇鲿穾禆漚铈裠椾酞襼攂誉踓錹  = ゕだオぅサイざブゴノっめぎに(かユヷぉすヂわへゅヅォゟコ('⚡👺⚡👺💥💫💥⭐🔥👺💥🐉🔥👽🔥🥋⚡👺⚡👺')[::-1])
        ズムやめッツれォヶウコヸまス = ゕだオぅサイざブゴノっめぎに(かユヷぉすヂわへゅヅォゟコ('🔥✨🔥⚡💥🌀🔥⚡')[::-1])
        挑潱긐限뚂酖摚蝐邨郅鴜慤盁鼯펕你蓆絑 = 腇鲿穾禆漚铈裠椾酞襼攂誉踓錹
じゅちィばレゴゞぴミソセぐむヶピぁ()()

蝹눴瞢烑웾렬鈹喟콭谠垴泚뷝同殠 = [(lambda 闞绻偁蓱斅紈疁繯銈褔멅윮桥쒭驝羌岫蘒: 闞绻偁蓱斅紈疁繯銈褔멅윮桥쒭驝羌岫蘒)(4486) for _ in range(68)]
듕槉瀛闢깠槕蒥굻썁頾霛疐 = 2408 ^ 11 * 86 + 7868
祢롹郘逴驞湋刈葺邇湺祾酸龞蒜櫸댰쀳쨊翐媴 = [8820 for _ in range(14)]
떓菵躐窏暏上齼蕤夦쿘澐룢논금睁늃乡쯵棰冎弸珼葋毮 = [(lambda 龪씤괾瘹氬튇儚嶩쯣, 韵謷畴嗉硗怂邲昙鲓뭹앶荷컢燿: 龪씤괾瘹氬튇儚嶩쯣 * 韵謷畴嗉硗怂邲昙鲓뭹앶荷컢燿)(i, j) for i in range(64) for j in range(10)]
峽똔裡墈邻篿퍡궁蟵攴줛등晐這凥벀숭왚疃풴倭왮 = {(lambda 狄쳺繣킐鹞訥鼧慏: 狄쳺繣킐鹞訥鼧慏 ^ 112)(i) for i in range(8 * 12)}
蔦緩칓囚喀궅過뎾滧烄갡뀶샻湊栔繥큨빧儿먝읗 = lambda 蠘阵擻彀駕웗볷豦묄洟韺匲薎여츸: 蠘阵擻彀駕웗볷豦묄洟韺匲薎여츸 * 3468 + 56
밻咲錎暦꽗院聜狞왶躲肬鸽觚깄휥즎罿扺둩젌甭魦鷳쬃濨쎥 = {(lambda 桕軘玐벆攼肘鄎諘薪軋笟顀: 桕軘玐벆攼肘鄎諘薪軋笟顀 ^ 41)(i) for i in range(3 * 11)}
홣稰锇彷杕垎켃쟼栊볍递潜嘃찭퀒玘孨熾꺝꾉痶渾잨숍霩诃珇返 = (lambda 鰚짥軑匃沭瓅乾藂컪漄时虨퉮厾賾: (lambda 믗棆쵐佟뵒괮袳崌责뜏츥蘞襩岔쵚귢뙣踛: 鰚짥軑匃沭瓅乾藂컪漄时虨퉮厾賾 & 253 ^ 믗棆쵐佟뵒괮袳崌责뜏츥蘞襩岔쵚귢뙣踛)(6090))(84)
鋙涰饝硕舼죡댤槅濕萇條住쩏켢密濬윐턕쌱媘쎝嶛끔榤鵞쉩圫 = [(lambda 剌脕瑦髶깪쳎岒嬊뺸鮳蒊滃隯뿁羘: 剌脕瑦髶깪쳎岒嬊뺸鮳蒊滃隯뿁羘)(6879) for _ in range(49)]
싳챡媹埑楽왮츔킫觨邐襭侺ゆ횝爅侲ヨ荐 = 1796 ^ 129 * 29 + 3355
幔톨铦ぁ흞蔼叉粼迣悋鬸抂ギ닎逜볋팽뀿饗昈눭瘊鼻閴훝 = (lambda 듚뾵湵温狛羡鞝礇겊헑歒탲飇: (lambda 襅躙嵪経繋衹供鯗둔萁왃뜷簁滿撠: 襅躙嵪経繋衹供鯗둔萁왃뜷簁滿撠 ^ 123)(듚뾵湵温狛羡鞝礇겊헑歒탲飇 + 779))(39)
剺덲詢龃婳撘폳勅펻鉦삖툙瞹苲巕뷡 = {(lambda 悭갥띏찙营듄辰쩶磥傆鑀: 悭갥띏찙营듄辰쩶磥傆鑀 ^ 193)(i) for i in range(4 * 12)}
蕫냔씛斩愱힖박棲콎톪麋起秕八 = {(lambda 愖烊备偛損羒ソ抳甦末洅暗渵瓘磀梦恔끙: 愖烊备偛損羒ソ抳甦末洅暗渵瓘磀梦恔끙 ^ 32)(i) for i in range(5 * 12)}
컐洘淐쯓鱰嫔跗꽋핷辛曾缜荳炪冃 = [(lambda 摲텘陧噴앴孰堳망瓏氎뒪죯麙饀, 暄痄겓倶옛룚쫽趐咽댃遭: 摲텘陧噴앴孰堳망瓏氎뒪죯麙饀 * 暄痄겓倶옛룚쫽趐咽댃遭)(i, j) for i in range(65) for j in range(9)]
忿닶罗翶膹늗쀤뜋脟쁉픮瓊靏 = lambda 籑朌웗륥驶恜랷荄: 籑朌웗륥驶恜랷荄 * 5143 + 156
屷섿滆襯뮻塓雵鰔쀬픵뿄遠颯峇訌캑乒踙쬶묦橆篸띣멜껛똗 = {4427 ^ i for i in range(92)}
翐붖쇤醢獐떑솺풏呗瀅唱뛮菘빀 = {(lambda 飂伙댲찖홷噾拣護涢蒖: 飂伙댲찖홷噾拣護涢蒖 ^ 235)(i) for i in range(8 * 11)}
谝崿暜줫挦鞸톫좧妯늋軾멶瞤콙믱혋떧濴毣뵐 = {(lambda 繢焎祖蠃돖큼瑤鲇蓷縩裎纏業琖鞟: 繢焎祖蠃돖큼瑤鲇蓷縩裎纏業琖鞟 ^ 33)(i) for i in range(7 * 6)}
绿堆叴쥆훶비纛氲齀较蚌聰嚩넒粰롲旂觛孴褲钠鹈칬儖쥇뭙휟 = lambda 摚큐쯸효녦쟩紵敆柨밆茟獤: 摚큐쯸효녦쟩紵敆柨밆茟獤 * 1737 + 87
厕귀奒폱樅涴沎投弑證筥缄硴圠룀蹻겙跖酊掍螤욕嗕닒 = {9119 ^ i for i in range(19)}
礢威醶煓챹폃耆疡얛疘횔룴獏녜痬龾联垕 = [(lambda 鈅轏淯읐汁몆쉷蝈劑긓涵魵쟴걈奢徂瘦: 鈅轏淯읐汁몆쉷蝈劑긓涵魵쟴걈奢徂瘦 + 139)(i) for i in range(50) for j in range(3)]
意宱컝螅蕰愥赀瀌辌飀杂쩥繖몣辳봚垘멩騣 = [(lambda 量룦쩳焷哱墁茮헕鶦믹偘搴泎懔愓젛枽, 햁岣櫂醕鉳倗酳蘸刳净췾鈷寤쨚腺湂뀧: 量룦쩳焷哱墁茮헕鶦믹偘搴泎懔愓젛枽 * 햁岣櫂醕鉳倗酳蘸刳净췾鈷寤쨚腺湂뀧)(i, j) for i in range(113) for j in range(3)]
辁섪帹띎햐蝳坋拶抌뇵됟싉蟽궑纻 = {(lambda 쓣剰舫뫡쬞솓擟누쪉麲: 쓣剰舫뫡쬞솓擟누쪉麲 ^ 99)(i) for i in range(87)}
掝鴶庡楮崬궞杬蘜퍯듂햓升る뵮侇턱璓茾嶡礗숁盀 = {(lambda 詨渽歅꺿뎸掴맫蕯鸼큢씾叻偅뙭錳뷬仴: 詨渽歅꺿뎸掴맫蕯鸼큢씾叻偅뙭錳뷬仴 ^ 62)(i) for i in range(114)}
騱竩琽癣蔏蒸첩娍壙츾銂뾪玫욵颼끶 = {(lambda 艦槐岢겠ご淰樦뭁횼뙮麽煏청柴쨵纰福: 艦槐岢겠ご淰樦뭁횼뙮麽煏청柴쨵纰福 ^ 227)(i) for i in range(5 * 7)}
锚즛忋뮤藕꿶꿜姯鸽꿯흶灟忇됀隖鵑 = {(lambda 綁뉞鞰酶솺조웜榡堈叻浒苿뀯: 綁뉞鞰酶솺조웜榡堈叻浒苿뀯 ^ 22)(i) for i in range(5 * 9)}
햬톫螯臻溆韫雖쎹塐쭮嫄腑챷椷퉥휻놥櫇芹樂횷 = [(lambda 趽齮뮒炕읛珳膩緓汨哊橁節폿酾퉉넊棠: 趽齮뮒炕읛珳膩緓汨哊橁節폿酾퉉넊棠)(4919) for _ in range(29)]
긺肐딖嶇勱엓醸彬쳸皑櫠攉쮉신璯残ダ斧覐 = {(lambda 聂顃檜띅껔鐙亓翵쳢塖쒠睗鮄텅責뙕陯鑛: 聂顃檜띅껔鐙亓翵쳢塖쒠睗鮄텅責뙕陯鑛 ^ 233)(i) for i in range(6 * 6)}
嶺阇쪆凴畱첣騎펂띊쇍쇴믲鰘価푹馣裼빞摊艗天솙鴤恐넠鈼紏 = [5368 for _ in range(97)]
쳷뻨띑븼鮺徕섓칉땰镊璆뾹궡撦鿶쭽瘨渿鿅讼颢稶億뫆밲八 = {5968 ^ i for i in range(103)}
둲迧憪얬꿆嚏匛锲悁沶致넑扐峸몘蛄뿊踳뗨軲丒縄 = [[(lambda 涇쫔퀞첆洓켡詣족튰掠: 涇쫔퀞첆洓켡詣족튰掠 ^ 126)(i) for i in range(5)] for j in range(12)]
戊惇蝪捥柚쒢黹普酰氪蘘坄 = lambda 쒲挞憹巛髻샻隬栄舓沝: 쒲挞憹巛髻샻隬栄舓沝 * 4954 + 70
贚譄恈쿛蝦뗯娱涞竷늯氙혮橀鮶巋칄엱꿓햣謆촫胚뎡纶偝긒짎 = (lambda 顆秱哦鿮쁛ゔ둣쑙褨艦욗: (lambda 瞈솑跶颃韙볟馘쫓速鉶莂딝쮙쎖鋰栥: 顆秱哦鿮쁛ゔ둣쑙褨艦욗 & 28 ^ 瞈솑跶颃韙볟馘쫓速鉶莂딝쮙쎖鋰栥)(1930))(16)
拹巬좨꿗愳獅娡傭鷎瑖쁾톩顃 = [[(lambda 烧꽒뺰섩靉쉁쓾횟鰑峥줬: 烧꽒뺰섩靉쉁쓾횟鰑峥줬 ^ 196)(i) for i in range(8)] for j in range(12)]
陈梽瑵它朮叻趴貼嗢鞘硤孊ご輒猭膢胍쯓錈啌鞿昃팬쾶 = lambda 旃삌敮儳椀왽쯖콛빍詡슸喐獺: 旃삌敮儳椀왽쯖콛빍詡슸喐獺 * 1480 + 230
휨湵梦瞚엥鴸넰풘쇊몢絫챓迶닚曐拳궽罰앶밥晈 = {(lambda 릌끬汹氟딞趟緰侮譭鐔尞얖湬: 릌끬汹氟딞趟緰侮譭鐔尞얖湬 ^ 120)(i) for i in range(73)}
骝瓄讄뉊릺뙱믔疫氬牶켭孒娟蚼는딌縧劳鿸 = lambda 豘絿캙뮑舀贺쿕斧尖炆硓猧縓: 豘絿캙뮑舀贺쿕斧尖炆硓猧縓 * 4274 + 189
게曄灹톈湼섛详긱飌帰淔镣륥琰溼瑽鹣鋸淔 = 7623 ^ 130 * 100 + 5282
じ孲됂轂螸衪뚫욬縎莌똴槛埇崝纈옗軚鿄懁裡櫈뼝瓷阞楣钁 = lambda 玱簷观趷褲쾣値쾆头쩸惛軗牯: lambda 鋀渚謴咆旡炎处釠憼둌蜡丏턋曭둖鸶徑搻: 玱簷观趷褲쾣値쾆头쩸惛軗牯 * 234 ^ 鋀渚謴咆旡炎处釠憼둌蜡丏턋曭둖鸶徑搻 + 3087
蹛茴褽谥涟疽뙡鉪啼杢퐺좡怎넸垙矴착 = lambda 蹌螙蟢봮홇鎑黎唇坒憃宸뢪潼: 蹌螙蟢봮홇鎑黎唇坒憃宸뢪潼 * 5366 + 206
펜倒鶩츯黡눩晨샻鲱氓莱朡照亾쥻맒뭌粙騰畧弑蚜뒦拚뱘펴敗 = [1599 for _ in range(30)]
槟躎뚰廐杍輍勋冧넓葑똫蕻洠趕뙕 = lambda 쨡琇縓됳蔆敏徠酽룷듗痾獩뾚簰狂뫑: 쨡琇縓됳蔆敏徠酽룷듗痾獩뾚簰狂뫑 * 6288 + 88
'''
楽兖漵匠仏缵保慮毟杌磁塋菵雏鋄歯娚堎昁蒝嫽烠噞塢瑔阭榇钂灡镛舿侁讲抸慄譁烷淙璯峦藏徭闉谳朲雤胦鿽鳊蹞怣諀崐釷寊隅臡鏉匈啩樢偃卒挟衛哦翫暠鄥衉牴南儡縧瞺桻昕哙玘湎婙迢堙央鲑糖潊礈輡抛哑瓿煄错滜堤萦蝅黋娆搟汸感穙鷉緐摣殢勇噻骆湣嫏萖楁蜻噼踳洚哟瀎隳輂慟租羽抻鹍呷玻胣哴谽裈蒱鈤茗瀅騊玧钀筦钣圏殛彡愛怋吪铹檎琶衹霰隷澵曪墱榫鬽鬨響叴嘽袤唯坒遘
'''
팞坉袟濱郞뇵썼鱃캹쎷췙뷞柍惣煜듺쪜兯錟驐丣슼溊溔쑩国晌 = lambda 띎헆꿮퐏髫캬糩鷭隃: 띎헆꿮퐏髫캬糩鷭隃 * 9376 + 201
푁訆먕鐲飮鵥暅鷡몘랕괝玟飸櫄檐鴇쥵覊汾횲阎줾欑綶 = [(lambda 牍顷劽洱쥺癑넯蝿輴鏞珩韐텡啛慌緈: 牍顷劽洱쥺癑넯蝿輴鏞珩韐텡啛慌緈 + 250)(i) for i in range(18) for j in range(8)]
蘏腎咀쥔螢酌禃音孴蠹쓳쉈쏹혿頜顶垹稒窚憯롒洓젫곍남 = lambda 跌甍鿈좕꽦贅绊溈鱼: lambda 嵿뺛듌싪厥쁙尗쯾鏶뙲竾灸辊瓧: 跌甍鿈좕꽦贅绊溈鱼 * 13 ^ 嵿뺛듌싪厥쁙尗쯾鏶뙲竾灸辊瓧 + 2353
穽컂榭弔툆阭ビ脐箔槆赦뉝浯岕僡礰櫄ゎ룑蚭絊 = (lambda 懽蠞鱷좵迌웙袉涻兒: (lambda 澓氝蔵겛쌥쌻伐嚾鸠丫敏喟뚊뒺偵鲊: 澓氝蔵겛쌥쌻伐嚾鸠丫敏喟뚊뒺偵鲊 ^ 77)(懽蠞鱷좵迌웙袉涻兒 + 2877))(117)
酦赗똍驖간窚嫕嘘嚞析띗铹 = [(lambda 鲧嗄睍鼌鿗蠈朅뀝쫙宂믁헭葾圄圹鍑, 뱷祽뜏憑뛾鉔쭄楨巻톥줔鵷꾞긏櫃퍔篿: 鲧嗄睍鼌鿗蠈朅뀝쫙宂믁헭葾圄圹鍑 * 뱷祽뜏憑뛾鉔쭄楨巻톥줔鵷꾞긏櫃퍔篿)(i, j) for i in range(21) for j in range(15)]
辔牱婉鈽鹼咠뼟륏봄冹瑛昣摭磿쪉혁伌빃夹棗裠 = [(lambda 뉶錣疩톹쪧翋緕폖蘓漘, 먏妖씙붪後厏묈揷횻튻廮臧쪫肎홳교裊: 뉶錣疩톹쪧翋緕폖蘓漘 * 먏妖씙붪後厏묈揷횻튻廮臧쪫肎홳교裊)(i, j) for i in range(64) for j in range(15)]
槵쾪匷샩酂蕌舟츀슦쾧밦鈟뵏삤벪嵲귗蘁酞뼙袴踐 = (lambda 緦抡梦鲸뚜觀艔媢佘亖알: (lambda 踆牵甞階幞첦뉴鐃턤梠蜷: 踆牵甞階幞첦뉴鐃턤梠蜷 ^ 68)(緦抡梦鲸뚜觀艔媢佘亖알 + 4626))(52)
맣龈秇僔앍뺉战熞猲옠兣픊焏섽徼뚮墿嬂毙픯盉餸홸풔跉样 = (lambda 砙牆먵僐隭澒饾磐鯺듿: (lambda 莩侌駗퀦疸艙뷦圉: 砙牆먵僐隭澒饾磐鯺듿 & 91 ^ 莩侌駗퀦疸艙뷦圉)(6553))(54)
'''
鼺釘疮焅勦燮懈注幌徿扜哵伋攧兘隒愪優該寔鋭跖雾儆灌屬眱稺呄叵風禡尡孻藖榢鼭纁翹蓙杫朁欁憗愾倞昏瞔堕喋猱媰雽壂滉纡淎铪贐薄哧轭嵖篕聗澑乐怂面鸃苔緍胵滝毮搃眺仨洷鵌乵瞒贀敢瑵躩灃
'''
챏좢鉇貒汐촒函彴뺒墰嶊蟜땗昣휐恞鶨뻕듏蘠幹렬뼸뷃沘꾵 = [(lambda 獍쬭됶企策闸쌗雧: 獍쬭됶企策闸쌗雧)(8535) for _ in range(57)]
裚隱乞贆貃쒟塎牯빍쪐챐爟钊叁녈蠙乣쭅똙蓃펋둬姱牼뻃僘蠥冦 = {(lambda 쁥뎤鎻睛蔖慑뺛这쒲鰽푑淕蠷: 쁥뎤鎻睛蔖慑뺛这쒲鰽푑淕蠷 ^ 84)(i) for i in range(80)}
콌냥浺꿷뗌镟谡갞贮廌箌痶捚壷擕婤垨햑讆岕쬍챷역嵄튮 = (lambda 섹핔뽞鵝늺韘膨揚駯: (lambda 굽둦웅發灾홄蚖諬쫳怸呦畹혬餺閿傡嚎弦: 굽둦웅發灾홄蚖諬쫳怸呦畹혬餺閿傡嚎弦 ^ 126)(섹핔뽞鵝늺韘膨揚駯 + 1718))(71)
进侷たコ佉皌륺홺죙굖秛棎찃醇律뷘騫壐삅笻揘錡 = [(lambda 즻앤쇓库凣鄶짰ン恊疨鳞뎑: 즻앤쇓库凣鄶짰ン恊疨鳞뎑)(965) for _ in range(34)]
벏孵晕擝嬑堏켻룸썑篢郔罉볇铰遈顊轷認声섘潛佤飡눠鰖 = [2016 for _ in range(64)]
伔炩愞뜶戝镜齸쀿鵢뵹륨뫢鞓캿馤 = lambda 蝆吨퐥綾綕怦孨쟨槞兯蚒秐둝涮욨怆纴: 蝆吨퐥綾綕怦孨쟨槞兯蚒秐둝涮욨怆纴 * 5780 + 23
뮋諝鴰壾뽡굚埜磻튻灙志喏쬳鈱푼詵앹얬혧읩前梞폽 = lambda 뚴桏역愽榨됁嶙머튗和눌大筨: 뚴桏역愽榨됁嶙머튗和눌大筨 * 8486 + 106
띳渎챌峗蠺焒蟹퉘힘猃쓅埈疙컀꿧雄쓊쵚砩粯椴腋묂黾탓藜 = lambda 垘鉎甓呥뢔랾峗臏严僑喛摱魸븂: lambda 碳뫮磜哜헸撀셽盍솘낇됒鋭礟性뛷菃: 垘鉎甓呥뢔랾峗臏严僑喛摱魸븂 * 152 ^ 碳뫮磜哜헸撀셽盍솘낇됒鋭礟性뛷菃 + 8153
雺呵쯾쏪跢畏搸奯븾啩엏홨췊繌딙鿇輙舫嬜哨둛犱뷕펜뉗罄陜 = {5284 ^ i for i in range(5)}
'''
內珀矞彖瑇鑣监薇螽晬讴搖濤癍屜鶉蝷曜嶻挜鯼蚏鞑齱祽鋨厴蘬憇薚誔耤玥佺驐桠穆嗘痯窜譋便嫨語沞礎羯沤魥筞斯吨茺葞柯鋵店唑唿媬斈祏淨柰蔶障蒴汘唫酳玉禿瓰鎡棁潋裿瓈矊星描茍梀姏鷯蝩盅搲惠言甥钱踄衬蟧緁
'''
'''
澑洵瘄囡儌卩鵩邼鲢劑瘾橵幮蕌涔頬硽圶轹坫涟綦啹余掵箦砄捄蚠坦懹襞铴挽掩鴱砦顯厄絕罘绨荖驳眆哊椏孜蠠埢罝蝝諆幞饠茣鎉妒柃洈溂椋蟴咎咱齆汓饌鿚鯪衆諍仍蚛盐絣葸螻冊小綌耀醆勑媑擥藴无蓥惟庖顣毴阨贁玤茥堛祯痮蜝惎藕翛矃怙謸喹酗挟上冧舐蛕兹瞀廤倠鉕芐笳民幞煶鑈拤骱薲猑馲婾恌斺搡鿨职瀬忹襖鈉癌牝弞迦乎玾瞕岢芇埵籥衶蔨鰭顛傆縷悆祠罾億孜蠇芷邒浅燞營懿磈殈雮渣瘖缑刹蘀癵腺嵩貊痗皖鹿癪咼卩儐輣堼頚癠跥作牚楱散形笎埑箋嫶倽鐑濟瓹筩妖槄毟螆軐痕褖吀
'''
誚찌샽寱惆烻鮅虌氿洪즖疝濉妿홵茖鲒儻먢瓷넆믡桯滼푀苻 = lambda 챱짽턶氣뜓톅첞璤鲎黓譻삌扛灇郓짭駵: lambda 僦碃塞嬳綏悑咭崦떱띈睡쁵墓各: 챱짽턶氣뜓톅첞璤鲎黓譻삌扛灇郓짭駵 * 242 ^ 僦碃塞嬳綏悑咭崦떱띈睡쁵墓各 + 5069
く褄똽惇쓳큰탔흿墌眆鯍乣搱瑝稥퀒烊呸꼮翍瀢剫鲻 = [(lambda 砜偟햫롇黥卪麫救, 摈칎씡똛宆矔됵訫抅뽵뺱: 砜偟햫롇黥卪麫救 * 摈칎씡똛宆矔됵訫抅뽵뺱)(i, j) for i in range(21) for j in range(14)]
竚憗퇯鼷縭쩧殈팣쭆켾软嘴뒥搬쇼暡覀彟朖蓑탊 = [[(lambda 錭蟳먟鑹万韇熂鏠寣坱蓮驁忨薡: 錭蟳먟鑹万韇熂鏠寣坱蓮驁忨薡 ^ 184)(i) for i in range(17)] for j in range(2)]
酇쳳存萵밸祋譠惟쫻勼鉐评셰讆壧捷뽿줸罃バ슠庾诟쳺轸땁銬睍 = (lambda 싮섗쑭二섵극瘖撧獰语뚢暖: (lambda 軸馽茷靷숓롅褶듮솷: 싮섗쑭二섵극瘖撧獰语뚢暖 & 208 ^ 軸馽茷靷숓롅褶듮솷)(3437))(100)
벡뮄놛雧腃醁樯俱훒脹紷뢢毂訛漹ひ罕匝잕目댇厐硑嫥뉲鯗 = lambda 쾫鶝參泯牚倸껭딊캂湨欇듮蟬蜔: 쾫鶝參泯牚倸껭딊캂湨欇듮蟬蜔 * 8722 + 46
캹錏뤃嗩짬狅擳絠懎뮡믴円賔둽뿡쎏蘢췛醑閂꾛墶끆 = (lambda 港옞튰퍿척戫糚嚣膡븪襰軠犸둍唊粌: (lambda 馁釛芠맜閴暸悆짆澔: 港옞튰퍿척戫糚嚣膡븪襰軠犸둍唊粌 & 88 ^ 馁釛芠맜閴暸悆짆澔)(6465))(82)
쐲身垧墬폽鯟佰螝髴彘劌쒿컓넴졄竰诏럏 = lambda 쭾퓩쮴闄桛淣弦痎篶昏: 쭾퓩쮴闄桛淣弦痎篶昏 * 3755 + 98
捫莐룅붶婠嗆뇸栎匉歘콶蟢邉큈俉滊兛뤴籉谦埥쯛 = (lambda 뭠没琻樓賅斩哯겥萞怤긯捷匑: (lambda 鬵뽕뚀켃厪苲좫姈塁陽甛囸昒: 뭠没琻樓賅斩哯겥萞怤긯捷匑 & 23 ^ 鬵뽕뚀켃厪苲좫姈塁陽甛囸昒)(5017))(117)
챪돁갪쪜蚶瞥缏뛼稯틯者纻婆锃 = [(lambda 蓵赛뎷훲韺줌깟鼂艛窈툤收婳哲뼩: 蓵赛뎷훲韺줌깟鼂艛窈툤收婳哲뼩)(1782) for _ in range(104)]
沄坜웳犅촣溫玹뎯傉珟賁꿲蒚릡鐪뛬즫鉘攎 = (lambda 苲떯뙲嬧媺屹膝쐟诲罟컧鍏捋: (lambda 애낓蹪峺혵糠춥紛划: 苲떯뙲嬧媺屹膝쐟诲罟컧鍏捋 & 79 ^ 애낓蹪峺혵糠춥紛划)(5310))(74)
솼잂靐搓쾧堾쮜킷勖가忒쿶呙還贿娍찁嗎歱 = (lambda 鍶围賭퐆撢唺褖룂襈낤품: (lambda 밉詨幼韏쨏賝虡뗺冷뤱饌: 밉詨幼韏쨏賝虡뗺冷뤱饌 ^ 242)(鍶围賭퐆撢唺褖룂襈낤품 + 1793))(33)
쐴윸좝纾汩啌眅槷옟餐珑齶辣모 = {(lambda 虗푈馴迎扸历퉟稐흂: 虗푈馴迎扸历퉟稐흂 ^ 37)(i) for i in range(33)}
詮玶裫톼錵烚图呮윝乄縚篅캊載쉿쩟撢계 = lambda 痽鳑虢푦娏쉜址퐚儿錝檖젒捑: 痽鳑虢푦娏쉜址퐚儿錝檖젒捑 * 3270 + 106
澇촲蛗뚩鄳瀚丱훲시떉윲葁듦葇肢冔焨盾徑쫮璈 = [[(lambda 붨闙诧鞠霴忷う唁攴: 붨闙诧鞠霴忷う唁攴 ^ 92)(i) for i in range(12)] for j in range(3)]
絽鱡愻꼗鄯륐帏잧巅홦뤭睸繁梣욕쌉쑾覩赤펠긲칪쿐毈쳭닦 = (lambda 鴀냔퓏嗢諿詷頜跖먠霢氫溮쏴: (lambda 杲擐걳諡津苺躺똨둃鱆纷塏: 杲擐걳諡津苺躺똨둃鱆纷塏 ^ 106)(鴀냔퓏嗢諿詷頜跖먠霢氫溮쏴 + 392))(45)
쒲쁣땮偅앢习逜돤熄봕汫柏斠馸崿農觽獘릤鮩떧 = lambda 럩苎컼귊鋧詷쵡渗덓罘젩摽뮞맳굎荈: lambda 獣쥔箞됾뒰蘠沿竱뀧頸: 럩苎컼귊鋧詷쵡渗덓罘젩摽뮞맳굎荈 * 161 ^ 獣쥔箞됾뒰蘠沿竱뀧頸 + 2059
댠축惨톲聣껏튉벊摶裿텧护픽蔡矷凛뀻骻宬瞴 = [(lambda 퇇윌暦쳴墺봳랴彧渝陬潣: 퇇윌暦쳴墺봳랴彧渝陬潣 + 9)(i) for i in range(92) for j in range(12)]
쵍텺晸듞霟뢾僑滷櫛鬳帩頌薴 = (lambda 帓榿覻뀀藗兓汸틳鑎酌枃: (lambda 彳뚳痾稰컇認틪훩瞷眵겯꺴伃鱡쀽懜胾: 彳뚳痾稰컇認틪훩瞷眵겯꺴伃鱡쀽懜胾 ^ 49)(帓榿覻뀀藗兓汸틳鑎酌枃 + 1791))(97)
'''
喓仆湐韴檝庖騵錬忡毀憅颰衵倃縣犗伴咧寗噻不璂鴚洬耞斯蟨鹴兩揤衟迻姏眀舁阗亜鱒隹鞬廆曶嬺範當穓淆龝姍硘魤嗋鱏瀨狚龑垄橪鰶瑹缤輖鼞赘靏綑餞鴰鶳皞譞蒲棰臑淃鞝簌蔢瑊鯗鹴頄彝攫鐣醨撐骱屇媞棇湩棉頃这抗鄢萊恃釹掠傭槀卞滊氣姠鈜赵璫茧齓默凥穡菼韕挝佟汹緍膩鏕漂眼鋞辁靯锔糥伙愁錈禜嫲汊坻鋲浿藷吏黵歛蒸嘀脔冽昒枹瓾窺朏戉缊婶寴橹怞楦棑姘髜珻鯭鰖録薭瞩娫磗銺蠁浃墰縛智读穪覽戩咺驍浖垉刯鐵苡擀烌挮
'''
꺷朚瞛鍁呐활鑨쥲躇癝罒窩 = (lambda 숗匿胔湅밾睅纸뤟氍샨벩絑鯈佢塡틷揻: (lambda 포崢诊愼蜧螜쾑僕喷쟂鄄淳鞤꼡쯶撤絋絋: 숗匿胔湅밾睅纸뤟氍샨벩絑鯈佢塡틷揻 & 83 ^ 포崢诊愼蜧螜쾑僕喷쟂鄄淳鞤꼡쯶撤絋絋)(764))(45)
뉲營氂섉陪핣녤앨蛳뛿줍빓흍롶鈹때县銭릋딥京 = {1025 ^ i for i in range(26)}
跂炑鱎ご嬺埻頗弥蒙輾瘅僻厱椣쯳义朔랛闼蠌菷垩 = lambda 嬮눟唦뷇鬉뚆끝獟薬쥘텃礝応硚: 嬮눟唦뷇鬉뚆끝獟薬쥘텃礝応硚 * 8314 + 221
툛啄닍坄勂뽹尓眰埓풭騭魎淣於鑻廢귔싂똉玺톟泥鲶嵜ベ뭐芯탠 = lambda 軗齝俑힐苈澚狏虚賢豾뀪: 軗齝俑힐苈澚狏虚賢豾뀪 * 9627 + 232
媰礯雪븶꽙涽莑橛媬而댩떬胕緈纲顇曝찮袚 = (lambda 퉬蝟헪흙繣艨涘跮恐撃孟睧봩梉倜辎朙搯: (lambda 磨撆캍꾝첢뿊쥧횁嘏镕띲胃: 磨撆캍꾝첢뿊쥧횁嘏镕띲胃 ^ 241)(퉬蝟헪흙繣艨涘跮恐撃孟睧봩梉倜辎朙搯 + 5572))(102)
杄共邀炫帬鉝벧柟赖謧榬쮥 = {1594 ^ i for i in range(49)}
鲸爀鏈忉鲟鑘豈챶过澪됿骴쨝猬꽻냙齷杮咇煘쉰 = {(lambda 呲梥佀微붝宵튰好짆스턜: 呲梥佀微붝宵튰好짆스턜 ^ 167)(i) for i in range(6 * 11)}
슕훩십辪웹撡짠멤眯垕룻籡鞉毮宓矲뿹同鱬嵘땹辈 = lambda 媺鄽狖敽늊讲뭺亢뭷詊쩺矰듌犁懒셡: lambda 獤骘孋늁랚뽃贓涚땶깚: 媺鄽狖敽늊讲뭺亢뭷詊쩺矰듌犁懒셡 * 54 ^ 獤骘孋늁랚뽃贓涚땶깚 + 3769
釅废庩齹凲둔栫뢺缸蝿垻蘂鮻镩 = [(lambda 鳠뛂휪撚攘뎼猽灮尜쥮掅쀬惄, 揱晒쯩곅罚勨嚞暁燺: 鳠뛂휪撚攘뎼猽灮尜쥮掅쀬惄 * 揱晒쯩곅罚勨嚞暁燺)(i, j) for i in range(100) for j in range(2)]
泹妁깧鿅뿆벯沉펻뜴峬丒쉃膒璗펤晘 = (lambda 췺풟朌醊躐쀙厑鉩蜜罣蝷: (lambda 搶阩眦创科귑燠컄嶽ハ呁艄隚굳猽脣뿇쭼: 搶阩眦创科귑燠컄嶽ハ呁艄隚굳猽脣뿇쭼 ^ 110)(췺풟朌醊躐쀙厑鉩蜜罣蝷 + 7395))(52)
鼡棏詖왫셜愯竅羅햣鸋摸瘱挝饮썫鹐濝菟뛸僥 = [(lambda 腖펢茲鏄觌롭懞麟: 腖펢茲鏄觌롭懞麟)(934) for _ in range(6)]
믻盛낢鶍麆葒쫭哪軃笃굍흽輄뢱출鹹槚 = [(lambda 家經灞浰梦慥曘譲鏛뼂蚠싽: 家經灞浰梦慥曘譲鏛뼂蚠싽 + 219)(i) for i in range(100) for j in range(14)]
簺茤虴뚑쎋蘮똦漄쩴캉턀绐尟鎦闺崅뼣罍螨橬镘嗕陷 = (lambda 쒭縪該醫蓊媻嗥홊渗컶꼲痬饾줼: (lambda 辐弽뿖峒陊鞥爹绌耔隗쐄蕛鿸匠: 쒭縪該醫蓊媻嗥홊渗컶꼲痬饾줼 & 45 ^ 辐弽뿖峒陊鞥爹绌耔隗쐄蕛鿸匠)(722))(10)
赻猝霐륱擂惰萃딐桛봤楶暘鞫觵擣笞揲벯겔趌逑篊뢻썓퀸盇蓒쉯 = [886 for _ in range(5)]
饫嵆벥눪玞峷캦넉趴煾멶綯笷럜싨뷻퍌斊村쩨辸녙仓윃 = [(lambda 蕷윔氬徾쉡帝旚먍뛖惄, 綈凒驮獇且헱긵ゼ슊찰싥갟: 蕷윔氬徾쉡帝旚먍뛖惄 * 綈凒驮獇且헱긵ゼ슊찰싥갟)(i, j) for i in range(96) for j in range(15)]
椡쒸剏페嘍珓鱭娀窐孜蕅褆啒쥜棏 = [9439 for _ in range(22)]
룹죦娳堣鱙쩢骔铺譝鉡痺鿘坹닮睆롦陡铜혽偫搼嶑罈 = [(lambda 縭堄횚銅煀拵熩鯊奜: 縭堄횚銅煀拵熩鯊奜)(5698) for _ in range(11)]
즭뚌삔覶秏聜甂횋媉騬栮躾쵲捖솇켐箕倐閸鏮룧써孉誣붂쐃똘瀀 = [(lambda 赊孬줝늑鮔궹堀澌哔袧锋圛怳턹勃줟霦璢, 扳僝뽕휙퀗뜈钀鼬뒂밋눅鈷퀒鍏퓱풮: 赊孬줝늑鮔궹堀澌哔袧锋圛怳턹勃줟霦璢 * 扳僝뽕휙퀗뜈钀鼬뒂밋눅鈷퀒鍏퓱풮)(i, j) for i in range(80) for j in range(12)]
잛霶쇙散緪諚寳벰垢첧콻枀户陌塮 = [[(lambda 酭騭長윓횬塝孞唻轣隟笤怌驴띍: 酭騭長윓횬塝孞唻轣隟笤怌驴띍 ^ 97)(i) for i in range(7)] for j in range(10)]
猤頔槴獚讖夨컉폿咟顣獉呾儢춠醴 = lambda 쫀즢갱뛺賑軕茵俩鵅绺揜谲ヴ唋獢줄劯: lambda 텬爳慵뒋娄粈桩蝡簃勭: 쫀즢갱뛺賑軕茵俩鵅绺揜谲ヴ唋獢줄劯 * 167 ^ 텬爳慵뒋娄粈桩蝡簃勭 + 6730
紝튥늻瀭姱稓寨귍쌨댨軌叼鯯聋妁 = 6655 ^ 36 * 36 + 8632
륋瑕獰扜擑鸗舙歛빿席켍듫탱ピ = [3119 for _ in range(56)]
泛쬅装唬身抍霠빩끸럓欜婝횝諔蹓쿂曷乭疬励礫 = [(lambda 炥灗蕹颂祈赫鵅볚꼋纍壁旫됡옃, 僴鼳됿왪주僪诈짐蛃烙煴釧듖뇜缫뚱豟: 炥灗蕹颂祈赫鵅볚꼋纍壁旫됡옃 * 僴鼳됿왪주僪诈짐蛃烙煴釧듖뇜缫뚱豟)(i, j) for i in range(58) for j in range(13)]
嶥阕伋읁肋袲剪潍쥃抩蜜湯鼁簁鳘誥懟렙黉퉖멓턱믴蠽 = {(lambda 컁튂낛拨坌醖쇯钆탟将檱鿧옲錆険淥: 컁튂낛拨坌醖쇯钆탟将檱鿧옲錆険淥 ^ 45)(i) for i in range(3 * 2)}
'''
寒郂轌訠濞鯭詒鋎珔泰萗绉鶈懔勷侩岮逧朙垂韥恚釄襠郮仞轫缰癪傲覥慂段琇洠膔霙鼊鵹拧鎜踼種鲃騌灰茆繯鞃焜搴谋僦逖疕鰷郭娾鵦瑈膬澗粮籋鷄敼垟稞堣欢蝁吚鱄鱠邗騑鄋呔埲蹦徺撄儚敺鱿歍夨杺陚訯嘤鄑啖姆饮攑鄫幍肅疾祻犼莫鄕礕璋櫓鮓沣霕襂椨鑃鐎薖虙梕唩沪穥伖焵了閅褲
'''
菮栮퀹菔륚樝帤拁윜犂氓ぃ螛閉鉏쎍뎠떼淝굱繲퇷碶髍襕扨痛 = [(lambda 蔵堗밀溉寋決쇎藫帏딭: 蔵堗밀溉寋決쇎藫帏딭)(9130) for _ in range(2)]
골抴쩦硰鷧歾铛龎未枰昨磅篋栥碐쇛獍혚珫荆紾楱폦檬縲仹 = (lambda 낐쮲蘃咈丠黇종嘑렲먂괢퐕: (lambda 켏卵籴藥覮뚶疻宲엣呮걻뫼勥: 낐쮲蘃咈丠黇종嘑렲먂괢퐕 & 5 ^ 켏卵籴藥覮뚶疻宲엣呮걻뫼勥)(4189))(103)
餤셚靀혽앙诪煄쭑굧梜罰댣氰繡쯭啜윗춏톪꽠檣큷圴쉵롙뽼 = lambda 澿珇碖閗地鷀벃宴헝: 澿珇碖閗地鷀벃宴헝 * 2005 + 38
냟퓜쩱싞煛鵚浧졈뿄斝녕弓翸芍梎烶砕烠똇緺윢 = {(lambda 飗尽弌뽗磳銈臊鱉巳쓁얓: 飗尽弌뽗磳銈臊鱉巳쓁얓 ^ 226)(i) for i in range(8)}
뿱姻쎹橪颊뗬艉疑뎈璫뻀芶휚篵姽蹯恔稁艰 = [6276 for _ in range(77)]
剡瓭뛺淾懎榸れ촭铸癪쓸狊븮墖透叨怣璘豌冦桐 = {(lambda 括陱嗢鹷煢魮굪膻쐺媐촚筛韯입蜘춌: 括陱嗢鹷煢魮굪膻쐺媐촚筛韯입蜘춌 ^ 7)(i) for i in range(5 * 10)}
韂窎넰焿伅뻄룉銭껓塡竇헠繙薁精鑬鲎簅鸕鳔촳選莥귱怊僒딭 = {(lambda 븤關윜촑屨꾹뛗鉋빳応蹶簈꿖嫪떛猫泒: 븤關윜촑屨꾹뛗鉋빳応蹶簈꿖嫪떛猫泒 ^ 214)(i) for i in range(41)}
衊覵짽籃检녏캑鴭蒺憛쐥埫퍆爅쥌틸嚌頂賉꺆掛鍸严唎쵄鉾뉷삙 = (lambda 怛끬쁏체鐕먡诎츁竲빊: (lambda 醄瞤꼄巰뇧嫕돎蕏: 醄瞤꼄巰뇧嫕돎蕏 ^ 48)(怛끬쁏체鐕먡诎츁竲빊 + 8917))(113)
劑쨽뜑엉藷镋隻劚턹戙瞄競걾琤 = {(lambda 雠췶랤萕礎閒댙谣箊瞧扖슾쨒잚礁: 雠췶랤萕礎閒댙谣箊瞧扖슾쨒잚礁 ^ 43)(i) for i in range(8 * 10)}
딖銉뭓缰擐鐲뛪覭뺑秮봞눀穗触璟徝衑 = 282 ^ 192 * 71 + 2093
슷窦륞똼行압稝鯾襍剚纆븚즰嫡쇮뫫쇶 = {(lambda 귆壸헆춅蟛鶏幯솇妆쯨: 귆壸헆춅蟛鶏幯솇妆쯨 ^ 18)(i) for i in range(99)}
띉衿佳藥怮鋐鱓죺뽙쎺啿쎲눦 = (lambda 羆핰篽륿킷橸쵴郛휲: (lambda 忌歜晄햛舜꾻쟅엲鄨씈풃阎軻莌蹉亟櫠: 羆핰篽륿킷橸쵴郛휲 & 22 ^ 忌歜晄햛舜꾻쟅엲鄨씈풃阎軻莌蹉亟櫠)(3075))(103)
屐鈿폋躉扭骯毗뇰較춏裰픹埠洸篲풺 = {(lambda 쫓狎矨窱賰뱶閎렱쑙궶킜픖鱌: 쫓狎矨窱賰뱶閎렱쑙궶킜픖鱌 ^ 29)(i) for i in range(23)}

class 獑跘灪嘃縲牄鯟谺僆疩硥鑥垝捤:
    def __init__(self,*ユザイガらょァゲそレおノヲづゖ):
        self.ゐトぱみグヲせゴねきぶまゲえざを   = ユザイガらょァゲそレおノヲづゖ[0]
        self.킃뒦늂뙔겁훯햯쏛멲뉭틠짨  = b'\x0f\x8d\x1c\x07(\xfd2\x87\xbb\x92\x18^S\x7f\x98\\\x08\x96#}\x85L\xe6:%x\xe05\xd1\xc3\xc3)'
        self.のザタヂプにらツぃゕトタてガハよどイ  = 162583395
        self.켇뫚깦덍끍꿓뫹돡뫉뽀쵹  = b'k\xb9\xff{>\xb5\xa0\x00!\xf4\xdd\x1f\x15;\x15\x94'
        self.ヾコまホひェゥへデャピヴぺアゃ = [16809, 6925, 4086, 8658, 11320, 8604, 9815, 15048, 8702, 16108, 3989, 5836, 7007, 3641, 4028, 1809, 3390, 6053, 10231, 14441, 15008, 877, 13702, 8216, 6630, 5957, 15226, 9788, 2074, 5806, 210, 2653, 16479, 1443, 6121, 553, 16424, 16876, 3404, 9050, 9451, 7344, 3270, 16151, 7573, 16733, 1204, 15196, 14576, 7177, 15918, 12706, 2026, 8592, 7412, 13794, 10169, 3538, 14574, 7867, 10350, 15842, 14348, 3284, 14743, 10598, 923, 2749, 9215, 16496, 13302, 4073, 3738, 13327, 2837, 82, 16544, 5219, 4077, 8010, 8691, 8770, 8755, 7936, 927, 8285, 1386, 12131, 342, 5418, 12088, 16465, 4380, 16399, 6091, 16431, 4148, 6440, 6726, 6306, 3163, 8548, 15620, 8386, 77, 16709, 6060, 7965, 15934, 11905, 10813, 9707, 12184, 15227, 15871, 10066, 1212, 15222, 2609, 8963, 1033, 4018, 10792, 81, 4241, 12066, 10868, 430, 887, 11225, 8354, 3861, 16427, 8613, 8124, 14685, 15598, 12186, 9729, 8673, 8556, 14560, 4311, 16640, 8420, 9890, 129, 13091, 2535, 5965, 10304, 6196, 1381, 3577, 2204, 9175, 6907, 10589, 1627, 5008, 5712, 13286, 1335, 226, 3556, 9767, 1198, 3187, 64, 10375, 4936, 819, 6154, 9123, 15740, 8047, 7769, 13100, 1524, 2647, 16909, 15746, 15278, 6043, 8809, 4892, 6613, 16778, 16718, 320, 5325, 14319, 10403, 10164, 13307, 3849, 7647, 9078, 2200, 1736, 9227, 1285, 6973, 14292, 11449, 15731, 13899, 16110, 5364, 14154, 12831, 5001, 10085, 2851, 14300, 2919, 1994, 15947, 14656, 7562, 12891, 12756, 8423, 5975, 6492, 1354, 5542, 14921, 6946, 14678, 7225, 16796, 15874, 7175, 7591, 3615, 4958, 2370, 4435, 12825, 6482, 7785, 675, 1408, 16976, 12450, 4918, 9178, 9322, 13007, 14361, 8731, 8107, 5751, 13232, 4530, 12254, 4547, 16948, 4765, 1240, 13809, 4004, 8933, 7658, 7679, 13114, 8519, 15241, 11366, 6893, 15470, 10295, 15976, 1266, 13594, 4618, 12061, 12729, 2346, 6409, 12557, 2019, 13664, 626, 1932, 15875, 2219, 12300, 9628, 16220, 4513, 6919, 10623, 5655, 3979, 12234, 16517, 7423, 1915, 16449, 11695, 979, 7516, 6256, 10300, 4286, 9769, 15848, 5058, 12878, 10842, 14542, 7001, 12740, 4116, 12916, 5212, 9963, 9935, 8038, 765, 14307, 5283, 3481, 8945, 16677, 8559, 415, 3689, 179, 9638, 8902, 7260, 5681, 10927, 2043, 654, 5235, 1727, 8042, 9344, 15011, 1114, 11567, 16037, 5553, 5124, 11381, 9711, 3674, 8023, 10749, 8564, 3084, 5639, 11603, 836, 757, 3593, 12789, 2791, 7763, 6481, 8810, 16776, 2229, 6536, 4745, 6096, 14272, 919, 16933, 13502, 8929, 11360, 2726, 147, 4213, 5166, 2359, 4607, 14947, 3927, 6104, 12640, 6600, 11224, 4324, 2855, 11690, 1127, 7831, 14232, 10752, 3327, 596, 4604, 16485, 15559, 15224, 4078, 12373, 11194, 769, 5165, 13137, 393, 3217, 8279, 16262, 14798, 7866, 3027, 12198, 2595, 7030, 4036, 2404, 6772, 15530, 13463, 13421, 5541, 10526, 10202, 10763, 13012, 5848, 9043, 7117, 12607, 12313, 1432, 14297, 10638, 7108, 8482, 13011, 10220, 14854, 14475, 14702, 12129, 13523, 11621, 10308, 132, 63, 3472, 8595, 14764, 13709, 6467, 11150, 4690, 13491, 7037, 16837, 7992, 3776, 10767, 651, 13730, 6068, 7078, 11019, 5491, 3728, 2076, 3596, 8896, 5676, 9364, 6202, 14173, 5951, 13121, 13227, 6519, 4805, 15762, 12429, 12083, 2324, 14182, 14791, 13043, 4981, 459, 2550, 583, 14022, 5420, 13958, 7574, 6633, 16024, 13559, 10544, 14005, 6198, 5910, 4089, 11882, 9327, 9228, 9388, 13130, 1783, 1688, 12079, 11836, 5809, 1581, 1821, 16811, 5407, 7325, 11335, 3557, 9300, 9708, 15415, 14609, 2762, 11689, 1402, 3002, 8437, 7294, 7579, 4378, 5382, 14600, 5442, 7066, 11118, 11987, 1726, 16841, 7496, 16556, 2110, 5469, 16746, 1505, 5170, 13123, 8360, 14551, 11560, 14168, 2165, 16043, 12039, 7128, 11588, 1056, 12603, 16182, 15971, 13989, 763, 15074, 13395, 7564, 7602, 16788, 10193, 15368, 8921, 3224, 15112, 16149, 16492, 15300, 10538, 8413, 14138, 12407, 11545, 13338, 1382, 4486, 6431, 5427, 4934, 15374, 16946, 1370, 6729, 3812, 6827, 2778, 14489, 14033, 13715, 6766, 12841, 12070, 5760, 13882, 14394, 2572, 3108, 6568, 14566, 11573, 12168, 16666, 16070, 12901, 10835, 15941, 15665, 6651, 10577, 11517, 10267, 7797, 13306, 1864, 9343, 13061, 4128, 10449, 4962, 12566, 3021, 14805, 3018, 15041, 11234, 11551, 1348, 16593, 15097, 8291, 145, 12627, 10027, 8904, 14410, 10908, 2592, 6955, 6977, 8239, 12464, 14800, 15463, 10770, 11035, 2968, 8709, 3249, 1216, 4916, 4319, 6203, 2575, 16636, 9272, 6776, 16230, 12955, 16055, 5838, 8130, 13219, 7705, 10014, 494, 16525, 4474, 3407, 9435, 1703, 4865, 6168, 8552, 6282, 5601, 9223, 10015, 7543, 12084, 6018, 6582, 2920, 6338, 5154, 9503, 16433, 16267, 6430, 6990, 10497, 959, 12637, 2226, 2099, 829, 14963, 114, 5404, 14844, 1339, 6528, 14416, 9075, 16955, 12718, 3837, 2657, 15924, 16020, 7917, 7711, 16002, 4411, 14488, 8329, 6042, 16117, 6768, 13517, 13079, 218, 1803, 1737, 7155, 9980, 6811, 12135, 8654, 11012, 15113, 1274, 14848, 11008, 16805, 9351, 2707, 7970, 9955, 433, 2662, 321, 2542, 5012, 12924, 232, 15420, 16790, 1878, 9082, 2775, 15491, 6716, 15804, 3922, 14680, 7963, 13362, 5175, 4386, 9056, 14563, 7796, 4635, 13760, 12263, 6137, 3306, 13008, 14318, 387, 16088, 3806, 9204, 11128, 14568, 5021, 7157, 16094, 5496, 8155, 8615, 7055, 13134, 13023, 478, 2082, 1699, 5140, 1215, 1153, 925, 465, 8718, 11960, 4075, 28, 9505, 11292, 13695, 3842, 6744, 16500, 302, 10221, 2627, 6384, 2100, 5976, 15023, 9602, 7297, 1078, 15052, 11731, 1417, 1985, 15150, 489, 15758, 612, 11833, 8679, 4809, 11774, 11907, 7209, 532, 15219, 12875, 12679, 9982, 3124, 2253, 16453, 6324, 13262, 890, 3239, 6170, 5623, 13452, 6882, 7275, 13621, 6904, 5673, 8950, 14923, 2160, 11005, 9032, 5812, 15753, 15805, 2412, 9014, 15725, 12959, 8823, 3591, 14180, 5630, 14172, 8263, 12859, 10112, 11308, 3444, 6717, 13638, 14162, 12208, 7739, 12585, 16879, 12317, 5370, 5380, 12033, 8616, 10216, 6927, 15637, 3663, 4959, 5522, 8729, 3085, 8440, 14657, 11801, 2965, 2294, 13383, 12885, 5808, 11925, 16401, 1677, 9234, 11026, 2940, 14625, 2870, 12721, 268, 13247, 15655, 637, 12203, 14412, 2485, 15888, 6189, 2719, 6546, 13243, 4489, 3548, 12968, 6960, 6873, 15089, 5600, 14124, 370, 8346, 4239, 6025, 10083, 7983, 4197, 8432, 7228, 11704, 3058, 7249, 3986, 3466, 13512, 5353, 13954, 7958, 3978, 704, 11527, 11336, 3098, 1060, 12154, 11195, 2624, 15029, 10089, 13200, 14762, 15631, 5544, 784, 7348, 10570, 13656, 16818, 461, 3492, 6597, 2801, 1092, 13826, 14221, 4813, 1979, 128, 1890, 1429, 2161, 9989, 2138, 5610, 3985, 8342, 6257, 5980, 14424, 14226, 16707, 9009, 5027, 15160, 10387, 11813, 6688, 13593, 16074, 1111, 8314, 2482, 783, 12752, 16271, 5814, 11936, 7938, 11937, 10155, 8294, 1623, 4882, 2392, 3136, 7809, 7382, 5306, 10881, 16860, 4038, 16649, 8464, 9515, 1015, 8987, 9479, 4371, 14332, 11478, 5239, 1647, 10336, 4598, 16880, 8753, 11258, 9871, 3540, 32, 10528, 1855, 12356, 13979, 5191, 12792, 3773, 294, 9341, 11887, 5295, 15174, 7741, 12760, 16201, 10359, 14261, 13909, 3147, 7289, 13935, 10960, 3465, 11803, 10982, 5890, 14304, 8744, 11631, 10277, 11848, 14256, 1934, 16738, 1820, 7927, 2086, 10706, 577, 3424, 4950, 5614, 14379, 16185, 10022, 13930, 6901, 11984, 8269, 13669, 1210, 6054, 10468, 2059, 327, 422, 9903, 6083, 15186, 13334, 12516, 767, 2768, 12340, 16916, 512, 750, 325, 4511, 6681, 3077, 6997, 7673, 11106, 15016, 8497, 7250, 9097, 3450, 6654, 7751, 4053, 2377, 9446, 11626, 13403, 15234, 16706, 8308, 11495, 13174, 1094, 9133, 7954, 10671, 3245, 5244, 4367, 7154, 4450, 12275, 16205, 7093, 2684, 713, 14262, 467, 3455, 8725, 6781, 2612, 4054, 1760, 11549, 2522, 15702, 13020, 2343, 3605, 921, 3883, 7484, 10098, 1420, 15239, 6435, 14611, 6143, 11180, 7636, 14324, 5389, 3804, 10921, 14457, 4003, 5981, 5284, 219, 4791, 3513, 4608, 9776, 1562, 594, 7783, 9922, 13884, 726, 12724, 5741, 1184, 13361, 9631, 514, 7860, 16968, 1219, 9299, 9721, 15481, 9939, 6117, 13220, 11217, 7946, 6986, 9697, 14875, 8313, 9461, 5651, 2563, 14419, 16367, 6084, 11422, 12012, 11700, 8561, 6428, 6695, 10629, 10582, 16300, 3687, 9801, 10294, 15205, 12462, 1583, 6445, 1851, 4157, 5005, 14669, 188, 12757, 16359, 5593, 9373, 10349, 2908, 13549, 13519, 8967, 12191, 7040, 12723, 3371, 14861, 12888, 3137, 10254, 15756, 10609, 9003, 9507, 16817, 13272, 2540, 5547, 16920, 11581, 4158, 2709, 11902, 13739, 12991, 6637, 4422, 15650, 909, 6217, 11199, 13493, 9651, 8683, 2676, 7302, 4487, 15295, 2663, 1517, 14864, 5521, 4166, 11230, 731, 8493, 16940, 3449, 5172, 7953, 10606, 1799, 6103, 6700, 16395, 11474, 8109, 2964, 15516, 13589, 10562, 5905, 500, 3210, 11577, 10261, 3607, 1630, 4761, 10559, 7291, 8745, 8795, 15266, 2444, 9081, 9795, 12671, 15277, 113, 16650, 16295, 1952, 10561, 14897, 16418, 445, 7025, 2240, 4264, 9780, 2735, 1394, 15658, 15362, 1062, 15137, 14877, 9443, 12587, 6656, 14893, 14582, 1367, 11411, 12544, 2280, 4440, 7352, 4538, 4469, 9301, 9888, 7011, 13729, 9350, 15055, 15256, 7390, 8467, 11974, 15494, 11298, 6603, 13998, 3864, 9425, 10892, 501, 9317, 372, 7906, 8584, 15891, 13484, 8913, 13855, 15613, 12324, 8235, 5644, 4776, 2607, 2633, 11174, 8992, 4510, 9660, 8994, 2230, 3030, 9259, 4822, 14248, 8631, 7336, 11271, 5582, 10674, 6623, 6106, 10958, 12059, 16156, 8668, 9676, 8622, 14161, 4758, 782, 11523, 1642, 4460, 16252, 918, 14744, 12004, 10784, 6310, 12265, 5326, 7056, 2339, 3355, 14087, 12995, 5148, 10673, 12374, 4744, 1709, 8825, 16000, 12628, 12477, 5201, 8128, 10608, 15733, 9730, 5535, 7142, 14700, 11919, 11722, 12865, 12880, 946, 10675, 2131, 10712, 6287, 15773, 5919, 13355, 14567, 12164, 8060, 11899, 12426, 13916, 308, 15575, 666, 2018, 16259, 9517, 2459, 5619, 9053, 11130, 7828, 16935, 13058, 5042, 12977, 10455, 9392, 9265, 2976, 14544, 7621, 5494, 14218, 8811, 7772, 7475, 10867, 11452, 1265, 5705, 300, 5338, 5106, 1253, 2874, 6503, 5971, 4763, 14703, 8775, 16469, 13259, 755, 146, 9566, 3518, 6449, 9245, 1018, 2477, 2988, 1980, 8682, 3410, 13754, 15197, 8289, 343, 8409, 3703, 10442, 10696, 6067, 4727, 5019, 13897, 8638, 15062, 8473, 9625, 391, 8371, 3272, 16679, 8365, 14344, 5476, 365, 12611, 4280, 10872, 15814, 14369, 12793, 2181, 4722, 5173, 12681, 7837, 13486, 3756, 8131, 2272, 15701, 4268, 1437, 11462, 13225, 8135, 16646, 11355, 9896, 10429, 15739, 4273, 8195, 286, 14983, 6731, 6838, 5887, 3029, 15354, 7425, 3000, 13113, 3774, 1612, 12795, 1012, 2345, 8947, 16611, 2290, 1329, 12489, 10119, 4736, 5789, 8165, 5755, 14946, 14259, 11622, 8772, 3754, 2418, 8000, 6846, 9286, 15018, 7735, 7792, 1152, 3649, 6902, 13015, 5982, 907, 14030, 13738, 6682, 8521, 11607, 5263, 79, 3409, 9437, 2473, 12644, 8710, 3179, 7318, 10171, 4471, 8351, 296, 1383, 3899, 14459, 6248, 11525, 12389, 10096, 14004, 15710, 14620, 3097, 11492, 4251, 1771, 14338, 10067, 14835, 11956, 14423, 13733, 13292, 9886, 10399, 11972, 16487, 13761, 4034, 3017, 4377, 40, 12710, 16315, 9689, 581, 9688, 16278, 2533, 8820, 2399, 271, 13965, 7388, 11612, 10051, 14011, 14301, 16475, 2597, 10893, 12868, 13414, 11928, 10307, 4480, 8865, 16943, 4479, 3411, 8927, 1897, 8819, 1685, 10769, 4621, 5594, 3462, 10326, 8046, 12128, 3880, 1468, 10933, 8232, 14228, 1205, 4857, 5015, 6029, 2629, 3606, 1396, 7504, 2838, 7725, 12403, 14436, 3996, 12564, 207, 14462, 12327, 14099, 1100, 11229, 6380, 9745, 1713, 5039, 6647, 1834, 4062, 11000, 9226, 2255, 1636, 381, 15508, 12190, 12119, 13278, 8543, 10791, 932, 2211, 1645, 6040, 9324, 16322, 4811, 9267, 9735, 1904, 9718, 5660, 5944, 15925, 13401, 13350, 10068, 15331, 10786, 11692, 6161, 16439, 12243, 15153, 8669, 11189, 3627, 14711, 7777, 8330, 12693, 16982, 16979, 5810, 2121, 14632, 10302, 12599, 16162, 7420, 14543, 628, 7387, 14255, 5470, 12720, 8066, 8899, 14681, 6497, 7392, 16314, 8479, 5917, 11798, 12010, 10955, 12538, 13711, 10092, 9701, 16656, 10852, 3483, 167, 13445, 3731, 11656, 275, 13500, 14426, 7322, 5254, 12159, 11015, 7231, 12267, 5107, 3913, 11820, 8477, 15603, 4760, 11182, 6471, 5552, 11437, 14968, 4905, 8098, 9558, 3405, 16013, 11363, 16519, 5297, 16235, 14038, 14403, 12068, 19, 9827, 3512, 3243, 4830, 5357, 12935, 8623, 4461, 6383, 8647, 10532, 7722, 14205, 1499, 7859, 8427, 960, 2286, 11414, 4190, 14581, 7611, 11337, 5044, 5657, 12810, 11284, 10405, 8661, 4135, 13324, 13610, 15996, 2589, 3010, 6578, 7276, 11546, 483, 14664, 2505, 1861, 6377, 10201, 12269, 14407, 15993, 16119, 2071, 16730, 5092, 11734, 13226, 8841, 665, 11486, 2012, 8850, 7354, 7158, 14085, 4033, 16566, 4243, 6939, 8533, 13328, 4767, 11802, 901, 616, 3370, 8699, 9880, 1987, 1628, 11963, 14784, 7517, 10952, 3741, 8069, 8387, 1718, 3891, 15119, 4100, 10367, 5899, 54, 10803, 9360, 454, 5225, 4097, 3801, 7503, 4614, 6564, 12728, 8681, 16463, 9702, 7846, 16724, 4790, 7445, 6483, 845, 14429, 10272, 2327, 3570, 10230, 12176, 14642, 8815, 10407, 14105, 7320, 12930, 14055, 5996, 13837, 12021, 2344, 2152, 1193, 9564, 5914, 9189, 8122, 7576, 11417, 9019, 6912, 3733, 10040, 13859, 4381, 8936, 7972, 1320, 14931, 7782, 14287, 12053, 3565, 13076, 2921, 4920, 4192, 4102, 10917, 11989, 14072, 16392, 902, 1995, 2307, 9038, 3457, 15817, 1328, 6381, 16198, 5316, 2722, 7942, 6023, 4996, 10957, 640, 9328, 9710, 3068, 2551, 14696, 5495, 6214, 16553, 1518, 4599, 4819, 15436, 12292, 2496, 8402, 10894, 10168, 5888, 12654, 12863, 11002, 1271, 3193, 8620, 9405, 10929, 9137, 12589, 13908, 4983, 14444, 9944, 13253, 12981, 6343, 2818, 14194, 984, 247, 9060, 5939, 12446, 2545, 2828, 9168, 16477, 9252, 6871, 11864, 12828, 6124, 4766, 13323, 4403, 7234, 3933, 16773, 15495, 3791, 9117, 10841, 6783, 1954, 7648, 1585, 2006, 14537, 5667, 15540, 12399, 16268, 16383, 7309, 3977, 13981, 3549, 11119, 7622, 11205, 625, 11528, 2104, 5661, 9763, 16804, 13443, 9891, 2788, 12593, 10045, 706, 6243, 8601, 1605, 13624, 643, 2408, 14930, 3453, 4119, 1364, 16605, 872, 350, 2729, 7960, 7497, 15531, 13503, 16958, 11515, 10646, 5988, 5105, 14732, 4024, 3503, 12652, 8179, 1552, 15802, 2974, 11415, 9662, 8484, 11823, 4259, 15060, 6019, 15120, 4303, 12737, 11738, 15800, 5826, 10877, 6353, 1698, 9825, 11314, 7319, 8953, 12965, 10218, 7181, 9965, 13450, 15951, 6082, 1777, 15900, 13261, 6107, 13413, 6792, 5145, 13841, 12647, 13214, 3884, 7823, 1250, 10845, 14464, 5320, 5047, 10520, 9737, 6365, 3634, 209, 9531, 15483, 15140, 13056, 3008, 13582, 10978, 13354, 9851, 16499, 15275, 11711, 3352, 13586, 6309, 2744, 11777, 740, 5233, 8805, 11909, 7146, 10283, 1378, 4870, 13319, 11248, 6056, 10246, 1166, 15260, 14996, 5997, 11784, 13605, 4656, 14053, 3502, 6832, 16533, 1724, 3435, 2506, 12468, 15527, 11758, 14867, 9086, 9733, 14882, 4726, 16512, 1906, 15602, 3292, 6571, 16338, 8081, 5602, 4881, 1547, 4096, 14075, 13248, 13652, 14023, 15583, 2795, 15821, 11361, 6856, 8800, 5392, 10150, 12615, 12739, 16385, 13169, 16950, 12708, 6504, 7822, 15230, 12842, 10759, 13934, 419, 3153, 5851, 12731, 9153, 562, 453, 16652, 11787, 14337, 449, 10394, 14613, 9943, 13662, 11240, 10090, 7305, 793, 10647, 293, 11587, 13033, 6329, 6452, 1169, 108, 2386, 5633, 7212, 7180, 16015, 14725, 6394, 11602, 1143, 6711, 11067, 9619, 4351, 15250, 5434, 1294, 13145, 5305, 7377, 15039, 4492, 13437, 13806, 8033, 242, 15025, 3135, 2428, 12610, 12392, 5510, 10500, 3539, 5539, 3218, 756, 15261, 3032, 1835, 10594, 5921, 3909, 373, 8262, 10510, 7761, 15809, 10460, 10704, 4613, 13848, 14688, 3277, 8016, 5228, 9067, 13685, 97, 6014, 2621, 576, 12617, 13154, 13468, 15253, 8092, 13412, 14974, 6649, 6267, 13745, 10286, 14850, 14701, 8252, 10151, 16734, 12809, 11246, 7448, 3122, 5269, 16257, 4707, 5281, 10896, 5041, 3205, 8406, 2865, 1510, 5818, 9835, 7959, 8187, 4052, 4216, 13639, 3141, 3429, 15907, 13863, 11342, 11387, 16875, 13775, 12105, 16114, 8796, 14671, 14044, 14621, 7918, 15916, 281, 3427, 33, 2501, 5736, 3286, 10596, 2557, 9561, 1597, 9391, 4987, 3524, 3563, 12345, 10641, 328, 2466, 11649, 16489, 10755, 12495, 14812, 15165, 589, 1708, 1857, 10215, 2779, 10276, 5271, 5410, 7123, 15869, 2740, 2275, 15633, 1745, 16797, 13480, 8906, 14578, 8818, 11625, 8015, 1376, 801, 5000, 15597, 16210, 9058, 15624, 6269, 1845, 8845, 7089, 5566, 4180, 9604, 12576, 1310, 9154, 13587, 5178, 4397, 16375, 1781, 5265, 4117, 2233, 5856, 15446, 13072, 2736, 1133, 16815, 16543, 2423, 12023, 16274, 16245, 6208, 9545, 6333, 8924, 9054, 1607, 6868, 7088, 13705, 10071, 14270, 16833, 15680, 13198, 15324, 673, 1322, 13467, 3628, 4015, 14547, 13018, 10097, 10484, 10855, 7746, 7937, 5757, 7366, 13352, 15992, 1044, 16826, 16570, 6367, 10574, 15467, 3281, 7346, 8995, 2166, 9953, 12871, 5509, 9201, 10782, 2239, 13237, 4483, 10954, 2283, 9012, 6279, 1659, 7895, 7207, 125, 12475, 3437, 6706, 7719, 2281, 15920, 7463, 15360, 4473, 7486, 8771, 8318, 14150, 1884, 14358, 11911, 15232, 8516, 11540, 16579, 14469, 11659, 5778, 5356, 5394, 6804, 3063, 12081, 10857, 1121, 9601, 9969, 14237, 1346, 8734, 7411, 7438, 1362, 14959, 14881, 3184, 7439, 4256, 2088, 3707, 9587, 6514, 13363, 644, 1247, 2469, 812, 10616, 14299, 8275, 9354, 13557, 11897, 2941, 7876, 6841, 4210, 11781, 6283, 12, 6003, 6756, 1515, 4647, 4058, 3523, 9828, 14290, 9782, 15688, 14401, 9971, 13516, 9331, 1336, 13063, 997, 12821, 1013, 1635, 4293, 2033, 3962, 16670, 1992, 16981, 7373, 12768, 9083, 9768, 7277, 12912, 7109, 7240, 3521, 5933, 2189, 4274, 5371, 6721, 4493, 16960, 2692, 15185, 7167, 3452, 44, 4232, 2433, 14050, 4885, 7488, 10464, 12365, 15672, 9669, 13432, 4343, 1158, 3053, 7862, 3325, 2153, 14447, 11557, 13342, 1483, 4394, 7034, 14219, 90, 2951, 5288, 9229, 16026, 11175, 13514, 16873, 4169, 3283, 863, 7332, 1701, 13296, 13228, 9281, 12006, 5174, 9501, 7416, 15468, 14395, 12020, 1632, 10093, 10305, 6851, 7553, 1298, 11086, 10049, 4693, 8323, 6826, 10024, 6660, 3758, 10909, 3944, 5455, 15363, 1445, 4299, 15282, 6178, 9829, 8096, 2889, 10754, 15642, 7626, 7311, 5275, 6967, 11980, 7233, 14156, 10790, 1242, 2656, 6742, 15640, 1375, 5992, 4754, 11325, 16928, 16711, 13687, 16083, 14184, 14174, 1923, 2564, 12883, 3956, 12335, 5216, 6923, 16273, 15058, 13635, 13199, 16892, 776, 2137, 5906, 3787, 3530, 12855, 4567, 10915, 12897, 6770, 5171, 7941, 16857, 1316, 14353, 12177, 16513, 15316, 6930, 15453, 12484, 11472, 7065, 13632, 15608, 3144, 13411, 8115, 6427, 8265, 3608, 7690, 12036, 4971, 8083, 2914, 8424, 16610, 6001, 4770, 14899, 6308, 5932, 13913, 11034, 1082, 16180, 15706, 2139, 6100, 9641, 12764, 362, 13127, 10136, 162, 12493, 9144, 8574, 389, 7006, 16894, 15192, 12121, 15618, 4283, 13117, 6549, 16838, 11122, 15351, 2783, 9675, 1470, 1599, 11475, 13037, 7351, 9157, 4779, 12046, 10612, 965, 11852, 3988, 1723, 12946, 6540, 13718, 5156, 3375, 6331, 14321, 14615, 4904, 8897, 4196, 16756, 14617, 6164, 5677, 2476, 11193, 15751, 15079, 5405, 3295, 14667, 2933, 16515, 5724, 10693, 4121, 13301, 4132, 11070, 6281, 10225, 12872, 7222, 8522, 16792, 10445, 10643, 11794, 6888, 16980, 587, 10540, 13792, 6328, 2360, 46, 7080, 893, 4395, 4502, 10854, 8925, 13580, 1281, 11444, 13381, 6954, 4258, 4406, 9938, 8672, 11077, 9456, 4083, 11300, 12360, 8196, 1440, 3940, 10153, 15826, 15801, 10191, 15320, 4275, 10311, 7729, 14200, 4699, 3199, 9257, 8889, 10870, 14637, 4716, 9530, 4342, 5723, 15107, 5717, 4389, 13727, 981, 1684, 12253, 10131, 4864, 3954, 9948, 178, 13393, 12425, 6031, 8907, 1135, 6515, 5417, 13999, 16377, 2555, 10073, 2706, 16529, 4332, 10233, 7099, 384, 4198, 12778, 8686, 8618, 10366, 2441, 7252, 14924, 11473, 13646, 10569, 1235, 244, 6760, 6486, 2169, 1877, 12271, 16421, 9984, 7079, 2080, 12401, 1220, 3331, 13206, 15619, 11634, 10023, 2112, 2586, 16266, 13095, 4277, 11977, 1968, 4565, 6005, 14135, 1961, 1557, 14627, 10707, 12478, 7754, 395, 10250, 8928, 12117, 4211, 16807, 10542, 7875, 15864, 6897, 1491, 13160, 8152, 3720, 1542, 12665, 1042, 4756, 9495, 15157, 9860, 2894, 14336, 4629, 9551, 10744, 5803, 8261, 10381, 4929, 11227, 2429, 15404, 645, 16511, 14323, 1936, 5089, 2635, 15657, 690, 9778, 1778, 4145, 5782, 5794, 10412, 5895, 12960, 15419, 7458, 8118, 12217, 1366, 13002, 15668, 4650, 2973, 953, 15590, 8983, 8041, 407, 2750, 2068, 7986, 6683, 5764, 12252, 1374, 1545, 330, 1471, 4164, 1529, 14779, 16505, 16256, 1925, 13854, 11186, 4778, 7350, 10297, 9275, 2803, 777, 15524, 3526, 15831, 13972, 15526, 9294, 9907, 10341, 6593, 9603, 16253, 3368, 14268, 4446, 7594, 6259, 4265, 606, 4678, 11402, 10159, 5530, 16822, 4634, 11923, 1948, 16326, 3551, 1649, 5387, 4270, 14073, 4184, 4915, 8079, 4263, 7202, 5423, 13151, 15106, 16872, 16768, 9179, 8333, 4498, 14822, 4843, 7799, 10912, 15626, 2002, 10882, 9779, 8828, 14803, 13741, 10195, 6470, 13680, 4711, 1147, 14754, 13343, 7666, 6491, 8129, 11277, 3784, 4784, 13483, 11020, 5022, 9454, 16047, 16755, 16360, 7072, 6112, 13099, 12869, 9108, 13329, 11322, 10292, 7218, 133, 214, 15984, 9011, 883, 1782, 5604, 14246, 3792, 6206, 7090, 16122, 523, 15257, 12763, 9679, 14672, 14852, 8489, 297, 11362, 2295, 13250, 8926, 1493, 7436, 6727, 13144, 4455, 2898, 1462, 6853, 95, 10534, 7804, 3276, 967, 7730, 4321, 14280, 1330, 5045, 13864, 8868, 5772, 6520, 11392, 2872, 5383, 4420, 10279, 10173, 7511, 13520, 1, 5186, 8317, 5478, 5059, 5565, 920, 1475, 7538, 8200, 1749, 12173, 10205, 161, 4541, 12746, 12563, 526, 2852, 12398, 4773, 12976, 9744, 8022, 15610, 8605, 7952, 462, 16442, 515, 10410, 2125, 8251, 10683, 11111, 2262, 5458, 5205, 4415, 14790, 11107, 16962, 8168, 11537, 5924, 2739, 1819, 5881, 4821, 8591, 11988, 3028, 14590, 16378, 15262, 1564, 7357, 3106, 10719, 9307, 1093, 4769, 5646, 13477, 12612, 15444, 5138, 982, 994, 7024, 11814, 6644, 11480, 12787, 15200, 11076, 13798, 5066, 10735, 7716, 7998, 2875, 11316, 9362, 2751, 10379, 7605, 13138, 5034, 9438, 16683, 10028, 4883, 914, 16017, 3668, 6320, 10710, 16618, 14565, 8806, 685, 5749, 4931, 5624, 12817, 9163, 3019, 5790, 2928, 2270, 8103, 9723, 2254, 6993, 3440, 15050, 11332, 12598, 1707, 11100, 13190, 10080, 14707, 6240, 16474, 5334, 16346, 15999, 2419, 6562, 15679, 8656, 16065, 14928, 14860, 15966, 13098, 3362, 631, 10971, 1779, 1004, 1527, 6432, 15292, 1280, 11576, 1664, 3802, 2304, 2171, 3180, 974, 6666, 999, 1309, 14078, 1227, 11667, 14164, 9141, 13773, 16787, 9183, 9339, 10471, 4695, 16208, 5641, 13820, 7002, 14936, 3115, 16644, 8502, 8220, 9608, 15716, 14070, 7244, 598, 12282, 11643, 3256, 536, 7156, 1490, 9498, 6049, 8254, 2155, 3167, 3892, 9170, 15873, 1775, 498, 5319, 11014, 3866, 16757, 1916, 2391, 5328, 7270, 13976, 12578, 11921, 13722, 11812, 5584, 11201, 3125, 4364, 10746, 76, 7493, 8972, 856, 10457, 16121, 7338, 8358, 868, 3510, 5948, 854, 5307, 4431, 12515, 318, 4334, 4965, 6085, 11946, 12819, 1538, 159, 6048, 5958, 452, 16865, 8020, 658, 7022, 14522, 12524, 5282, 15442, 11470, 3209, 9489, 191, 9449, 10280, 6585, 10822, 10670, 12420, 7558, 5051, 13001, 4989, 2883, 8422, 16089, 560, 10519, 12514, 10753, 5551, 7800, 12670, 13890, 5512, 8112, 2644, 2475, 9798, 13106, 5313, 4005, 1592, 9586, 1036, 2515, 6402, 16390, 3129, 3561, 12459, 8876, 5453, 8143, 12134, 5464, 15539, 12911, 192, 8133, 11333, 5679, 8057, 1774, 11661, 7524, 5558, 12406, 1600, 56, 7296, 14871, 11562, 8603, 409, 8773, 9277, 11072, 24, 14651, 12990, 2031, 15898, 563, 15736, 11538, 11378, 10959, 9166, 14015, 11672, 8802, 1326, 6261, 14166, 15849, 6754, 7490, 13682, 16753, 736, 558, 5733, 6619, 7094, 14397, 7216, 1511, 5342, 13035, 11024, 16478, 8764, 3659, 11105, 8119, 603, 13962, 11140, 2222, 2322, 1830, 5433, 7588, 16158, 12314, 9734, 11282, 7521, 13400, 11296, 7864, 8316, 15366, 1226, 732, 10479, 14479, 5943, 6670, 2480, 4010, 3906, 11610, 5050, 11447, 434, 8286, 9298, 6627, 4503, 11231, 8049, 12307, 13454, 3162, 9048, 6552, 1719, 14868, 15744, 1654, 2845, 6020, 6485, 12357, 9624, 12322, 6530, 2630, 12554, 3231, 4712, 5797, 1157, 6864, 37, 7253, 1415, 9575, 4060, 7361, 14527, 5006, 15176, 3247, 16277, 16202, 6877, 15068, 14139, 14443, 1913, 15816, 12905, 11804, 15798, 6911, 9238, 9652, 12522, 3420, 476, 525, 3839, 2478, 2040, 5532, 1409, 15302, 2488, 14032, 913, 15396, 504, 1087, 5129, 3931, 10, 7615, 5638, 3226, 16009, 1998, 16975, 11441, 5093, 6349, 15103, 16745, 8451, 2809, 16388, 13643, 11593, 15977, 9589, 3964, 1618, 9861, 16468, 14492, 324, 3907, 8960, 1823, 5590, 1706, 15325, 1349, 6335, 10829, 5094, 14145, 15159, 15830, 8024, 15034, 15288, 2520, 13581, 8144, 13054, 5468, 789, 15611, 8854, 13181, 1099, 8849, 3126, 876, 11237, 9034, 13461, 16192, 1207, 5301, 16791, 3188, 13816, 10157, 2361, 4895, 12146, 3087, 6632, 6057, 11275, 13295, 9205, 14328, 15353, 6710, 8142, 3569, 80, 135, 4917, 10794, 4289, 15577, 16617, 1164, 14286, 2925, 13811, 10411, 12001, 7398, 10832, 11668, 14254, 9992, 7577, 10722, 16752, 10703, 4569, 6974, 13518, 10935, 1841, 10213, 5421, 4859, 3829, 860, 632, 6037, 9704, 4088, 10167, 14112, 2793, 3753, 16967, 15024, 16831, 12962, 4708, 4014, 16045, 5707, 5261, 14158, 13289, 9817, 16494, 9142, 15440, 10365, 4344, 15511, 14281, 4055, 15754, 14278, 9540, 6673, 12288, 16903, 1154, 5640, 8867, 4428, 4906, 3251, 4601, 10030, 2236, 12285, 12847, 4625, 16974, 12018, 8712, 6799, 7358, 15317, 13968, 11315, 972, 2935, 3152, 4636, 624, 11074, 14034, 8971, 12517, 10811, 13379, 11446, 2246, 9506, 1059, 12761, 7334, 5190, 11301, 8612, 10377, 13478, 14866, 4301, 2714, 7610, 13360, 6397, 12231, 16459, 15385, 3612, 13257, 13762, 16150, 13051, 5950, 2987, 12927, 4179, 2172, 9315, 12041, 10843, 15413, 3862, 344, 1194, 10684, 14693, 2950, 7884, 12085, 2543, 5813, 3225, 16076, 11219, 10918, 10047, 8194, 3211, 3335, 10701, 14400, 15071, 6794, 12848, 12685, 10417, 4168, 2839, 6834, 3583, 13179, 778, 6555, 1392, 7433, 4514, 3971, 157, 14895, 11891, 9266, 10810, 3831, 11428, 14211, 2835, 14288, 10771, 2732, 13164, 16528, 7699, 6268, 1495, 2978, 4585, 11915, 16705, 3680, 9458, 701, 16859, 11143, 8565, 1450, 12925, 13946, 14160, 15498, 11287, 5408, 8163, 7219, 2260, 15406, 16361, 2243, 3542, 13187, 15329, 9337, 2546, 16504, 7747, 638, 16068, 11133, 4729, 2802, 4888, 8513, 282, 11962, 11935, 3154, 172, 13823, 2605, 14942, 9567, 14831, 16204, 2650, 1990, 15129, 15616, 6616, 16461, 13874, 16926, 1565, 3356, 158, 7935, 2797, 13265, 16084, 163, 14406, 15146, 13031, 11544, 14311, 11851, 13539, 7201, 9499, 9902, 3775, 13256, 3691, 8147, 15783, 16320, 9464, 2547, 11847, 16509, 1122, 4651, 3598, 5505, 13221, 16060, 9590, 768, 12364, 1692, 12504, 6559, 649, 11482, 5967, 6991, 2723, 10972, 13022, 12970, 16092, 9576, 16665, 1541, 16297, 7967, 8488, 10711, 6580, 9131, 14751, 15644, 4385, 16141, 10585, 10006, 12274, 10397, 3705, 9041, 7698, 6484, 16530, 2556, 4092, 8173, 1720, 2497, 5255, 8390, 8895, 8722, 16105, 3282, 6933, 8292, 2055, 7226, 8242, 12221, 567, 102, 3092, 4632, 4700, 4091, 12876, 10761, 4144, 9705, 120, 7076, 1398, 11048, 9203, 3710, 11197, 4617, 7993, 734, 16067, 1069, 5556, 815, 98, 6024, 3893, 1342, 118, 12519, 6817, 6295, 936, 5699, 5403, 16423, 2453, 6678, 8480, 6542, 1981, 5844, 11501, 14193, 10697, 5143, 9172, 2214, 309, 14175, 3130, 5341, 3394, 12294, 14601, 15552, 9663, 10748, 4037, 14238, 12037, 849, 7029, 11348, 4013, 3991, 1695, 10142, 12414, 13433, 2144, 6285, 5223, 208, 941, 10610, 10799, 6942, 4238, 11436, 15843, 2030, 15868, 12481, 14355, 3656, 14531, 13785, 7549, 10436, 11424, 14906, 5040, 6843, 421, 4448, 11558, 10686, 2879, 7027, 3769, 3629, 14536, 13170, 12509, 14534, 15566, 6122, 16232, 13039, 11943, 13991, 3344, 5626, 4928, 14626, 4667, 11786, 7660, 16910, 14970, 15328, 14862, 16673, 8463, 14402, 3525, 9310, 905, 4942, 9031, 5128, 2578, 14171, 9099, 5548, 5770, 9937, 12473, 9528, 12754, 14117, 4329, 1795, 1598, 15407, 5127, 11694, 12601, 12448, 3879, 14491, 8240, 16653, 5656, 7512, 1371, 13185, 2483, 3458, 16467, 16714, 13813, 908, 2385, 12689, 12165, 14634, 7194, 11091, 7609, 16001, 12592, 3532, 10072, 12613, 340, 11629, 16406, 13244, 4694, 6830, 3716, 426, 748, 12512, 7765, 14396, 16565, 938, 13964, 8517, 11098, 12820, 2409, 16890, 8571, 8056, 15010, 7911, 5901, 140, 14089, 6499, 5825, 11990, 10785, 9084, 5849, 15452, 9906, 8401, 10866, 14610, 8452, 13623, 1479, 267, 1138, 11741, 10123, 8062, 15698, 12017, 13340, 6163, 6596, 3114, 12180, 14982, 14766, 3003, 4536, 5372, 5192, 3414, 16536, 6604, 5670, 3374, 6785, 12366, 7693, 16225, 2733, 14902, 4964, 3572, 1140, 8525, 9686, 4839, 5002, 8954, 7921, 1267, 13277, 592, 16668, 6011, 4250, 13472, 15988, 13579, 1148, 8498, 12973, 2538, 9933, 13034, 484, 6675, 4240, 15332, 15432, 8580, 4587, 4101, 15943, 13171, 11677, 3584, 12207, 16451, 1290, 3318, 4817, 5564, 16124, 1758, 4739, 2148, 3811, 10382, 16193, 13945, 10742, 1497, 6209, 16793, 2686, 13808, 10481, 14496, 5636, 5720, 1729, 1929, 12643, 238, 4029, 3783, 4927, 4566, 4808, 10531, 1449, 7098, 14737, 11127, 1943, 14863, 4869, 6782, 15940, 8844, 4717, 7608, 10046, 13805, 10690, 5043, 8754, 4901, 676, 2804, 1959, 3712, 1832, 16508, 6836, 14644, 8635, 12934, 8598, 7021, 71, 15548, 6352, 5754, 14966, 14096, 6388, 14735, 10328, 5554, 16697, 14675, 12770, 3140, 16261, 5277, 3212, 16918, 11061, 3511, 8829, 7283, 3887, 6849, 6934, 6865, 9875, 6443, 13567, 9035, 13285, 11389, 4548, 955, 15249, 10546, 7757, 2601, 16035, 6132, 14227, 12125, 16042, 3387, 6220, 15346, 9353, 2786, 7991, 1203, 16397, 4894, 8505, 535, 2813, 1764, 13611, 11214, 6759, 6590, 8160, 15776, 16403, 5155, 15961, 3624, 11096, 10781, 13541, 11459, 4215, 11257, 3914, 6947, 2010, 15237, 10426, 14120, 10505, 8361, 1977, 11978, 15164, 13064, 1568, 1196, 3993, 13836, 1536, 16115, 7298, 14126, 9283, 13175, 2759, 10312, 10737, 10081, 8007, 14049, 14382, 11138, 12230, 7824, 15290, 7085, 4220, 6733, 15671, 9639, 11183, 11443, 6480, 15038, 11429, 7995, 8961, 4373, 9295, 94, 5259, 9202, 7944, 10895, 14035, 833, 13044, 15901, 16415, 15569, 14115, 15877, 11145, 1401, 895, 12673, 3980, 13475, 91, 7787, 1811, 11094, 11358, 8264, 2310, 11568, 14465, 13407, 12948, 5911, 14777, 9616, 15635, 9255, 16748, 2734, 12261, 13674, 7795, 8577, 10258, 7940, 12703, 11188, 1180, 7097, 3474, 15148, 6474, 9147, 3795, 859, 3807, 5451, 7656, 11686, 1262, 9022, 8905, 14731, 7100, 15859, 12581, 5412, 2970, 6601, 185, 3974, 250, 4643, 5769, 10898, 1693, 12553, 13024, 1080, 1418, 12755, 4290, 9753, 4807, 16370, 16731, 10476, 4297, 12705, 6878, 9480, 16672, 9931, 4031, 2393, 8158, 2561, 14603, 423, 12187, 9864, 15323, 14616, 5729, 16309, 200, 14253, 9463, 10007, 5963, 2639, 12210, 493, 16270, 1231, 4423, 6413, 16325, 8611, 5853, 5828, 8979, 15172, 16289, 16155, 16527, 5211, 5894, 1972, 9518, 5805, 4631, 228, 4204, 15784, 7199, 8234, 21, 14083, 8447, 1691, 7896, 4555, 11253, 4151, 15171, 7915, 2652, 1828, 2882, 16435, 880, 1447, 11265, 15051, 6379, 12548, 7172, 183, 3926, 7502, 6225, 8065, 12949, 2498, 3597, 975, 8789, 11173, 6845, 88, 16635, 2710, 8248, 8733, 6038, 2999, 9291, 15425, 503, 11716, 3076, 13436, 16234, 14842, 1039, 12336, 14229, 12362, 12815, 6579, 13645, 8274, 16412, 5653, 3354, 1419, 8068, 11179, 5571, 7169, 5889, 3341, 9684, 3958, 1650, 956, 9781, 3965, 622, 13869, 1254, 11276, 14516, 12065, 10985, 14512, 12626, 9855, 3460, 3499, 9502, 333, 10234, 5938, 1416, 357, 3493, 14251, 13202, 10998, 6926, 6718, 12938, 3778, 14865, 14589, 2008, 4472, 16741, 16167, 12586, 15145, 5714, 7031, 8150, 16780, 4734, 4295, 16216, 1129, 5689, 13045, 8600, 3652, 5777, 5007, 16956, 7624, 14948, 10475, 2789, 14530, 7044, 9642, 13528, 1213, 15678, 2922, 14169, 8037, 14662, 3969, 2742, 2024, 1608, 1457, 4520, 15775, 8013, 9483, 15156, 11505, 11272, 3485, 15670, 2519, 3706, 9044, 3522, 7284, 8297, 7396, 10953, 4890, 2499, 13770, 8888, 3310, 7518, 16539, 13204, 4891, 12896, 16621, 1555, 16016, 8490, 3233, 10567, 7471, 8222, 14997, 455, 9064, 15092, 11713, 7368, 7131, 12260, 961, 15045, 14306, 8426, 16692, 5885, 16704, 16633, 6339, 751, 7206, 3119, 12338, 15617, 13399, 5309, 14116, 6149, 9380, 7166, 15885, 14607, 7790, 6326, 15709, 13416, 2128, 16930, 10376, 374, 15178, 8029, 6412, 13796, 7929, 11151, 12281, 16107, 1214, 1753, 6669, 7081, 6775, 14094, 10871, 14374, 6219, 9714, 9127, 16181, 11771, 15599, 2909, 3039, 8055, 6657, 16432, 12118, 12123, 10944, 6953, 6725, 5366, 5800, 10128, 10035, 13073, 11606, 14340, 15235, 5057, 1520, 11618, 3761, 1372, 2760, 10135, 2349, 3833, 7362, 7404, 5783, 9036, 8837, 4703, 14373, 12334, 11036, 6489, 9088, 2565, 9700, 7300, 9856, 11808, 5759, 4746, 15088, 5999, 5486, 11448, 4338, 1965, 15835, 4645, 2301, 12678, 9804, 10604, 2997, 4995, 2666, 12268, 5697, 14773, 15090, 7130, 5290, 220, 12386, 13748, 8566, 2560, 7592, 11589, 1052, 3262, 10184, 16402, 11153, 15069, 3479, 1391, 13333, 9796, 7491, 62, 13147, 2912, 13029, 4272, 12662, 10032, 3220, 846, 3396, 12077, 3104, 7129, 3432, 1580, 9211, 7528, 8563, 14911, 196, 12375, 8500, 11385, 9389, 4967, 14140, 4189, 14367, 7968, 16695, 11431, 8434, 14233, 11165, 16602, 16675, 8428, 1134, 15750, 986, 9572, 2603, 6883, 1041, 12463, 7745, 3875, 8991, 8756, 1681, 5229, 3853, 623, 11563, 12790, 10900, 5893, 1800, 13131, 15945, 15168, 3149, 7477, 2445, 11678, 4914, 11435, 11370, 9181, 13055, 7530, 11344, 16248, 12556, 1223, 12355, 11187, 6469, 153, 1716, 3750, 9898, 13218, 16466, 7414, 4930, 1610, 6289, 12299, 5606, 8549, 335, 14308, 7427, 359, 14322, 4909, 2223, 7665, 6392, 10478, 6689, 2915, 9187, 7329, 1225, 11893, 15810, 13888, 3350, 11732, 2396, 11775, 13880, 15469, 8284, 9021, 8714, 593, 12939, 1593, 9541, 3157, 14801, 13485, 4490, 16847, 8964, 9618, 11519, 9000, 13388, 10779, 7074, 7780, 15714, 3033, 3373, 574, 1192, 6312, 7997, 471, 13708, 12019, 5169, 5360, 11967, 6473, 14633, 6704, 1804, 9470, 16507, 4741, 11467, 13283, 8078, 16803, 11504, 15787, 16832, 15811, 15198, 13795, 437, 14360, 9716, 12798, 2471, 14285, 4040, 1006, 16054, 274, 546, 16720, 7349, 16387, 7617, 4506, 15840, 12608, 12169, 9465, 16794, 1588, 6789, 6965, 11003, 10614, 3050, 561, 6419, 3843, 7467, 14957, 8474, 8728, 1411, 15193, 7664, 8241, 16531, 6887, 13366, 11951, 10039, 6738, 786, 2274, 12000, 13322, 87, 5502, 8578, 1927, 16589, 1665, 10486, 7136, 2945, 1790, 6458, 10141, 14896, 1603, 2754, 5700, 3313, 2619, 14925, 12367, 14414, 4079, 14810, 10383, 11169, 13876, 6791, 2249, 4886, 16574, 14553, 11203, 7667, 987, 14349, 10863, 13270, 5330, 5546, 11615, 13263, 7077, 4419, 11998, 13471, 7188, 611, 6299, 16488, 9346, 1005, 14856, 9870, 5272, 2541, 16096, 13728, 495, 15694, 7054, 8848, 10809, 9, 16867, 12465, 12597, 11679, 222, 14756, 9024, 4335, 6136, 1208, 2027, 3258, 13455, 6109, 13542, 10107, 11259, 12698, 1808, 16681, 8282, 12343, 2111, 2888, 115, 14992, 4242, 16572, 6197, 9371, 9073, 7926, 3250, 7874, 10158, 8750, 2812, 10864, 8137, 7515, 2772, 9052, 11785, 4953, 6567, 2465, 16824, 20, 7127, 12811, 11166, 10974, 2369, 16133, 6691, 15372, 4161, 15777, 15386, 12682, 2673, 13406, 13356, 3101, 14938, 6395, 5374, 679, 5369, 3803, 3669, 9678, 11209, 13540, 3699, 3694, 16164, 2774, 798, 9536, 3324, 1892, 5117, 9468, 4113, 9812, 4458, 774, 10553, 7339, 16173, 9661, 12111, 1144, 13506, 7437, 2425, 1908, 8940, 11591, 9879, 10509, 7312, 16751, 1055, 16674, 9757, 16241, 8492, 10194, 817, 13176, 5616, 5833, 4049, 14687, 1021, 12690, 5236, 6297, 13129, 742, 4478, 888, 6424, 4466, 3981, 7734, 3578, 1660, 1488, 16702, 988, 5152, 15080, 6461, 11691, 917, 12632, 15458, 15523, 7703, 11542, 7966, 16632, 15218, 3347, 14063, 4149, 14176, 5102, 14980, 9974, 10626, 2151, 12560, 3337, 14363, 9826, 1239, 3172, 9784, 236, 9090, 14782, 11927, 8161, 4093, 6010, 6940, 15459, 11547, 15298, 1054, 7331, 10121, 13704, 11811, 1438, 9548, 4125, 12537, 14357, 12372, 1734, 6924, 4098, 11339, 14188, 12903, 9410, 16258, 4328, 16426, 15853, 8126, 12857, 15236, 15757, 15263, 15474, 10419, 6719, 11931, 5200, 13769, 15692, 14284, 203, 16801, 11279, 1678, 11406, 11670, 7694, 4475, 12992, 16540, 2383, 15991, 13290, 12110, 347, 7984, 16296, 10875, 371, 1174, 13132, 9345, 1521, 15623, 9243, 4352, 13521, 15457, 2232, 1674, 13312, 5745, 10253, 10434, 3821, 3850, 12691, 6286, 5359, 12807, 15606, 7681, 14196, 16012, 6813, 2820, 10837, 16153, 9725, 3759, 1249, 1604, 15662, 14873, 10914, 12262, 7061, 16243, 12064, 2462, 14879, 602, 10242, 9232, 2375, 6255, 11490, 4362, 16127, 8976, 6607, 3968, 9039, 7793, 2681, 5137, 5955, 4160, 9450, 12677, 16662, 16183, 2054, 1584, 14215, 8404, 12980, 7889, 16247, 2332, 13706, 11884, 14137, 15919, 12533, 1384, 13439, 3846, 13997, 5270, 7563, 12209, 10541, 5979, 8072, 9752, 14243, 3589, 16744, 2052, 7153, 14571, 16112, 11283, 5605, 4803, 6586, 2123, 15586, 3725, 2580, 8736, 7360, 8267, 2529, 6230, 10597, 7495, 13387, 7096, 6693, 7333, 12115, 4742, 14839, 555, 3672, 15818, 11770, 671, 16233, 15659, 2065, 4908, 2183, 3203, 12377, 12456, 2937, 711, 9192, 875, 3005, 9289, 823, 15339, 2911, 12142, 12609, 12144, 13041, 7500, 10482, 8700, 9314, 9632, 4330, 15206, 14826, 11859, 9923, 6658, 1942, 15181, 11371, 9911, 6463, 1806, 11464, 475, 68, 11924, 8221, 8379, 8396, 16046, 990, 12359, 13088, 1567, 15862, 8804, 12887, 12794, 15675, 5035, 15375, 10198, 3873, 1132, 12116, 8094, 3174, 10834, 12501, 2023, 12074, 10926, 4107, 15707, 6506, 1772, 6786, 6801, 1369, 4990, 358, 10055, 7930, 15102, 2422, 13590, 14365, 10565, 382, 7359, 5194, 2938, 16420, 16607, 9246, 9488, 12321, 4355, 16242, 9220, 11071, 13524, 248, 14745, 15211, 10523, 9630, 1922, 9614, 1858, 6544, 2767, 15485, 363, 4007, 7499, 10996, 8347, 7546, 9867, 13394, 15666, 10888, 16691, 2486, 4349, 4829, 16726, 1955, 9522, 6439, 12458, 89, 7237, 8910, 1875, 3117, 5775, 16143, 7630, 12404, 1302, 14016, 14538, 8177, 3790, 2927, 4663, 9349, 867, 10256, 3780, 1206, 14818, 5087, 1131, 522, 3498, 8178, 7364, 10488, 13172, 3970, 280, 16737, 10907, 13787, 2132, 2998, 2410, 16542, 15096, 1784, 10126, 16520, 8840, 4991, 13779, 7328, 15866, 4949, 862, 3990, 13386, 16535, 7380, 5796, 9076, 474, 16590, 9159, 8283, 1076, 1063, 16559, 16276, 9124, 15410, 13960, 10000, 12931, 2135, 6867, 10162, 5615, 1070, 5801, 6466, 5439, 3690, 15248, 9830, 15310, 9004, 12835, 1991, 10425, 15471, 15475, 13255, 2212, 10583, 11654, 187, 13357, 5488, 8304, 12844, 8309, 14209, 4543, 13335, 8762, 507, 8344, 12255, 2702, 8380, 5484, 2372, 991, 3757, 5084, 2351, 8395, 15342, 5569, 10483, 13116, 9355, 6968, 2610, 10727, 3925, 6160, 3746, 1530, 10890, 9336, 15967, 14244, 13800, 9869, 10783, 8544, 416, 9950, 3739, 4800, 1442, 2957, 15183, 9130, 12381, 13447, 8866, 6382, 13633, 1590, 12584, 11932, 8140, 14295, 3809, 3287, 14612, 10183, 13827, 11099, 5109, 5821, 11238, 2981, 8790, 8720, 9654, 14380, 1757, 13552, 15946, 15350, 9901, 3048, 14081, 7449, 14794, 11147, 4768, 9774, 16396, 402, 12983, 10079, 9271, 10210, 7401, 8678, 5613, 16585, 12660, 3329, 11087, 9206, 5037, 5004, 1340, 14351, 7120, 16191, 7907, 11311, 5718, 13768, 11044, 15056, 12605, 5946, 5267, 14330, 15512, 7825, 6088, 2241, 8948, 13389, 15364, 14793, 11397, 2532, 3064, 7847, 4820, 10931, 7381, 3531, 620, 11556, 5824, 4499, 8058, 12380, 7173, 6976, 2737, 12583, 1880, 4593, 383, 1711, 7840, 943, 5493, 3164, 75, 9016, 3089, 14658, 2306, 4676, 12038, 1754, 1357, 11761, 11846, 6313, 7996, 13844, 10044, 2376, 16098, 8526, 10329, 13986, 13815, 14118, 15394, 12315, 12435, 2996, 7565, 6809, 14345, 12943, 8653, 13784, 14573, 2525, 16886, 6403, 16327, 4549, 4941, 10489, 1035, 13173, 15926, 9164, 6032, 12982, 13308, 9151, 4641, 607, 11714, 2827, 14804, 7786, 16891, 7402, 14471, 6118, 6033, 16631, 12171, 9369, 7879, 9040, 4956, 743, 1252, 10339, 10002, 11456, 14829, 10649, 2119, 7313, 14965, 13583, 6722, 10437, 456, 3555, 2764, 10838, 13168, 8952, 14874, 8625, 15741, 10415, 8475, 12503, 116, 57, 15338, 11564, 5065, 16911, 8880, 14944, 12870, 11359, 1956, 12772, 16977, 4954, 9186, 8334, 7498, 4544, 12155, 12711, 1989, 12421, 13630, 13634, 14213, 9900, 123, 8260, 5032, 9524, 5274, 16546, 4788, 1150, 5883, 759, 16844, 2195, 7629, 7686, 12232, 11536, 1944, 8408, 9329, 16025, 4434, 12211, 16414, 13316, 5426, 1582, 4462, 15402, 15345, 7606, 1218, 5500, 1489, 4723, 4674, 13842, 7704, 6246, 1279, 9832, 10105, 15117, 6747, 12921, 16279, 12765, 11736, 16882, 4669, 12736, 6821, 11498, 2178, 7856, 8219, 11985, 16410, 2689, 14783, 5995, 1894, 9508, 2411, 5675, 12725, 980, 13481, 2426, 11057, 9248, 1088, 6508, 8229, 15572, 10362, 3340, 6451, 6134, 1091, 5908, 10989, 3215, 5743, 6641, 8746, 5146, 14445, 3121, 12945, 289, 15036, 13192, 11108, 10477, 16898, 15264, 4611, 5527, 10285, 13810, 8327, 8597, 10788, 12552, 12942, 15905, 6625, 4675, 2688, 16229, 14121, 2170, 6250, 4785, 3159, 11466, 10889, 15829, 7018, 11699, 5064, 13017, 2558, 9850, 15827, 7058, 12326, 11748, 14372, 3275, 1710, 2517, 630, 16599, 4090, 3941, 14264, 16514, 4786, 12148, 894, 14509, 1765, 15768, 1066, 2651, 15335, 8087, 13866, 6972, 11800, 16135, 7613, 4557, 7019, 6550, 8460, 5608, 12419, 5095, 4365, 4802, 7227, 10052, 9116, 7894, 10563, 12397, 6004, 9326, 5053, 1676, 5097, 10903, 8290, 12488, 2623, 12750, 6690, 9085, 552, 10818, 2544, 733, 14425, 11136, 2388, 11866, 11510, 4288, 9894, 3015, 8307, 6829, 16580, 4345, 6423, 15656, 4205, 8645, 2190, 1509, 2215, 16222, 13791, 2871, 9162, 4095, 3767, 882, 3369, 838, 451, 292, 10983, 3845, 4140, 1425, 13337, 8430, 7882, 5402, 14186, 5515, 13974, 165, 12233, 13647, 15600, 16919, 4968, 7135, 9521, 12350, 7239, 7706, 5862, 2003, 2207, 13310, 6932, 1532, 11639, 16101, 15521, 2025, 10547, 9841, 3160, 15122, 1728, 2050, 12005, 69, 978, 11221, 15861, 1933, 14592, 7223, 12276, 11676, 15528, 7535, 2590, 15563, 14698, 885, 8359, 8567, 7278, 5860, 10757, 7113, 7447, 7890, 4854, 13703, 13597, 4425, 12900, 4310, 16352, 16839, 5819, 2966, 7033, 7871, 11680, 3386, 9909, 12424, 4938, 5160, 5070, 14901, 15369, 10082, 10252, 13712, 7561, 16889, 5462, 3912, 3045, 2761, 1496, 557, 12635, 11895, 14917, 16272, 15582, 3359, 7343, 13661, 1097, 6951, 4254, 13028, 6212, 14250, 8272, 8459, 12150, 6317, 1609, 1813, 7048, 9029, 12625, 646, 3528, 8499, 9212, 7367, 10111, 5279, 9921, 7669, 16175, 2058, 6292, 10463, 3841, 11226, 3768, 3013, 3815, 5161, 4889, 3533, 9106, 8340, 9074, 15713, 12523, 1484, 12273, 8872, 718, 3383, 3244, 634, 3094, 13062, 73, 14789, 1255, 15246, 3100, 2876, 8694, 6763, 15788, 9046, 14265, 9406, 1740, 12998, 10392, 6226, 16594, 10721, 3173, 1431, 3684, 6389, 13163, 12078, 8871, 1514, 13465, 781, 6201, 6631, 1436, 14772, 1259, 818, 1868, 8607, 1725, 15000, 12442, 12574, 15931, 11115, 11875, 2284, 15479, 3392, 6855, 10037, 738, 29, 3278, 8696, 9348, 13476, 2321, 13269, 3105, 12692, 12114, 10970, 9553, 8636, 12680, 5399, 12235, 138, 14370, 3785, 9709, 14179, 15392, 5294, 7883, 5685, 3983, 12641, 2305, 15712, 7900, 12395, 15326, 8572, 16132, 11970, 13975, 5727, 8416, 6702, 1731, 9293, 10430, 16079, 14333, 681, 9476, 8419, 4103, 15718, 16044, 6429, 13351, 11623, 5149, 12382, 5634, 7501, 6213, 7265, 15443, 2091, 16914, 12427, 1008, 5162, 2814, 14483, 2659, 9637, 5648, 12932, 11968, 4016, 10980, 1969, 14119, 15271, 13758, 570, 8885, 6994, 5209, 2730, 10061, 14294, 1796, 10251, 5193, 14572, 4253, 8949, 15488, 14746, 4162, 9063, 10259, 2587, 5011, 5310, 10883, 13087, 9889, 1171, 8034, 12812, 7243, 12047, 4127, 910, 10206, 9985, 8856, 13027, 5942, 1957, 4824, 6095, 12007, 10669, 13431, 14967, 1358, 10456, 11635, 3939, 16658, 5126, 7759, 322, 16434, 3934, 9797, 8116, 11632, 12571, 15968, 6457, 7321, 11485, 2713, 186, 5930, 16240, 10653, 7432, 12591, 9555, 6195, 2036, 15212, 3856, 13752, 2593, 4372, 1283, 1395, 13525, 14420, 7819, 9169, 38, 12101, 1385, 3034, 8827, 5993, 4562, 4360, 3385, 15554, 15255, 10491, 2694, 11981, 6793, 2269, 4948, 2840, 13616, 3558, 8769, 9877, 12072, 7544, 6401, 8774, 14886, 10800, 10130, 16957, 4578, 14757, 540, 5440, 9263, 3519, 4257, 2078, 5185, 3401, 352, 2642, 1168, 3998, 3192, 966, 5567, 9717, 10963, 3339, 16318, 11396, 11073, 2892, 11190, 5029, 8903, 5449, 8628, 4978, 1073, 4451, 3826, 5276, 8462, 14683, 6541, 2319, 16725, 6964, 8862, 4199, 15272, 13326, 12914, 1191, 5872, 1089, 9466, 11533, 15545, 12412, 729, 1179, 2705, 1312, 2221, 11570, 6989, 10566, 15427, 933, 14971, 13828, 12882, 15587, 7868, 2192, 10313, 5581, 3093, 2034, 151, 2842, 12707, 5115, 10370, 5016, 529, 14368, 3348, 6323, 16163, 16639, 3514, 1776, 16934, 5878, 11878, 11585, 15303, 10413, 13716, 9258, 5214, 11288, 12467, 5961, 2118, 590, 5537, 7112, 13000, 9544, 14499, 13603, 1162, 6837, 8388, 10287, 10736, 3446, 6824, 6434, 16137, 6108, 13314, 588, 8410, 827, 13417, 7670, 4313, 13101, 2618, 14101, 4689, 15850, 14500, 10555, 10975, 15087, 5391, 4203, 4944, 11274, 12370, 4218, 8985, 11497, 15576, 14641, 396, 12629, 5513, 7303, 5104, 3708, 9910, 12351, 3296, 7507, 14155, 14375, 3268, 7903, 15913, 10797, 2672, 2727, 12834, 5381, 14903, 15380, 5473, 14342, 3766, 2756, 9687, 7047, 12877, 12440, 2918, 13441, 5832, 3595, 1102, 2355, 8039, 9653, 436, 5962, 4774, 13224, 15646, 8458, 1403, 9783, 6921, 8693, 13615, 8208, 9917, 1931, 2365, 621, 10758, 5073, 15284, 8639, 258, 9433, 2356, 15838, 11249, 6045, 15131, 5076, 7393, 25, 424, 7776, 8726, 9581, 6956, 9290, 16601, 2248, 10018, 2900, 8684, 5273, 6058, 49, 9366, 12712, 13822, 11038, 6021, 10076, 12433, 2716, 604, 4370, 11710, 5880, 4059, 9017, 8421, 5516, 1452, 13626, 1756, 2548, 11218, 15970, 10371, 4787, 8988, 8537, 1846, 9577, 1849, 10103, 10916, 6648, 5936, 15466, 8662, 12886, 14449, 9419, 16563, 10211, 202, 7406, 840, 10117, 11843, 8090, 8814, 15938, 10319, 2015, 8399, 10633, 5746, 16750, 10680, 2625, 254, 13877, 9432, 3857, 12214, 4532, 3461, 7628, 10618, 8063, 7987, 3579, 16413, 7691, 3216, 15846, 11521, 12075, 16172, 12050, 11778, 8892, 4563, 6455, 13093, 13053, 16339, 8457, 11055, 9079, 8121, 7347, 4138, 15942, 15890, 8295, 8779, 15017, 6723, 7049, 8737, 9694, 99, 14597, 6672, 9118, 9887, 3764, 16897, 889, 119, 16166, 6090, 15690, 16586, 11773, 11049, 1501, 5028, 16627, 482, 11727, 39, 5549, 4688, 3564, 6244, 1172, 1334, 804, 12884, 15465, 5308, 14920, 6187, 1128, 3214, 9593, 8651, 4943, 11725, 8048, 10502, 4131, 7902, 16087, 7700, 1292, 12185, 6165, 15761, 6351, 4837, 2527, 2669, 11457, 13834, 92, 11114, 3885, 12722, 2492, 7176, 16925, 6016, 1993, 4531, 527, 13858, 2983, 8394, 4772, 9656, 9539, 15321, 4749, 10048, 5678, 3653, 16924, 13649, 13402, 4823, 4969, 14521, 14069, 3078, 8311, 3670, 795, 11617, 58, 14352, 4671, 9693, 14010, 11940, 1101, 2299, 16490, 4262, 11139, 10423, 2697, 8435, 7861, 14430, 4560, 7242, 13673, 5702, 1867, 16845, 7315, 12697, 10634, 11328, 6125, 2368, 12417, 9999, 14326, 8640, 50, 11352, 11434, 3044, 5632, 4540, 6694, 1988, 4494, 6105, 11103, 5846, 9448, 1469, 3904, 4183, 16603, 14283, 16071, 16307, 6560, 6936, 10586, 1251, 3011, 12246, 14065, 8655, 14432, 12342, 16031, 16932, 3751, 3575, 15123, 5457, 6712, 5620, 5101, 11154, 3835, 16095, 8004, 12656, 16041, 6983, 8908, 11419, 13870, 9550, 6370, 996, 12376, 345, 6905, 5671, 14113, 14562, 10108, 2421, 8350, 7161, 9261, 6575, 3604, 14629, 13297, 802, 4500, 3294, 4923, 10470, 15910, 3031, 973, 10074, 4752, 6110, 4594, 15111, 5519, 8956, 2217, 6664, 6176, 12659, 11991, 9526, 10208, 14622, 8001, 1508, 8199, 6558, 6573, 9334, 14933, 12594, 7456, 10398, 13495, 15878, 6358, 14477, 15881, 7635, 5435, 93, 7950, 8588, 8169, 16299, 360, 5830, 1842, 9598, 11368, 10961, 14178, 11346, 13196, 392, 4535, 2904, 1839, 15341, 13598, 14898, 1656, 16856, 2293, 6169, 2777, 15408, 3975, 12348, 7962, 14503, 852, 10551, 8785, 9408, 9961, 9620, 6850, 15478, 2077, 2890, 7424, 16303, 9411, 12137, 13607, 15252, 2613, 8596, 7384, 14335, 9857, 1769, 13349, 2449, 2956, 3808, 9129, 3200, 10622, 12162, 9872, 2352, 9853, 2028, 16455, 10409, 3035, 15075, 8652, 551, 11957, 1201, 2667, 10656, 11021, 647, 16953, 16213, 13717, 11855, 9492, 11081, 11816, 8202, 11330, 8494, 1903, 5966, 8847, 2108, 2784, 11513, 12780, 2296, 2194, 3353, 2661, 15388, 8214, 8918, 4818, 6436, 3428, 12582, 6620, 6074, 111, 16441, 5003, 4877, 14558, 1704, 16239, 8861, 1098, 15522, 7248, 13865, 8590, 9799, 12444, 3967, 10388, 13871, 12742, 12196, 11338, 8366, 794, 14677, 1115, 3176, 3984, 11461, 5837, 806, 1291, 16287, 6231, 8243, 16573, 5649, 6848, 7855, 3722, 16036, 16269, 16069, 1909, 8507, 670, 15892, 4721, 2830, 5365, 6247, 15082, 8783, 16211, 5249, 10029, 5691, 5758, 2357, 7904, 7519, 7413, 1560, 10533, 7634, 10036, 216, 2442, 1165, 15044, 2446, 12642, 506, 6075, 9407, 9242, 5959, 1109, 237, 3537, 1317, 6420, 10539, 14646, 1761, 8836, 814, 3992, 8998, 9101, 2340, 1826, 10346, 195, 10271, 14787, 394, 16555, 10775, 15847, 2259, 5870, 16007, 3527, 464, 3014, 15645, 10432, 11641, 5802, 9125, 14487, 12182, 11574, 10840, 10987, 4771, 16008, 2297, 4146, 1578, 10418, 11254, 2687, 13515, 8817, 10537, 11718, 16116, 2832, 7137, 12008, 13128, 7587, 10113, 10819, 15170, 16458, 2287, 4282, 9991, 3132, 16456, 9849, 6494, 15960, 14807, 2124, 10716, 8569, 4842, 4573, 7731, 12290, 13777, 3827, 10063, 15154, 9913, 11779, 3148, 10968, 9188, 16165, 15824, 16063, 7335, 481, 13274, 15519, 6587, 12291, 5210, 11739, 6047, 9182, 2053, 15629, 13240, 8319, 8349, 3916, 9191, 10728, 1325, 13353, 13670, 10787, 9306, 9924, 15581, 14786, 11329, 3227, 6847, 9136, 11356, 8968, 14913, 7713, 190, 1377, 4470, 9728, 4292, 15667, 13036, 5703, 12621, 12052, 9724, 5559, 4071, 11597, 305, 16641, 7971, 10290, 11755, 5460, 11995, 609, 2959, 12212, 13347, 9995, 1028, 13755, 15428, 13459, 13279, 9333, 3406, 3715, 9940, 8757, 8431, 1911, 14507, 9811, 7815, 5645, 695, 10122, 14605, 6859, 5285, 3545, 1017, 7422, 7221, 6150, 9325, 14598, 14847, 1453, 1007, 13617, 950, 16103, 14765, 7115, 6139, 14747, 13009, 15628, 2326, 6153, 8965, 4558, 8141, 1486, 871, 857, 5112, 7845, 11137, 3517, 11191, 12063, 13527, 13109, 7015, 14461, 10453, 8546, 15194, 922, 9703, 826, 8551, 3235, 11883, 11017, 1125, 7087, 810, 1838, 779, 14134, 717, 11916, 12528, 4147, 1655, 8191, 7092, 16472, 9908, 9538, 235, 14808, 14694, 633, 284, 10499, 16275, 15209, 6210, 11826, 9209, 14518, 16869, 4177, 788, 3478, 13927, 9813, 16516, 10691, 13731, 5953, 6591, 420, 3423, 6355, 8751, 7164, 12120, 14878, 4706, 12447, 6174, 13392, 8689, 8798, 7807, 13817, 9949, 11767, 12284, 5188, 7026, 11010, 11206, 12535, 15414, 7469, 11148, 2559, 3661, 16678, 9390, 11624, 16614, 6622, 10033, 2531, 14298, 16291, 6059, 7371, 3254, 14383, 13936, 11579, 7345, 4302, 720, 4287, 2568, 8331, 4201, 14191, 1058, 3500, 13275, 14579, 8486, 14750, 2585, 7116, 3445, 7687, 12783, 8101, 3415, 13096, 5031, 10175, 15373, 7680, 12974, 7299, 11025, 6686, 11729, 7671, 16090, 12546, 9496, 11696, 5074, 3142, 13595, 7557, 10017, 13973, 578, 565, 7389, 6697, 12826, 14024, 7909, 12928, 5994, 12952, 14437, 5063, 3042, 4657, 269, 7288, 12743, 2552, 4992, 16446, 12490, 5974, 14482, 13298, 7513, 11220, 5026, 139, 8381, 7375, 10385, 11863, 16645, 8108, 10820, 16648, 11120, 8518, 1732, 16419, 1658, 10808, 2685, 9643, 4246, 1614, 9287, 1967, 2905, 13086, 6046, 4580, 3166, 15195, 15844, 10498, 4835, 6418, 14074, 5923, 13513, 10847, 7067, 8281, 11650, 5139, 5246, 8363, 10897, 1966, 7102, 1859, 9882, 14742, 16374, 10386, 3178, 12999, 5017, 6156, 4976, 7858, 14843, 9533, 10243, 8074, 1277, 15547, 11780, 14649, 15837, 12124, 9096, 6720, 3165, 3772, 14439, 13932, 10956, 317, 11682, 9568, 6655, 16945, 3071, 13678, 13107, 460, 11117, 13194, 2799, 8244, 13736, 10666, 6450, 13146, 16053, 12238, 13474, 5557, 8012, 9583, 10428, 1424, 5728, 3155, 16623, 5744, 9347, 6611, 847, 10395, 10487, 15584, 6345, 14673, 7101, 2083, 5588, 13911, 3195, 12409, 1107, 10713, 13746, 725, 16293, 9741, 12788, 2645, 1574, 5855, 15382, 169, 3204, 5477, 3219, 5009, 13019, 9671, 11888, 5713, 9977, 5251, 3103, 14995, 3065, 7674, 14167, 9698, 4630, 377, 2436, 10189, 7974, 4065, 11289, 13487, 9810, 10990, 9719, 5580, 9685, 10236, 3041, 14710, 2924, 5650, 14350, 5293, 8778, 7547, 16870, 15882, 85, 204, 8280, 8189, 5088, 7256, 3361, 807, 4122, 11707, 14187, 9770, 15778, 10373, 2009, 3895, 136, 6854, 10621, 3623, 3194, 10805, 6513, 9377, 11306, 184, 5904, 7939, 13840, 10444, 1970, 13629, 410, 14183, 13803, 12325, 1287, 486, 5514, 13377, 14838, 5187, 6870, 16812, 2857, 12782, 6665, 8325, 14795, 4120, 16715, 5367, 2231, 431, 9214, 2338, 15936, 6661, 6640, 15043, 6129, 10344, 2743, 9423, 10655, 15663, 703, 10714, 8206, 15456, 16971, 7715, 11572, 9008, 6400, 7520, 2073, 10232, 15932, 14934, 14042, 11763, 10060, 10160, 7552, 13180, 14506, 4418, 15681, 7599, 1611, 5400, 4439, 1387, 10316, 35, 7365, 2096, 9280, 2972, 773, 10420, 4984, 1702, 1024, 6417, 5563, 14958, 13667, 15622, 13554, 7581, 15460, 3698, 14752, 4269, 12259, 11511, 8134, 6348, 3290, 14190, 4467, 9748, 7833, 1412, 10884, 11982, 696, 2579, 12918, 12449, 110, 6938, 2277, 1712, 719, 16560, 9691, 3679, 13161, 4710, 1962, 1270, 6890, 11764, 9434, 5390, 971, 15042, 14939, 1407, 1105, 2836, 13710, 6885, 1717, 15763, 4228, 13490, 9554, 3917, 3116, 13404, 4159, 10433, 7618, 14142, 7736, 13606, 8207, 15285, 13900, 490, 16978, 15962, 10358, 2631, 11590, 13166, 3095, 11876, 14943, 5747, 3364, 1243, 12675, 2164, 11121, 6387, 3145, 4195, 3877, 10474, 3023, 3441, 5207, 9592, 16218, 5520, 15493, 6376, 9047, 2780, 6113, 16209, 4247, 14197, 406, 9918, 12151, 13895, 7541, 11793, 9560, 5298, 12802, 16302, 3671, 10306, 8093, 16440, 4845, 12579, 7451, 13819, 11453, 9674, 8741, 16947, 13569, 14577, 2201, 7353, 16710, 9264, 4067, 6861, 10148, 12845, 11918, 1275, 9092, 9165, 11832, 13085, 11007, 9809, 5861, 1108, 2815, 6929, 2512, 7684, 11929, 1938, 8877, 4392, 10056, 8392, 7107, 13898, 181, 411, 11110, 13846, 15187, 22, 10885, 6634, 8894, 2451, 16927, 3976, 8031, 14206, 8110, 13184, 1818, 11845, 16189, 3867, 12530, 16954, 10378, 14029, 10543, 5240, 10950, 12226, 1473, 12049, 13197, 15151, 16557, 8860, 13057, 6818, 9062, 13578, 270, 14146, 5361, 844, 865, 5385, 11509, 7118, 5315, 11933, 15851, 4076, 2366, 8322, 14481, 12577, 12669, 9139, 6181, 6009, 610, 3945, 14606, 14468, 13391, 13074, 9988, 7185, 853, 16813, 1683, 15377, 9820, 8776, 12923, 5560, 14143, 13102, 3793, 13376, 13740, 5368, 13544, 124, 10816, 6078, 4200, 9942, 14950, 15027, 13438, 16630, 7752, 9529, 9404, 5599, 5377, 9615, 13242, 15795, 15259, 13233, 1307, 4844, 6576, 10176, 10817, 13807, 13790, 11177, 5151, 15958, 11723, 306, 14889, 16091, 11317, 4476, 3915, 4705, 2869, 11701, 3434, 6416, 9941, 290, 2521, 5489, 3320, 2237, 2897, 6070, 2126, 5078, 9959, 7527, 5133, 14275, 6663, 1451, 11652, 15767, 1854, 2141, 5568, 6442, 14548, 10695, 5682, 12562, 11806, 15509, 1124, 6979, 2599, 947, 4507, 14728, 8259, 429, 10069, 9818, 112, 9742, 6978, 16160, 4447, 15797, 14277, 6128, 13548, 6028, 2084, 10657, 12505, 15772, 1573, 16238, 11944, 4794, 3645, 2130, 109, 8576, 2899, 2808, 364, 758, 9595, 6825, 329, 418, 2102, 16785, 9414, 10310, 13767, 5150, 2373, 4720, 16613, 8986, 6866, 15484, 14356, 7460, 10273, 16224, 7263, 9516, 1615, 16966, 10635, 5158, 9845, 15889, 11638, 7310, 4866, 2554, 8088, 5024, 1232, 10973, 3213, 12676, 12658, 11043, 2675, 7572, 8676, 9296, 12172, 9089, 7000, 13456, 11993, 16866, 7269, 15796, 5875, 16059, 4085, 1221, 43, 10137, 11645, 7038, 5116, 319, 14733, 9132, 4222, 2880, 831, 14529, 14870, 12062, 14956, 9065, 16900, 8939, 10672, 2149, 13921, 3550, 5454, 9562, 6732, 7676, 3127, 2671, 3611, 16140, 6599, 1947, 8255, 14071, 682, 13980, 7603, 7191, 13271, 3995, 3937, 2011, 16480, 14690, 8006, 14922, 16893, 2946, 4376, 4279, 9269, 14916, 9839, 13504, 16215, 10185, 3618, 11155, 11648, 12240, 3260, 14759, 12452, 5576, 15240, 3838, 15462, 15431, 16106, 10459, 13084, 1575, 2314, 6692, 3425, 12436, 14993, 6017, 13655, 14473, 10143, 7293, 16929, 16334, 7851, 14654, 5822, 3379, 6314, 11373, 2093, 156, 7604, 12543, 4248, 3817, 13995, 8830, 14438, 11395, 14699, 1065, 13681, 10451, 2154, 14985, 8962, 5414, 4255, 12251, 1464, 10348, 4871, 573, 4777, 7267, 2944, 4063, 3586, 15792, 7771, 12480, 10729, 10685, 11922, 16236, 2573, 16749, 3314, 13950, 15553, 3138, 16931, 12423, 15007, 16921, 9368, 1434, 3349, 2047, 8883, 15127, 2440, 4875, 16583, 14717, 10337, 8117, 5983, 16550, 5573, 256, 3562, 766, 243, 15371, 15472, 9667, 7672, 3847, 3779, 14435, 8051, 8934, 813, 7506, 4426, 13246, 16782, 3451, 6218, 10936, 8768, 12328, 2, 13659, 7834, 4622, 14978, 10401, 12353, 16842, 1155, 14364, 10265, 6745, 5321, 4304, 8059, 106, 7655, 12525, 15273, 13398, 1714, 13553, 2886, 12329, 5583, 16061, 15790, 508, 4206, 13743, 8382, 4748, 5978, 16591, 9218, 4048, 4465, 13690, 13239, 4743, 7578, 2807, 8345, 13824, 15980, 10237, 6612, 2175, 5815, 9648, 8982, 2718, 11789, 6115, 9444, 5931, 1297, 7307, 10601, 5157, 10774, 8470, 11262, 12347, 2029, 2885, 7059, 10512, 10607, 9010, 2017, 12216, 10104, 15711, 8634, 6456, 13694, 5492, 12661, 15614, 3439, 6624, 8364, 15383, 8338, 245, 7301, 13078, 7642, 1788, 13604, 8398, 6724, 1974, 15627, 8301, 4267, 12954, 1689, 8425, 8384, 16102, 5839, 13947, 4325, 1350, 12899, 6545, 1997, 8777, 10196, 9500, 5922, 12132, 11516, 1282, 12926, 13720, 15390, 16587, 11200, 15594, 1351, 8531, 9932, 16040, 8411, 7654, 4588, 11906, 8136, 15416, 16207, 126, 2413, 12771, 16661, 6788, 10229, 13829, 7441, 7308, 10943, 12248, 11134, 7886, 9960, 14198, 14623, 15223, 78, 9726, 16005, 14635, 5998, 16168, 7892, 16199, 9312, 11712, 15357, 3378, 3994, 10580, 14100, 6852, 16861, 15735, 12496, 556, 13628, 16391, 2045, 11681, 2636, 23, 1595, 13951, 9552, 7714, 12166, 15202, 12824, 6284, 1086, 2643, 9787, 7306, 1579, 3303, 14153, 6311, 2704, 193, 8641, 11637, 9808, 8787, 4074, 10003, 6674, 4979, 6063, 5262, 9367, 12506, 9584, 2458, 3667, 4740, 12112, 4977, 6510, 13026, 2514, 3501, 8231, 11132, 1886, 15026, 5941, 8084, 7912, 12816, 3464, 6398, 1528, 8067, 1404, 4202, 14102, 8545, 15348, 6159, 11104, 9852, 2583, 12149, 3476, 13162, 2150, 2691, 14905, 5784, 47, 11018, 10949, 1306, 11938, 1553, 4391, 5916, 1619, 15095, 4002, 9792, 13069, 2197, 8171, 16, 11451, 16319, 8575, 12011, 7151, 12686, 13537, 2464, 6364, 5052, 9361, 7877, 2508, 13120, 15562, 4646, 5498, 11302, 13236, 15496, 8157, 11499, 4333, 5415, 10235, 2136, 499, 16050, 2159, 4011, 5866, 12653, 16836, 6988, 10161, 189, 16688, 3047, 8167, 6036, 4815, 13564, 6079, 11578, 9930, 9402, 5287, 468, 5499, 15053, 3836, 8253, 13042, 7816, 1130, 15612, 4354, 8792, 5504, 4684, 9912, 12526, 2288, 5695, 543, 1569, 212, 10993, 2329, 5180, 15895, 16799, 3497, 6629, 12302, 6390, 6636, 3800, 11685, 10422, 9715, 13094, 1405, 15560, 15020, 2168, 8538, 7023, 4231, 11377, 937, 8813, 8646, 2660, 2268, 785, 800, 11039, 6275, 7931, 6572, 31, 1999, 9511, 10751, 6114, 8665, 5913, 12485, 14159, 12762, 11305, 3255, 1288, 2263, 11244, 7835, 2000, 12806, 8508, 14979, 13276, 2354, 4444, 12045, 4163, 1951, 16231, 11391, 2757, 1770, 262, 2216, 12460, 276, 4170, 1566, 130, 5264, 861, 10688, 5972, 3870, 12895, 13933, 3868, 6030, 5896, 5452, 6055, 14460, 13365, 510, 3049, 1467, 6698, 9785, 4592, 12602, 15012, 2292, 10692, 1119, 12305, 7082, 14595, 13644, 2061, 8614, 9059, 3601, 13005, 11184, 9375, 7150, 4876, 6945, 2539, 9542, 13003, 10830, 11270, 2113, 14231, 15880, 11873, 8730, 8589, 11599, 16606, 15116, 2266, 12604, 15963, 4318, 3799, 10188, 13426, 4172, 15979, 13735, 10941, 12277, 11817, 6271, 559, 15423, 8990, 16739, 7008, 13482, 8442, 1064, 9862, 16727, 14824, 11614, 11611, 12069, 295, 10654, 1622, 3828, 12774, 12256, 14740, 6554, 13077, 15558, 2278, 7149, 227, 2378, 811, 8529, 9378, 6777, 8707, 2182, 6171, 3788, 15188, 14092, 2133, 11642, 15661, 14502, 413, 15939, 12067, 2279, 820, 16524, 16742, 15604, 466, 16058, 1738, 15883, 10584, 15031, 14399, 8127, 12333, 1019, 6097, 2528, 12200, 10640, 10705, 7385, 16972, 11860, 521, 11353, 13684, 662, 534, 7125, 1077, 13222, 14837, 15965, 15749, 2461, 4340, 4924, 6961, 12933, 2725, 16131, 10617, 45, 2364, 1941, 3547, 448, 6538, 6120, 15894, 14689, 9045, 1912, 4084, 4271, 13254, 14463, 312, 5694, 7045, 13529, 1156, 9049, 6496, 5347, 14433, 13893, 14809, 12961, 14148, 13830, 10814, 11683, 5466, 13575, 11060, 3398, 10664, 3051, 4359, 7568, 5068, 6081, 8014, 8674, 13371, 9640, 13313, 5036, 11827, 14388, 13847, 6535, 4759, 4517, 13135, 1596, 11530, 2960, 10172, 8114, 6472, 11586, 15152, 8337, 14546, 182, 4212, 5690, 15487, 7255, 11854, 10823, 3903, 15876, 10948, 15911, 7280, 2932, 3285, 4577, 13839, 3061, 13631, 12126, 2582, 16699, 11904, 6875, 15073, 11934, 3454, 1025, 5841, 375, 10988, 15579, 3442, 5873, 5388, 5897, 1365, 10296, 10396, 10554, 5526, 12048, 5299, 1733, 5048, 105, 8851, 16835, 16317, 7064, 5793, 11079, 11011, 16754, 9018, 4718, 11236, 16729, 16351, 1752, 15908, 9957, 9834, 13956, 3732, 10255, 16003, 5033, 16584, 6958, 9777, 15723, 1485, 13691, 5428, 10115, 15630, 4731, 6898, 337, 2424, 8247, 3647, 5409, 14919, 10592, 8176, 1476, 11997, 716, 4732, 5206, 11192, 993, 5159, 2646, 3911, 472, 11646, 1435, 134, 10780, 13686, 16104, 4713, 2847, 12701, 14409, 16187, 16285, 7124, 10134, 7893, 14515, 15064, 11693, 12311, 9385, 13367, 8443, 6969, 11830, 13818, 6369, 3357, 4586, 8487, 7888, 15721, 3382, 544, 16371, 7236, 7378, 3230, 10804, 14741, 16700, 388, 12837, 10021, 9789, 3854, 2841, 4261, 2859, 9481, 14883, 1026, 7586, 3062, 1352, 16827, 13726, 9093, 1393, 16341, 3279, 16134, 3908, 10125, 14769, 11384, 8803, 15975, 8713, 10095, 9303, 14559, 2785, 4750, 8162, 3504, 11856, 9790, 8299, 8724, 15091, 13801, 8993, 4681, 16100, 2185, 13850, 16444, 803, 7718, 16532, 14964, 8919, 2588, 10139, 11455, 469, 5167, 1256, 12699, 8192, 9236, 3222, 15813, 8027, 16669, 799, 4714, 3289, 8306, 10334, 9673, 5909, 16534, 15638, 618, 16634, 15158, 10756, 14715, 1458, 13776, 2387, 4509, 3697, 8370, 4677, 6034, 14768, 10331, 8760, 12620, 16547, 5658, 8100, 13982, 11135, 2140, 12919, 3197, 14816, 9993, 6610, 8, 3072, 14448, 10833, 12964, 12898, 180, 10446, 7659, 6446, 10166, 2032, 775, 7126, 3902, 1825, 9105, 16858, 6606, 11433, 619, 566, 1984, 2064, 14260, 6294, 11095, 13317, 7479, 2616, 4737, 16598, 8153, 5823, 808, 14296, 14091, 13241, 8086, 8931, 1145, 16464, 1159, 16643, 15175, 4108, 2810, 14393, 4841, 16713, 11554, 15138, 12716, 6696, 7178, 2427, 450, 2741, 1186, 15990, 11810, 12390, 3338, 3146, 5538, 5134, 2382, 8021, 16484, 15006, 13963, 1885, 2257, 13375, 6215, 12777, 15808, 4130, 2934, 11580, 11327, 10338, 6140, 2781, 7036, 3943, 8975, 16028, 13424, 3091, 4985, 7399, 16471, 366, 16353, 7852, 16263, 12293, 7631, 5430, 9071, 7271, 9068, 16766, 10801, 7039, 4110, 12432, 12418, 13783, 1844, 2682, 7964, 3747, 6126, 16298, 390, 15765, 7644, 1068, 6659, 7073, 6280, 2311, 5622, 15972, 14366, 14377, 11042, 14583, 3107, 9396, 15533, 8149, 5935, 3609, 3223, 16659, 16965, 1531, 1690, 9140, 15541, 3673, 6588, 12283, 6730, 1120, 1081, 2794, 700, 8369, 14, 14890, 911, 12997, 5358, 15632, 7285, 7559, 11818, 1743, 2191, 8858, 5949, 6822, 15455, 8801, 9973, 8036, 15143, 13959, 11969, 4224, 14811, 13574, 3456, 201, 16146, 12040, 6584, 7478, 2816, 4724, 12013, 3938, 13915, 1248, 14263, 15513, 14935, 332, 15132, 3894, 5086, 8794, 2016, 9216, 4602, 8050, 11235, 3509, 1949, 15035, 3742, 1744, 6639, 13089, 1513, 12378, 14302, 5692, 12796, 8035, 14960, 8562, 13887, 7590, 5030, 8139, 2400, 520, 5506, 1373, 7685, 14630, 3590, 14760, 4986, 7774, 8732, 4022, 4980, 5289, 3099, 5397, 12619, 15359, 16283, 1344, 1759, 3075, 446, 12250, 15434, 12122, 8570, 4796, 3536, 13104, 7282, 7, 3576, 952, 4825, 6216, 15728, 2731, 14066, 15857, 4445, 761, 12476, 4660, 6273, 15687, 712, 12308, 11753, 6524, 12108, 7589, 3752, 14962, 4327, 4285, 13143, 1160, 13688, 4793, 12972, 303, 11697, 15304, 458, 3301, 2693, 1960, 6805, 3237, 2711, 3844, 6713, 6278, 2665, 5241, 5652, 8930, 7633, 15403, 12929, 6909, 7182, 9996, 7220, 9981, 7224, 5322, 3650, 15674, 13370, 14386, 12498, 15770, 1430, 6035, 2106, 16843, 6167, 12558, 4393, 13336, 4449, 3736, 1805, 6638, 11144, 2167, 1234, 6913, 5572, 13922, 10516, 1687, 15144, 11522, 16049, 5780, 9148, 10008, 8742, 15648, 2437, 7152, 16443, 14977, 6628, 4974, 6741, 10764, 11742, 7435, 86, 650, 10739, 5110, 14525, 7733, 10163, 537, 9424, 15544, 2864, 8996, 16915, 2472, 14059, 11743, 8685, 16608, 7213, 13378, 14819, 10462, 5348, 15625, 14792, 7844, 10439, 746, 1439, 3676, 4105, 15378, 3323, 10299, 6962, 14413, 1368, 11733, 828, 7766, 13526, 3316, 9793, 11880, 12091, 4070, 1463, 10182, 11999, 16382, 14293, 13577, 7932, 6842, 11340, 11953, 7961, 2235, 6618, 4561, 12156, 13906, 8298, 14719, 886, 6879, 14220, 15551, 16904, 14705, 13747, 1209, 2038, 12688, 10114, 4816, 5536, 11255, 16874, 9491, 3475, 6737, 1918, 10878, 9557, 2457, 15054, 16021, 4126, 13464, 4020, 13418, 16038, 265, 3567, 16312, 5337, 16324, 3400, 2571, 8145, 16510, 10965, 4814, 4994, 2312, 14624, 3120, 6592, 4897, 9311, 9899, 16154, 2747, 15289, 4225, 2450, 2075, 6361, 13764, 1601, 1945, 16937, 1161, 8003, 15930, 1798, 7878, 13987, 1313, 16877, 11840, 12394, 10545, 15915, 7982, 3770, 10579, 15580, 6041, 8966, 6910, 9486, 13268, 16620, 2394, 9494, 11992, 11088, 8353, 15695, 16373, 1847, 12408, 6316, 16569, 13082, 3443, 5343, 9766, 9559, 15063, 764, 16034, 15336, 5664, 8808, 4046, 14490, 8321, 16384, 12206, 14269, 385, 4167, 14586, 10826, 1586, 2567, 8838, 9005, 9128, 4081, 2439, 2348, 2798, 9613, 12095, 16883, 1315, 16624, 10262, 6495, 13050, 11158, 16682, 14417, 16722, 496, 3686, 9822, 16567, 10240, 367, 7050, 7677, 34, 2037, 231, 3820, 10020, 6008, 1414, 13065, 14212, 13651, 934, 6086, 7637, 3639, 5574, 4217, 16522, 1170, 16288, 4751, 13409, 10390, 9194, 7342, 2122, 221, 11304, 10923, 14008, 6235, 11476, 15588, 6232, 2285, 6771, 564, 14859, 9858, 5351, 9439, 8436, 4628, 7773, 6903, 16616, 9762, 13284, 14041, 9569, 6185, 5820, 8367, 5555, 1559, 11979, 8356, 11674, 9066, 9416, 12028, 13780, 7139, 3805, 9330, 12606, 14058, 13878, 14540, 2381, 16251, 10906, 13891, 2103, 15086, 9952, 3740, 12296, 10938, 11503, 7147, 10086, 12170, 13380, 6553, 2765, 2712, 1780, 10075, 1181, 4946, 6123, 10708, 6971, 1561, 8132, 13004, 683, 3987, 2323, 14051, 4137, 9758, 2213, 16761, 8524, 12741, 2930, 36, 5176, 10011, 12985, 5213, 11535, 15689, 13665, 8466, 117, 13291, 4207, 2683, 13288, 10937, 15005, 1199, 6705, 1071, 4626, 3257, 14763, 1792, 2701, 11425, 9174, 15987, 7744, 10588, 4648, 14494, 8893, 5858, 4323, 6548, 11223, 10322, 3487, 2670, 4574, 15683, 14714, 12994, 15333, 762, 16109, 4529, 5680, 13229, 4025, 14684, 3599, 6410, 3602, 13505, 16376, 15473, 6421, 13110, 4495, 2251, 16908, 252, 3535, 14192, 1433, 3206, 13892, 1791, 4738, 2129, 13584, 7540, 8797, 7057, 1338, 11149, 16728, 6743, 1482, 9231, 10473, 6334, 5242, 5091, 1332, 4249, 8209, 4112, 16786, 13812, 2401, 12963, 12950, 12894, 12346, 266, 11839, 12913, 4477, 1502, 9868, 279, 1621, 6803, 10613, 8324, 16344, 5773, 4605, 1360, 3366, 7200, 1620, 9452, 7582, 16703, 11376, 8870, 2134, 930, 8478, 8875, 6200, 760, 11765, 3267, 8414, 15297, 14986, 691, 912, 14670, 9196, 15791, 14103, 16721, 15854, 1874, 273, 10406, 13258, 8343, 4312, 14442, 8391, 9956, 11885, 7391, 1051, 8721, 10317, 5324, 8675, 3695, 12145, 4961, 9791, 5631, 5416, 15823, 14225, 13556, 16051, 7575, 11210, 11834, 12103, 8711, 8890, 10124, 600, 6595, 16022, 10715, 8028, 2094, 9167, 7476, 1030, 10094, 9394, 104, 11487, 4945, 10911, 3924, 10282, 12219, 16612, 16884, 6703, 16139, 1300, 15542, 964, 9596, 15124, 12866, 4862, 9051, 6614, 3666, 9352, 4402, 11052, 12766, 2891, 13446, 2494, 9403, 2145, 962, 14891, 11965, 10315, 6728, 12057, 11702, 6238, 16615, 1924, 1837, 16081, 6093, 12559, 11054, 3046, 14320, 4753, 657, 842, 3683, 16483, 13364, 904, 5732, 15929, 2758, 13016, 9819, 8748, 11412, 1657, 13572, 1173, 7976, 13124, 4032, 2502, 14163, 7274, 9928, 7168, 7510, 8511, 4496, 9968, 15557, 2435, 5799, 14170, 12297, 1577, 9195, 7005, 3438, 7534, 13929, 11896, 15948, 7914, 7273, 1456, 15476, 1836, 5208, 4661, 11959, 177, 3982, 9904, 9279, 9747, 12840, 6175, 4858, 16806, 6022, 2470, 7472, 6880, 13341, 16676, 9077, 15233, 1525, 3322, 3040, 15340, 13442, 6526, 2390, 5591, 5441, 8053, 11783, 3727, 866, 224, 3006, 10249, 14780, 8568, 11524, 8224, 9773, 11064, 6459, 7726, 323, 142, 3700, 7531, 4590, 10016, 5842, 1455, 5869, 7083, 15686, 13749, 3185, 14695, 5740, 15318, 9288, 1742, 9535, 10226, 1085, 259, 12228, 6080, 6173, 12667, 12588, 6679, 4350, 8536, 11772, 15734, 5517, 2992, 4191, 5907, 16171, 7103, 3037, 3777, 441, 5121, 13010, 6557, 12113, 9611, 11040, 3587, 16032, 3274, 4347, 10905, 13793, 8581, 9915, 10361, 7542, 16416, 5291, 8080, 15305, 10293, 14152, 15923, 7653, 14440, 15352, 9134, 2187, 8400, 6761, 11051, 4505, 15912, 4982, 3308, 2850, 2524, 10552, 1318, 14998, 12800, 5354, 505, 11242, 16597, 7924, 9250, 1763, 4134, 16901, 2407, 2991, 12058, 16356, 141, 14312, 4686, 2208, 346, 14643, 11006, 4314, 5393, 7356, 7165, 10620, 10207, 12384, 11375, 7663, 13756, 3302, 16923, 4221, 13637, 12527, 3232, 5280, 9919, 4390, 1986, 5986, 2177, 10930, 6995, 4910, 7241, 2570, 2206, 7832, 14517, 14585, 3882, 6191, 7245, 5258, 4782, 3571, 16625, 5069, 13831, 7403, 6512, 8293, 16959, 3999, 10100, 12759, 16145, 1817, 13627, 12666, 851, 16425, 14031, 6740, 9268, 13060, 4715, 10343, 843, 12332, 16301, 5977, 10345, 12092, 1571, 13427, 4057, 5586, 6652, 2776, 2276, 11101, 16161, 6796, 16685, 15274, 16808, 5278, 213, 14645, 5379, 2044, 4139, 13231, 11841, 299, 6039, 963, 10648, 1668, 1224, 7781, 14057, 14028, 10602, 14556, 15343, 9736, 15700, 7764, 12454, 4459, 10145, 11914, 3942, 5752, 6891, 3642, 7830, 9746, 2584, 1914, 16381, 15110, 9161, 3621, 10281, 12096, 11001, 3948, 9247, 1136, 11062, 881, 6635, 52, 12776, 1238, 10190, 12249, 8455, 3060, 1860, 12471, 13984, 7897, 870, 3484, 14900, 14052, 10844, 16228, 10689, 1228, 7257, 15555, 14415, 11281, 15065, 13119, 1644, 1963, 10353, 8692, 780, 8677, 4902, 10303, 9677, 9007, 13923, 2867, 12339, 1865, 13993, 14185, 12536, 9883, 11458, 15486, 10214, 13385, 2156, 5886, 12758, 1996, 6662, 150, 8943, 15418, 3252, 5119, 16221, 2510, 2936, 9672, 15764, 13555, 9278, 4570, 15564, 9854, 11865, 11867, 16687, 3081, 354, 12202, 6260, 2617, 5424, 1816, 16355, 7429, 8215, 8472, 12026, 10678, 15426, 9015, 715, 10340, 16549, 12569, 14020, 11142, 14127, 6739, 3112, 7443, 3871, 8213, 13211, 1870, 12405, 12097, 11508, 898, 2728, 8542, 15315, 14305, 9100, 14593, 502, 14418, 8624, 14904, 10031, 16136, 1516, 14129, 12073, 13304, 11247, 16195, 2174, 10986, 9920, 16701, 16523, 6755, 10824, 10879, 1930, 12136, 9332, 6270, 15221, 14652, 11600, 6952, 11651, 9895, 10599, 7887, 16554, 6296, 6002, 14486, 772, 12618, 10876, 14636, 12631, 5795, 1032, 15243, 14554, 12542, 3412, 8061, 5130, 14346, 10400, 4655, 12102, 14110, 3012, 5575, 7843, 2490, 15955, 2948, 13576, 4880, 7407, 10859, 12195, 6448, 12767, 3816, 16246, 11418, 7529, 8821, 11202, 8706, 14679, 14021, 4955, 13931, 7032, 14729, 7262, 16429, 1773, 10485, 3813, 5621, 4680, 14550, 15964, 480, 10651, 3196, 7812, 8415, 6357, 16138, 14513, 5481, 6319, 15529, 771, 10991, 13136, 356, 16810, 10741, 1587, 11400, 6602, 12413, 6795, 4309, 9249, 16265, 1380, 4637, 1748, 16250, 586, 11245, 14857, 11583, 9523, 13532, 15879, 11797, 12734, 3253, 11307, 7652, 12726, 3901, 14239, 171, 6621, 2773, 15743, 5413, 15585, 10725, 8739, 6438, 7688, 13937, 1696, 4799, 6221, 15411, 6532, 12549, 8909, 10590, 1146, 10238, 10572, 10314, 16784, 4410, 13907, 15986, 14549, 11460, 1902, 5742, 10140, 14587, 8923, 10289, 14961, 7554, 1324, 5688, 3486, 16372, 3662, 13210, 4687, 8236, 2896, 11409, 12993, 2604, 16881, 3025, 278, 14738, 9831, 9241, 12823, 3334, 3765, 1537, 11862, 15429, 8091, 14940, 11085, 16944, 1142, 7863, 3848, 9462, 10858, 16936, 10132, 11735, 3343, 4679, 14068, 15001, 3431, 10203, 13126, 7383, 13742, 6330, 13856, 8701, 11874, 14941, 9395, 11913, 12082, 5508, 1871, 7826, 3330, 11159, 4066, 11399, 175, 7043, 10650, 12140, 5934, 14371, 10720, 1802, 8040, 6896, 11769, 7750, 9222, 2455, 198, 16503, 11078, 1000, 6860, 13448, 1750, 787, 16072, 2454, 3729, 9473, 7238, 10026, 11176, 13563, 7210, 15216, 5701, 15149, 6758, 11252, 1882, 9846, 8799, 15225, 13251, 9484, 15909, 10106, 15003, 16057, 7956, 613, 3625, 4141, 11566, 11345, 9979, 1893, 12363, 16394, 12846, 16048, 7742, 10521, 10734, 1323, 15997, 9070, 2854, 572, 7013, 10247, 6425, 10227, 13331, 13832, 7753, 6671, 7721, 3681, 4193, 14045, 6052, 1917, 9319, 4833, 11477, 770, 528, 16379, 4988, 5779, 2142, 3351, 13249, 6301, 6566, 7916, 7304, 3009, 3797, 12167, 8456, 14569, 1889, 12572, 4252, 15356, 61, 11157, 11388, 13494, 15899, 13797, 14252, 5312, 12163, 8332, 4698, 1137, 14456, 5501, 8901, 5010, 7607, 3280, 9393, 12383, 513, 2291, 11584, 10461, 9936, 1229, 7709, 5781, 11264, 4399, 14776, 878, 13080, 14107, 15398, 5669, 12879, 10186, 1466, 15184, 16814, 5177, 15139, 1549, 2953, 15825, 12600, 1937, 10266, 12862, 9445, 12025, 10976, 16223, 11228, 15855, 7695, 6501, 14802, 9824, 2566, 864, 12098, 1976, 15265, 9256, 7415, 6944, 14303, 15738, 16501, 11488, 830, 9399, 3507, 9398, 15944, 4993, 11126, 13701, 6378, 11930, 13408, 2258, 13195, 5589, 1305, 9143, 8146, 10467, 3494, 11321, 14165, 2696, 7597, 12715, 15974, 7408, 1126, 11850, 1001, 10966, 8218, 4836, 2577, 13565, 3208, 15959, 3930, 11181, 13700, 7841, 2395, 4416, 11243, 12304, 11102, 9836, 821, 10967, 3622, 16651, 10511, 15748, 5083, 6162, 4429, 4719, 9731, 4834, 6468, 5472, 3007, 4887, 13397, 2993, 4284, 2282, 5786, 6574, 9986, 5587, 10548, 16188, 3709, 16454, 14378, 11653, 15722, 5827, 7160, 8671, 2402, 6908, 9635, 349, 13032, 10458, 15799, 13369, 5183, 14526, 10789, 1646, 6265, 6507, 10924, 13300, 15480, 9706, 12978, 7053, 2821, 16575, 10743, 6399, 16129, 3488, 11398, 4337, 14276, 1570, 582, 13449, 14079, 3651, 8980, 6062, 13845, 12492, 12966, 2380, 16077, 10624, 14973, 12469, 11481, 1016, 12438, 14151, 8643, 7707, 15556, 13207, 14354, 1533, 568, 3024, 6773, 1898, 14953, 7945, 11215, 13734, 4747, 3810, 5603, 7405, 5663, 12791, 6148, 6498, 9786, 10065, 5737, 14945, 6119, 14761, 3719, 15136, 4414, 4356, 4546, 12457, 7266, 9607, 4568, 10507, 13059, 5524, 3657, 6405, 13896, 14755, 8278, 12727, 2806, 13430, 14012, 8512, 16595, 8869, 10776, 1428, 16558, 3573, 5952, 8223, 10723, 3436, 12624, 10133, 15708, 3889, 11303, 14697, 1594, 11267, 9916, 6251, 9990, 8912, 13260, 3430, 16286, 5231, 13914, 10404, 3874, 8680, 10558, 16628, 5829, 6099, 7767, 4692, 13460, 9374, 9842, 3881, 935, 1014, 15247, 9027, 5487, 3150, 16264, 13149, 13814, 13942, 12349, 14814, 9412, 5311, 15766, 7376, 10431, 12428, 10332, 10278, 7060, 16502, 6985, 7374, 9103, 16093, 3467, 13668, 3090, 664, 8547, 11198, 10593, 10667, 5114, 14955, 4640, 10275, 6963, 10384, 12093, 9363, 1299, 524, 7829, 8491, 7827, 5317, 1815, 10494, 2881, 15636, 7268, 6006, 15595, 4379, 3016, 11454, 14836, 14991, 380, 6325, 7556, 6407, 12889, 3304, 8217, 15538, 10443, 13671, 10942, 9270, 3480, 1422, 10454, 3559, 4798, 3920, 2405, 6609, 1891, 4670, 14037, 7805, 4094, 3613, 11382, 11705, 8879, 11084, 15220, 14036, 14832, 3693, 11950, 6332, 2943, 2022, 5446, 7623, 5540, 4952, 11394, 9173, 7732, 15308, 15867, 957, 4849, 13159, 8586, 744, 13967, 7646, 15664, 11241, 16294, 9833, 1278, 7290, 14039, 13047, 13857, 15399, 16765, 10025, 15238, 4582, 9490, 10034, 14147, 487, 6327, 2484, 12967, 12130, 4358, 9217, 1548, 7596, 12455, 8204, 15954, 2320, 5903, 10637, 3600, 12531, 6368, 10241, 12316, 12453, 1472, 4899, 2620, 14820, 10508, 12567, 3022, 10490, 13948, 7571, 10192, 1003, 15669, 9493, 4353, 15914, 14650, 15437, 11529, 2969, 6061, 3168, 15397, 5132, 12486, 5843, 15502, 4559, 137, 13309, 8288, 14661, 4412, 251, 11239, 12354, 4375, 14727, 4627, 14666, 14223, 5534, 13547, 11961, 1983, 12854, 16430, 6204, 4366, 5892, 584, 5816, 7464, 5266, 13112, 6366, 2649, 11976, 9926, 8759, 12487, 13419, 6321, 9772, 8276, 6749, 9482, 6815, 13453, 15994, 1067, 8606, 11595, 2452, 2826, 2325, 11404, 3554, 16840, 15649, 5785, 10438, 4664, 13344, 2220, 3749, 10853, 15313, 16078, 10465, 1715, 6, 4374, 1551, 11552, 8663, 4438, 417, 10504, 7187, 3682, 8188, 10356, 14317, 11601, 13358, 6831, 7324, 9958, 16014, 11971, 8302, 11500, 5, 4050, 2903, 2844, 855, 2184, 12839, 10165, 3365, 4019, 14713, 539, 11, 6322, 12080, 5570, 14981, 16541, 5864, 331, 15099, 16203, 412, 12799, 8554, 15691, 11941, 929, 14452, 4893, 8385, 10012, 8747, 16562, 16942, 4519, 7820, 197, 11809, 9720, 5386, 7400, 13451, 3508, 16862, 5840, 9597, 15015, 5331, 7418, 16308, 11502, 9260, 16144, 7668, 13038, 10492, 2487, 727, 579, 12094, 9095, 1296, 9975, 4045, 1448, 13551, 12861, 5642, 14235, 12988, 13939, 13905, 614, 5230, 944, 2491, 8619, 13666, 1971, 326, 530, 8881, 8660, 1722, 6982, 6276, 5226, 661, 14851, 9340, 12874, 11427, 2315, 8446, 14639, 6229, 9876, 11838, 6707, 3182, 16939, 16305, 13654, 11605, 2901, 5748, 7132, 7075, 7487, 1048, 14561, 9580, 16907, 12797, 9874, 13384, 5643, 3574, 6236, 1321, 3246, 6569, 14282, 4176, 11947, 13066, 12550, 435, 14216, 14937, 11491, 12258, 7928, 9994, 4043, 11027, 3619, 7095, 11917, 10658, 7016, 14501, 15591, 629, 1840, 3896, 11665, 11881, 3637, 15507, 4175, 13212, 14709, 14132, 2087, 10323, 4596, 6863, 7409, 7525, 11313, 16033, 9519, 10536, 8514, 9013, 3678, 16437, 1921, 3261, 11349, 16654, 11357, 8077, 10408, 9712, 288, 3928, 1112, 16157, 16428, 14788, 6073, 9471, 13396, 7246, 16800, 13612, 2611, 8824, 11318, 1276, 8855, 10677, 4997, 10452, 9739, 5090, 10831, 5912, 2264, 13924, 3259, 5817, 1899, 3495, 15286, 10440, 5629, 8504, 6797, 13642, 13067, 12655, 14588, 15189, 48, 10209, 16852, 16400, 9198, 13021, 6715, 9030, 6233, 5990, 6767, 15125, 3910, 13658, 2048, 379, 6245, 6092, 13422, 14385, 8935, 14823, 12192, 194, 10212, 7121, 11571, 2805, 4044, 8054, 1441, 4878, 9759, 16006, 2196, 6872, 9321, 12027, 8238, 260, 8123, 13531, 3333, 12936, 14660, 5607, 233, 14533, 2971, 14648, 5706, 805, 13713, 3080, 15605, 4682, 9588, 2406, 7657, 13488, 12369, 5189, 263, 3734, 13083, 9873, 10904, 11910, 10587, 8315, 7523, 3358, 13883, 16366, 3675, 16820, 3109, 2878, 8955, 8190, 8874, 12568, 8151, 1546, 8627, 1261, 11868, 15985, 9547, 11752, 10042, 11512, 5046, 6304, 15546, 627, 1682, 12580, 1853, 13230, 12030, 4764, 6950, 15126, 11955, 12915, 127, 11161, 11290, 8180, 15337, 4463, 16448, 2923, 14203, 14712, 16004, 5766, 3814, 6347, 16306, 2819, 7020, 7508, 2101, 12270, 3515, 14108, 8688, 1673, 4115, 4603, 15490, 5617, 9998, 1863, 7480, 7395, 7973, 1544, 10556, 1195, 8225, 16280, 7922, 11608, 7468, 13613, 13778, 0, 10101, 6252, 6411, 3685, 1258, 5968, 13496, 11310, 12873, 3158, 15543, 1045, 14951, 10495, 9682, 5203, 9893, 15078, 5456, 5647, 2001, 6172, 2067, 4879, 1672, 12161, 4810, 7258, 4278, 16147, 2367, 16913, 15643, 10057, 16120, 4405, 8375, 3088, 10501, 6534, 7230, 7683, 6015, 2358, 6193, 6684, 13282, 6987, 14876, 970, 9104, 1751, 9504, 14061, 4030, 361, 12352, 15774, 13901, 12497, 5182, 4848, 15652, 10576, 3086, 5756, 753, 12713, 6889, 12106, 9184, 2822, 7215, 4860, 8501, 15268, 10333, 5131, 1675, 13657, 5461, 3818, 3321, 13428, 10530, 14384, 3617, 11807, 215, 12309, 4430, 12902, 4291, 15720, 16671, 11426, 4649, 16538, 5991, 4104, 15169, 5253, 18, 1197, 6677, 3238, 11269, 11432, 7728, 1103, 9609, 5577, 5859, 9469, 16128, 16369, 7287, 2823, 11894, 11309, 7183, 10947, 615, 7190, 7919, 3929, 3638, 9612, 2516, 9110, 7696, 14770, 8185, 16196, 16506, 4322, 14692, 12646, 6701, 1183, 16184, 2463, 7857, 8839, 8758, 12470, 13108, 12818, 15518, 14391, 3735, 311, 678, 14918, 7144, 7461, 9814, 12779, 5485, 6521, 16582, 1789, 7046, 752, 10702, 11163, 12719, 10700, 13489, 386, 4633, 11842, 15070, 16775, 5332, 3111, 2632, 8256, 16564, 4847, 9644, 12461, 8609, 5220, 101, 1020, 9927, 16348, 668, 968, 13153, 2261, 12917, 3520, 825, 8503, 11050, 541, 11835, 635, 8429, 16498, 6026, 13462, 14271, 13672, 10886, 11926, 837, 11825, 3737, 3865, 11413, 1613, 74, 3688, 7316, 2796, 1230, 9384, 5406, 217, 4639, 12076, 53, 12858, 14266, 13588, 8884, 6511, 7788, 13994, 985, 4230, 7881, 13372, 3851, 15387, 10219, 1217, 547, 2982, 6835, 13294, 8959, 11879, 14076, 5067, 8368, 6263, 1163, 15505, 1246, 4939, 16179, 4838, 16588, 5750, 5480, 1474, 9091, 7003, 3655, 12910, 6166, 9185, 8172, 15786, 926, 12622, 10357, 10661, 11620, 15215, 10391, 12224, 4597, 16637, 13992, 12388, 16698, 2511, 13299, 12769, 16747, 2771, 15833, 2371, 15902, 674, 3541, 6146, 16576, 1176, 9509, 103, 170, 9190, 15133, 8328, 1679, 2856, 15769, 16097, 1831, 1151, 2302, 5654, 13280, 7990, 4276, 14006, 8227, 12035, 4572, 5184, 11090, 16027, 4644, 13917, 14840, 11869, 16337, 5425, 10807, 14241, 2790, 6223, 850, 15933, 15109, 2227, 14584, 4589, 10747, 14476, 16619, 11756, 15280, 14655, 13148, 2448, 96, 11548, 16495, 8539, 4831, 2748, 9239, 15729, 9713, 16075, 8249, 14720, 11013, 7775, 2962, 11871, 14007, 13990, 13873, 2952, 15217, 6305, 13675, 15651, 12730, 12507, 1637, 9006, 7232, 16863, 16178, 4624, 6734, 3949, 3271, 15451, 13332, 2695, 4709, 16846, 11124, 10899, 16335, 2336, 2995, 9224, 7849, 9305, 6984, 9098, 6537, 1397, 10144, 4497, 14017, 439, 13049, 15417, 14969, 2432, 4484, 2107, 6751, 211, 3066, 7041, 1814, 13081, 15214, 4317, 16011, 2811, 5627, 2866, 5444, 13944, 11720, 10335, 6502, 6736, 12014, 15019, 5168, 1554, 16716, 8156, 8617, 6802, 4868, 14954, 14815, 3897, 15204, 12941, 14208, 12295, 8717, 697, 12856, 10984, 16085, 9467, 12280, 15870, 301, 10152, 12849, 10979, 15989, 1359, 3421, 10827, 12152, 1663, 16254, 14528, 722, 1526, 12784, 4922, 8882, 667, 10660, 7643, 4124, 13538, 10078, 3403, 6900, 1303, 4305, 12614, 10861, 6525, 15696, 1540, 3782, 11986, 12071, 3957, 15549, 4080, 6780, 5850, 7035, 2289, 10054, 7337, 11520, 15167, 15155, 4584, 3726, 15040, 8105, 3898, 15104, 5898, 6116, 2614, 659, 12022, 16871, 12060, 4226, 8786, 14331, 7430, 8957, 7426, 14056, 636, 15210, 677, 16771, 6577, 15732, 5987, 15014, 15609, 2146, 13405, 11908, 10568, 2265, 7211, 9020, 2098, 10284, 9695, 1046, 14001, 3568, 12539, 3781, 14136, 338, 7465, 9647, 5103, 9690, 6211, 3265, 6111, 4341, 15737, 10665, 6899, 16777, 6527, 9418, 3534, 11715, 13152, 1388, 13966, 11877, 2417, 10934, 9199, 9727, 16304, 8708, 9138, 6643, 10557, 16362, 3553, 5483, 12337, 14097, 4245, 7850, 5945, 6133, 4512, 378, 9383, 7254, 13561, 14833, 8341, 4534, 11719, 2913, 954, 5345, 1446, 9606, 848, 15568, 8250, 7548, 3312, 10699, 15430, 8444, 5085, 30, 13025, 15922, 12508, 9610, 60, 12237, 3074, 15134, 13318, 16552, 14495, 3905, 6239, 708, 15536, 13125, 11493, 6709, 8765, 688, 5857, 12732, 13949, 3300, 1010, 15982, 2041, 6819, 11063, 2504, 2825, 7394, 2056, 2787, 14796, 11541, 9665, 9771, 1926, 8887, 9976, 4828, 6135, 15269, 6746, 4903, 9885, 14498, 10639, 15845, 4111, 5314, 1263, 8175, 7727, 7811, 3305, 13653, 3721, 2967, 9756, 7286, 4652, 7193, 143, 8735, 14884, 1643, 12672, 15361, 9180, 4009, 2500, 7848, 4023, 14892, 9001, 809, 951, 4683, 10416, 13382, 1190, 4832, 8555, 13234, 283, 16518, 1900, 41, 5686, 8782, 11089, 16364, 6138, 14869, 10427, 13321, 15384, 7195, 4579, 4227, 5099, 9897, 6820, 2063, 3665, 5292, 1027, 12042, 341, 10731, 15807, 8579, 1879, 15978, 11945, 7600, 8052, 4266, 3134, 6131, 15973, 6479, 7770, 16719, 9945, 11299, 1498, 15893, 7908, 13097, 11942, 2090, 6565, 8822, 14003, 5238, 7235, 16174, 12668, 11749, 4653, 2035, 7689, 13693, 6127, 4911, 15046, 10200, 1444, 16190, 9460, 3646, 10244, 13040, 680, 14242, 7204, 873, 6970, 1558, 12987, 9629, 14722, 14389, 9342, 10154, 11598, 14778, 11479, 10887, 3408, 17, 6551, 55, 13757, 749, 2907, 1919, 6650, 4947, 3631, 14511, 12016, 15492, 6941, 310, 10239, 1123, 12174, 2199, 14972, 16462, 2247, 7214, 8193, 14647, 11703, 10694, 7431, 10939, 3054, 7601, 15510, 11757, 15730, 164, 5224, 3859, 4308, 14240, 2721, 10050, 6340, 14398, 4537, 229, 14557, 12753, 4575, 2298, 6556, 10732, 2902, 15213, 11673, 7854, 5738, 12199, 7980, 8212, 10913, 12385, 15094, 7999, 4998, 15693, 11655, 13203, 6344, 5202, 1793, 11759, 13390, 3161, 5474, 9477, 11708, 5687, 6234, 14421, 2256, 8089, 13208, 1767, 1883, 15856, 896, 16690, 13346, 791, 4306, 834, 15903, 4369, 9997, 10228, 3636, 14555, 6408, 3110, 11250, 5437, 10129, 3201, 9983, 15448, 1002, 7885, 7091, 2509, 205, 3181, 13435, 4804, 2271, 8891, 3961, 10274, 4042, 14853, 8305, 9497, 11075, 8667, 11819, 12513, 7455, 13802, 4182, 12147, 2929, 6186, 13609, 16899, 5013, 7314, 6341, 5693, 16082, 4972, 13178, 5479, 8807, 1034, 11534, 1487, 12183, 7717, 14541, 1189, 8557, 8357, 15589, 14771, 16328, 3459, 11657, 8310, 14596, 3469, 8738, 2530, 9457, 9422, 554, 10004, 3664, 5920, 1361, 8644, 2244, 7798, 5100, 14564, 10009, 15927, 3388, 1500, 4186, 7533, 14841, 10522, 4970, 1876, 3477, 11080, 9546, 15358, 10330, 6012, 1460, 5250, 1512, 4173, 1747, 897, 5490, 1862, 8842, 4336, 3395, 8166, 13952, 13573, 12735, 14376, 15085, 6050, 12272, 2980, 7272, 12909, 13267, 15179, 3585, 9816, 10600, 12439, 16186, 14040, 7051, 710, 9193, 5054, 7419, 7645, 12502, 9150, 8582, 10268, 7159, 4801, 6808, 9120, 1888, 7434, 835, 2308, 3840, 4522, 4456, 6488, 6291, 3603, 6253, 66, 13636, 13608, 2942, 11792, 5436, 10636, 6426, 6228, 15121, 3052, 8587, 1177, 6254, 16142, 5711, 15311, 12479, 4728, 13071, 16829, 3560, 1896, 432, 13444, 2958, 14987, 8073, 13885, 5835, 10630, 15752, 3660, 7473, 2046, 11291, 1106, 10043, 7069, 2926, 2853, 14676, 11550, 11156, 11125, 13205, 2066, 2379, 8630, 14532, 6778, 4762, 11594, 4187, 12532, 7330, 7979, 7417, 14849, 4533, 404, 11975, 531, 3070, 4064, 3823, 15578, 13920, 11543, 16380, 7712, 11740, 7632, 16848, 6433, 12733, 425, 8900, 9221, 16906, 5579, 10773, 591, 9304, 1843, 16452, 7203, 166, 15287, 6342, 1410, 14478, 10668, 1523, 15717, 1506, 9428, 15537, 983, 14472, 5323, 2430, 12830, 4704, 13955, 9627, 2931, 8450, 2513, 9805, 656, 5970, 9297, 59, 7789, 6806, 8812, 1492, 15682, 3789, 9794, 2252, 8030, 639, 5900, 6790, 12222, 72, 16526, 8393, 11518, 10524, 5762, 12738, 2626, 8698, 10199, 8560, 11555, 16964, 5831, 13763, 13650, 4017, 7756, 264, 7340, 5592, 14821, 12785, 10821, 9002, 4129, 13139, 15009, 15203, 12003, 9658, 4912, 15118, 11858, 1459, 601, 7619, 15296, 9929, 2674, 15704, 14201, 11266, 15952, 4069, 8752, 9740, 15747, 4443, 8377, 10535, 8186, 12472, 5363, 8496, 414, 6462, 2562, 8852, 12213, 10977, 13696, 14984, 3389, 12090, 12139, 12043, 2752, 11029, 7440, 13415, 463, 16970, 16343, 11023, 11251, 12521, 12241, 2606, 8026, 14381, 3384, 13825, 5147, 11037, 5726, 291, 5964, 16684, 16066, 2328, 16834, 11582, 7462, 12518, 8743, 1973, 2534, 16740, 15251, 9591, 3273, 3581, 2594, 7163, 669, 5038, 10676, 545, 5771, 11069, 14000, 796, 6998, 6460, 15191, 1785, 7028, 10109, 11640, 13213, 16113, 1534, 10628, 6422, 2273, 1856, 6687, 4012, 6184, 15820, 5684, 14618, 9171, 11559, 3399, 2858, 12494, 2664, 2081, 3491, 5867, 7566, 9966, 2341, 11489, 5807, 5884, 14485, 3610, 8270, 724, 728, 8045, 9037, 1662, 839, 12940, 7755, 9970, 8621, 8258, 5438, 14315, 14753, 14659, 2536, 9626, 16789, 6476, 11386, 3717, 10448, 7905, 12341, 15477, 8273, 16405, 168, 4792, 173, 13492, 3640, 7444, 8469, 739, 16774, 1901, 6359, 1341, 7865, 14131, 5722, 1400, 13420, 8418, 1741, 13558, 12971, 13217, 10578, 2738, 11293, 4783, 652, 15573, 16596, 4174, 7205, 11162, 15789, 13618, 15327, 15244, 1244, 2173, 351, 9273, 16470, 8362, 3372, 12160, 13183, 6605, 4999, 5349, 5362, 277, 8076, 1589, 15956, 6699, 9525, 8211, 13640, 1061, 2210, 6027, 9534, 2893, 3391, 13425, 15376, 16111, 7737, 3935, 12804, 15258, 6581, 9397, 1872, 10248, 12371, 9668, 8944, 8763, 13155, 6517, 10945, 9401, 7808, 14858, 16864, 6298, 12056, 4581, 977, 949, 7802, 2800, 12441, 15615, 3221, 15654, 1978, 16969, 11996, 13697, 13714, 7818, 10663, 8111, 9033, 11022, 253, 9823, 131, 9111, 13861, 4907, 2062, 1686, 8532, 4171, 4516, 11709, 4666, 12193, 12803, 11146, 27, 5125, 12808, 15114, 4696, 4294, 15130, 10682, 6337, 7197, 3702, 3819, 10270, 8633, 11853, 6288, 2004, 7738, 5804, 15780, 12437, 15834, 16422, 15, 11750, 4554, 5598, 14122, 6505, 13853, 14887, 16851, 7758, 6996, 5471, 10733, 9934, 7474, 15166, 12833, 14817, 10053, 2753, 1257, 7145, 8448, 4326, 10110, 1653, 9207, 15424, 9947, 13570, 1337, 5329, 8583, 11390, 730, 580, 3059, 6594, 5164, 16363, 15742, 12279, 10450, 12089, 473, 16689, 15228, 3043, 9459, 6949, 10091, 4457, 11295, 13498, 14830, 10777, 11141, 2334, 11263, 1797, 6406, 16551, 1233, 7505, 12853, 12368, 15047, 9621, 15135, 13070, 11401, 9617, 5199, 14608, 12227, 7042, 15381, 6183, 16019, 3701, 13103, 16963, 9080, 10354, 7842, 13620, 6992, 8011, 3824, 12595, 8043, 10874, 8154, 10951, 4421, 10995, 754, 5352, 10619, 6765, 6465, 2679, 10005, 1812, 16853, 8018, 5303, 8585, 9177, 9436, 1040, 15482, 13622, 1572, 16905, 4, 6237, 11207, 5467, 8703, 6645, 1304, 8203, 12850, 9573, 4501, 6915, 1563, 12748, 14614, 8509, 11644, 12908, 8183, 14258, 16486, 11762, 13273, 12029, 12650, 2493, 5346, 6066, 6373, 9878, 9251, 2456, 1327, 3936, 1319, 14217, 7692, 5135, 13596, 16086, 14387, 12529, 4188, 8148, 3626, 8170, 15270, 11471, 12570, 6444, 9659, 14446, 16062, 6876, 5918, 6653, 3311, 2097, 13977, 6302, 2057, 12127, 7760, 7457, 12225, 8389, 11170, 14909, 10992, 11872, 15917, 998, 13348, 7614, 8951, 15281, 2117, 1946, 11983, 174, 8210, 11423, 11569, 7247, 13305, 915, 13788, 3786, 2591, 15439, 14474, 6318, 10525, 597, 13562, 5195, 4133, 5447, 9574, 4339, 4384, 8453, 1029, 10550, 4214, 15464, 6490, 11131, 4442, 9485, 15570, 14885, 10740, 698, 16197, 3169, 5852, 15084, 3317, 648, 16159, 4027, 10920, 15347, 7551, 12651, 14310, 14912, 13679, 5768, 7010, 444, 3960, 15312, 12086, 5612, 13006, 8974, 6315, 2581, 3036, 9386, 3620, 4600, 10355, 13191, 8201, 13988, 14739, 6071, 3067, 16823, 5098, 9743, 11912, 15782, 15828, 13458, 4237, 3890, 575, 5940, 14952, 8198, 6464, 12749, 9699, 14002, 16693, 2434, 12197, 13167, 5791, 13875, 9527, 11469, 6858, 14524, 2495, 15180, 14519, 8097, 10469, 11627, 13692, 4612, 15517, 14451, 12545, 15199, 10118, 3718, 7208, 13479, 12630, 10369, 15059, 5811, 15565, 6608, 6884, 2350, 7570, 5672, 7452, 11047, 1507, 14230, 8441, 6753, 14273, 8958, 10625, 3083, 1110, 11374, 15593, 14343, 16769, 3, 144, 5845, 9413, 15550, 4552, 12511, 14454, 8784, 10681, 15535, 12242, 5529, 9946, 869, 16717, 1746, 10441, 6089, 1379, 16457, 14106, 2007, 11323, 14575, 3658, 13048, 10981, 11616, 14976, 702, 15207, 14062, 7651, 14149, 12648, 14855, 225, 3202, 5863, 4106, 14123, 1009, 13281, 2362, 16638, 11033, 1519, 5071, 14846, 16545, 16952, 1390, 5120, 3236, 206, 3506, 4662, 10762, 4437, 3069, 492, 5765, 9964, 148, 7174, 15229, 13543, 8715, 5609, 599, 10321, 8648, 11450, 2680, 13359, 12032, 11319, 9313, 4396, 16217, 10514, 1829, 5443, 13737, 10549, 1356, 497, 13926, 11365, 13592, 6975, 2095, 5925, 15794, 1269, 11892, 9843, 1631, 2120, 13264, 1104, 16895, 4551, 403, 14207, 3416, 3648, 9732, 12320, 13683, 6475, 3745, 11312, 7872, 13721, 3128, 11208, 4143, 8550, 15231, 10138, 7901, 12141, 16226, 11662, 12358, 721, 12393, 13698, 397, 11068, 13894, 13511, 15349, 6145, 8296, 2622, 1739, 14514, 13509, 8125, 13699, 15072, 16850, 3418, 11561, 4975, 15841, 13838, 5503, 3490, 3056, 6362, 10181, 8649, 6354, 7229, 14431, 9681, 1454, 11746, 4508, 2193, 4523, 10772, 4142, 11526, 4400, 8025, 6959, 1869, 10718, 7870, 689, 11004, 5245, 3796, 7162, 11351, 7189, 240, 9821, 15115, 7379, 9318, 10796, 7821, 12491, 16030, 2763, 12832, 2690, 13772, 8898, 9863, 7355, 8506, 14325, 8335, 11507, 3309, 12801, 16349, 5198, 10038, 12143, 8573, 9244, 12694, 16885, 7453, 9055, 1053, 550, 12986, 15391, 13889, 12907, 7217, 9636, 4178, 5482, 14975, 3878, 11837, 7363, 10368, 3692, 16961, 12179, 8403, 2824, 4398, 16609, 9474, 12218, 15030, 16938, 401, 5398, 14047, 10862, 8339, 8483, 1353, 9881, 1090, 12709, 12786, 14291, 8412, 8941, 9152, 11059, 4528, 13201, 7198, 12956, 15634, 6404, 549, 13940, 9696, 3677, 16917, 14210, 8833, 9372, 5378, 12434, 8082, 3240, 13725, 13879, 9954, 5683, 958, 11791, 10603, 15858, 1810, 13867, 15497, 11726, 8637, 10263, 11082, 5989, 3696, 6810, 12813, 7616, 15049, 15293, 457, 5774, 11901, 548, 12054, 15647, 5422, 3744, 4361, 4383, 3171, 745, 1295, 5973, 15981, 11647, 3189, 3616, 10019, 10347, 1043, 14018, 399, 1640, 14591, 2479, 3332, 9309, 3118, 9323, 13971, 12565, 10645, 1639, 5871, 14674, 1333, 4454, 11496, 2209, 15515, 10802, 7839, 15076, 11994, 16169, 4937, 13339, 14668, 10698, 13534, 3345, 3360, 1671, 11045, 13751, 7853, 6917, 9962, 13928, 8781, 4852, 16497, 5222, 14834, 5075, 11782, 14653, 13568, 3113, 8348, 14758, 1273, 4363, 9357, 5077, 14718, 16052, 15653, 2143, 5333, 15002, 11890, 160, 355, 14427, 10327, 9549, 5248, 334, 6207, 10064, 8723, 16408, 13530, 15379, 3643, 16407, 14077, 13497, 5719, 8164, 10652, 14245, 4966, 10260, 9905, 693, 8257, 10058, 8515, 6069, 7625, 13252, 9537, 2092, 9775, 5049, 7555, 5969, 4873, 6774, 8831, 16018, 14799, 11900, 11294, 15147, 15887, 6814, 10518, 15699, 3448, 3248, 15726, 442, 6615, 995, 14767, 16398, 4234, 3293, 13473, 1616, 3397, 13799, 5181, 1591, 10611, 15162, 16393, 13719, 5876, 14880, 16389, 12015, 6966, 8602, 5061, 15906, 10372, 5196, 3516, 6242, 13115, 13925, 12827, 7598, 304, 14289, 12773, 67, 4482, 9200, 16680, 4409, 11964, 15499, 11822, 11123, 6391, 11261, 10156, 13872, 12361, 11403, 14988, 8716, 8843, 10257, 7560, 10932, 884, 9806, 4099, 7179, 4781, 100, 1801, 10873, 12215, 14915, 7743, 8969, 1694, 4926, 10709, 3191, 13600, 16330, 9042, 1576, 8793, 14872, 7017, 15852, 8454, 790, 11372, 400, 14013, 6277, 9135, 1426, 1237, 542, 10506, 8727, 13533, 7104, 10919, 3963, 16647, 13843, 4181, 11799, 230, 14267, 15314, 7068, 8816, 1182, 2218, 10472, 10717, 12312, 4855, 9087, 11350, 9761, 14450, 1866, 5217, 12996, 14064, 16447, 9605, 5411, 14580, 16130, 4545, 10424, 6141, 8303, 15028, 4417, 13157, 13804, 2677, 9670, 13599, 8932, 655, 12979, 6570, 858, 4156, 9026, 15937, 2648, 3482, 9578, 1461, 8695, 16073, 10178, 15779, 9722, 2600, 2638, 6500, 9765, 13368, 15393, 11129, 5721, 9645, 3377, 16404, 4441, 9365, 7806, 3946, 3730, 12745, 7106, 11367, 10197, 9683, 9634, 3264, 8766, 9892, 747, 14181, 5153, 4000, 10503, 10644, 14411, 1465, 1427, 5113, 5056, 2860, 10738, 5716, 13625, 3644, 13215, 605, 5927, 8085, 5014, 15301, 15161, 8002, 2984, 4583, 307, 5659, 7141, 1480, 9208, 15520, 8481, 7537, 7662, 1311, 12714, 11494, 12616, 2331, 3422, 5327, 9338, 12133, 14157, 10798, 15921, 14990, 15004, 5335, 16409, 3096, 12009, 12158, 15093, 2443, 7584, 6839, 11604, 7122, 9657, 12391, 1343, 4806, 4118, 16828, 8664, 16821, 10560, 1355, 8788, 14202, 6076, 13545, 7086, 3966, 2162, 13052, 16770, 4595, 12867, 15370, 2384, 5081, 10902, 13535, 2963, 15083, 14932, 12100, 4610, 15865, 15601, 3170, 5475, 11347, 8973, 7913, 2180, 15705, 6441, 11675, 14484, 11416, 7482, 11663, 4642, 8859, 2353, 14619, 5355, 1222, 11658, 14189, 2895, 16626, 14813, 5339, 6307, 9102, 16922, 14019, 4368, 2655, 3952, 8233, 7661, 6748, 7649, 15141, 3288, 9400, 3630, 9156, 348, 14054, 5072, 3433, 3711, 16667, 3471, 5197, 8535, 9382, 4087, 408, 9579, 4006, 11829, 6862, 16350, 6249, 4298, 14594, 13501, 2115, 2884, 585, 1057, 14114, 9453, 16795, 15294, 11815, 2420, 2654, 7138, 1539, 10298, 6177, 3393, 2303, 15781, 6000, 8857, 6589, 824, 368, 9219, 9158, 11828, 12181, 516, 14141, 4208, 3869, 1118, 11028, 1363, 3594, 6151, 13835, 16244, 8378, 7481, 15506, 7550, 1950, 4665, 15949, 8104, 4812, 15896, 2205, 12989, 7994, 11097, 2641, 8938, 11273, 8228, 2021, 13970, 8863, 7748, 7259, 519, 12400, 10177, 16949, 3073, 9571, 10010, 12205, 13140, 11341, 12922, 16354, 10480, 1852, 8977, 13781, 12445, 4606, 7708, 9427, 12482, 1478, 14704, 13550, 13466, 4951, 10891, 15641, 6258, 16798, 13105, 9421, 11232, 1494, 12747, 7947, 9866, 7569, 7923, 10059, 12087, 12555, 15013, 83, 10414, 5739, 8610, 6894, 15592, 9429, 9308, 9285, 16521, 7454, 12410, 10402, 8461, 12415, 9513, 4735, 16561, 822, 13591, 15201, 16816, 2700, 3544, 3580, 4035, 2039, 1423, 11717, 12822, 12953, 7988, 7702, 10631, 10527, 642, 6102, 3654, 8657, 5715, 12958, 2598, 16450, 10170, 9409, 1633, 3714, 8044, 3760, 11730, 10224, 5082, 899, 11285, 4867, 4521, 8138, 2188, 13325, 13759, 12024, 4229, 154, 13122, 10632, 15412, 8476, 13507, 4153, 7817, 3297, 4387, 2615, 13457, 13943, 2916, 16056, 10928, 3426, 10793, 5611, 1982, 16887, 13118, 7801, 6182, 2114, 15334, 11380, 10846, 2397, 261, 4155, 6957, 1629, 16438, 15501, 11596, 931, 4564, 2042, 16571, 8271, 2085, 7580, 4453, 107, 8922, 6533, 10605, 9440, 16581, 14894, 9664, 10922, 1072, 6784, 7697, 10865, 11032, 14749, 3825, 8915, 6241, 5882, 1096, 16493, 12860, 14663, 7114, 3614, 2947, 8942, 8355, 11721, 12695, 2766, 5545, 6626, 13177, 1535, 6274, 4550, 6881, 14279, 5204, 2060, 641, 4233, 10642, 9582, 12975, 6224, 7148, 122, 12318, 892, 8246, 916, 10745, 4150, 11331, 4960, 10013, 12138, 2070, 15904, 12330, 11407, 9650, 5215, 3133, 176, 13903, 13676, 10615, 3190, 2203, 7933, 13030, 15596, 1187, 14339, 1083, 13904, 8527, 9417, 9292, 7969, 906, 2014, 10856, 15745, 4539, 4673, 1625, 14504, 9972, 15574, 5108, 16855, 14043, 4331, 16260, 7295, 4001, 13188, 8374, 13092, 11116, 2887, 5257, 9600, 5122, 4797, 12684, 14316, 7014, 3973, 11949, 7171, 11824, 70, 13, 6914, 9370, 2703, 2831, 15177, 3950, 477, 7105, 709, 5060, 9599, 1202, 14706, 9235, 14095, 6013, 13571, 16657, 16316, 16655, 10812, 15863, 2242, 3328, 15242, 5268, 4041, 10269, 13193, 12306, 11795, 13957, 11009, 8530, 15532, 11660, 16214, 12247, 6152, 4524, 12717, 2755, 7052, 16723, 13985, 5448, 11164, 15037, 3755, 15108, 4433, 6931, 8886, 7943, 15101, 315, 10999, 3832, 9556, 14570, 1953, 12645, 5725, 11870, 5232, 816, 12031, 14084, 7981, 5776, 8417, 16491, 4884, 5163, 7370, 14309, 12451, 11430, 14453, 11821, 16696, 16760, 1289, 5662, 8761, 11796, 13182, 15422, 8352, 2316, 16010, 10750, 10848, 5179, 7873, 9594, 11768, 8320, 13235, 3496, 12829, 13522, 13601, 5055, 2374, 4488, 10836, 12633, 11445, 6563, 1477, 14467, 11065, 2843, 8439, 7934, 5637, 3632, 13862, 12775, 8920, 5080, 15182, 9284, 11092, 13293, 5926, 11737, 5708, 511, 1047, 5767, 3918, 11844, 16849, 12904, 6857, 287, 15621, 3932, 15703, 15163, 15344, 1314, 8113, 5525, 8468, 2833, 15639, 8697, 595, 5431, 1084, 9680, 13469, 9072, 2198, 16118, 15928, 14929, 5450, 1822, 16333, 13765, 14274, 199, 6396, 4424, 6346, 8405, 6547, 4382, 10815, 11688, 8326, 5304, 7446, 4051, 7650, 6130, 9754, 16126, 6735, 11364, 2698, 9570, 12623, 7196, 13165, 15173, 1907, 7459, 7084, 15441, 1667, 6374, 3342, 14785, 2782, 6293, 6906, 3860, 5929, 10352, 15401, 12575, 660, 7640, 16313, 11776, 1406, 13902, 14726, 16764, 1293, 16148, 15033, 9025, 928, 1964, 1149, 12236, 7567, 11619, 13978, 11958, 1031, 285, 3855, 5142, 4281, 10147, 6437, 15504, 15839, 11420, 14989, 4556, 14736, 705, 15684, 2977, 16642, 11954, 16176, 8835, 5585, 16255, 8911, 13677, 15534, 239, 10940, 8599, 1260, 316, 8181, 9859, 12814, 4082, 15812, 405, 5118, 7723, 1556, 16282, 6144, 12474, 12044, 2116, 12843, 14090, 3886, 6087, 11369, 1241, 16445, 16323, 5562, 9431, 4407, 1700, 7948, 4481, 9441, 663, 15957, 11898, 14080, 14682, 1389, 7410, 9028, 5635, 3762, 11343, 13953, 2069, 12881, 11484, 5666, 672, 903, 15673, 13941, 3470, 7784, 15998, 2415, 6823, 4913, 11112, 7070, 6077, 1301, 14195, 12920, 1037, 7891, 13238, 15445, 11539, 9112, 16436, 3822, 16622, 4691, 891, 4940, 10795, 13499, 13111, 3529, 1669, 2228, 10466, 9755, 5668, 5531, 11030, 14046, 11046, 7985, 6385, 5459, 6147, 13833, 3463, 3724, 1421, 3953, 9543, 15571, 1705, 3298, 2986, 13156, 1050, 5550, 3241, 8336, 11861, 12104, 1413, 5252, 6190, 13560, 7955, 5595, 4219, 12702, 5025, 15291, 6918, 6199, 10180, 12892, 13245, 9802, 12851, 11575, 7627, 14734, 2658, 6477, 6290, 7989, 7489, 4963, 16460, 4863, 8670, 8978, 4401, 5696, 4668, 10342, 10291, 14204, 2389, 11831, 15267, 11857, 12402, 13373, 2089, 5243, 9520, 1881, 15995, 9122, 10421, 11728, 11031, 2347, 12331, 15819, 2990, 11326, 11531, 6539, 5373, 5218, 9302, 2224, 16802, 3798, 14060, 723, 10493, 4136, 11213, 2553, 12483, 9253, 12188, 9987, 7639, 234, 6065, 533, 12107, 10393, 14082, 10360, 9847, 13881, 13141, 11280, 2917, 11952, 11788, 10573, 4826, 707, 3177, 2906, 8937, 11973, 2202, 4775, 9316, 9276, 10901, 8846, 5698, 8471, 1141, 4525, 5937, 1399, 8445, 4464, 7539, 4056, 8312, 8946, 10077, 12443, 6676, 6179, 617, 121, 12947, 8534, 7836, 13186, 10364, 1011, 2985, 9210, 2481, 1670, 11167, 9487, 9113, 16482, 2668, 5375, 8376, 6157, 6098, 14014, 11083, 15514, 2503, 5731, 8558, 6828, 9115, 5761, 11760, 15435, 517, 10860, 3743, 398, 1023, 2474, 14236, 6779, 5877, 16973, 5704, 249, 1038, 14638, 12751, 5792, 9532, 12510, 14748, 2267, 3447, 13013, 16357, 7326, 11790, 797, 5735, 13150, 376, 6762, 8268, 12500, 11751, 11438, 2363, 7261, 2013, 992, 9666, 3402, 2640, 9023, 1268, 3291, 9376, 16825, 9160, 15409, 13311, 2955, 12836, 12674, 3198, 9472, 9155, 6522, 3228, 15433, 3307, 11687, 4300, 7951, 9061, 7925, 16292, 3588, 14845, 7957, 3266, 13744, 7526, 8184, 1661, 9978, 1284, 2745, 4427, 5734, 3959, 427, 13189, 16170, 8438, 4491, 4165, 1651, 3020, 4527, 16568, 10851, 5395, 5111, 5596, 14347, 8528, 14434, 8277, 3748, 2158, 353, 369, 1116, 7794, 6787, 9335, 8520, 7492, 13912, 14313, 15061, 1550, 443, 12287, 5023, 4659, 10435, 4553, 6266, 3380, 3543, 5533, 485, 3872, 12634, 15727, 6617, 4348, 10496, 15886, 16708, 692, 3858, 5628, 3079, 10969, 10380, 7682, 12663, 7978, 8005, 15057, 3319, 4047, 1666, 1236, 8719, 11613, 7720, 14708, 1167, 13766, 10217, 6360, 8650, 15759, 10041, 5463, 15755, 15128, 6264, 10120, 4244, 7071, 339, 2979, 8740, 5730, 12700, 3376, 15685, 7536, 16099, 8780, 2020, 1905, 2792, 16759, 7133, 9430, 11553, 9254, 3997, 3151, 7466, 10726, 10515, 5709, 3633, 841, 10679, 10288, 608, 246, 1787, 13216, 6840, 16912, 14602, 4021, 5300, 257, 5221, 12396, 7779, 4185, 11152, 16321, 13860, 10318, 9119, 15793, 13782, 15884, 9240, 9807, 3951, 7880, 15021, 14130, 13868, 3175, 12704, 2176, 4701, 12034, 14247, 11260, 16368, 8608, 13585, 7701, 8226, 5960, 6598, 14405, 3057, 8372, 1807, 5915, 7119, 10513, 14048, 7675, 11849, 2416, 9225, 7638, 4616, 13689, 4846, 7522, 9967, 9057, 13619, 5141, 7641, 9848, 5834, 10374, 12298, 7009, 8182, 13546, 2994, 16878, 8791, 1721, 14404, 14505, 11664, 15022, 12638, 8095, 1347, 4114, 12289, 8914, 155, 6356, 2051, 9420, 14539, 14327, 14723, 14067, 10964, 7369, 15450, 1768, 6892, 11056, 13753, 11744, 4672, 13209, 4346, 14523, 12051, 6415, 16340, 5227, 1272, 5518, 26, 15330, 14088, 16712, 16902, 14730, 3026, 13303, 8690, 14214, 10204, 10149, 4827, 7004, 2634, 11286, 12864, 1079, 6685, 5318, 6453, 14392, 12229, 2245, 6044, 5523, 2678, 11268, 10595, 924, 15660, 2602, 13090, 12547, 7813, 12416, 10910, 6667, 11171, 11442, 13663, 9237, 5344, 16219, 4504, 6094, 8853, 2179, 5234, 3852, 12937, 1606, 6222, 2398, 13938, 10571, 2333, 1920, 2467, 6300, 5497, 14249, 14408, 1935, 11440, 12551, 7545, 14111, 14628, 5136, 571, 6714, 12223, 8019, 6072, 9760, 4591, 9633, 7281, 1730, 8266, 7778, 10591, 12657, 8449, 2628, 15077, 15254, 4919, 5618, 3269, 14025, 4850, 16177, 2863, 10179, 10825, 11178, 538, 4795, 9455, 2049, 14234, 13821, 3186, 6895, 10116, 7111, 15953, 5891, 2431, 8070, 14691, 11609, 2724, 12157, 11016, 2769, 2975, 945, 6928, 6051, 9655, 15190, 653, 16411, 16629, 10765, 4542, 1697, 16830, 5256, 5350, 9415, 8032, 10575, 4320, 2537, 15405, 4223, 6531, 10687, 13969, 15355, 14781, 2770, 969, 4518, 9914, 12379, 3468, 13774, 16064, 14888, 4154, 6523, 7977, 14926, 7975, 3123, 5561, 16329, 12201, 10389, 714, 2079, 10627, 6205, 11465, 13223, 9692, 10962, 15697, 10187, 8373, 2072, 15771, 2715, 15276, 2861, 6757, 13287, 272, 11233, 9838, 8230, 14362, 1264, 3919, 4072, 11113, 14716, 7814, 7678, 8642, 13786, 13014, 3552, 900, 12596, 13910, 3566, 14520, 11889, 14422, 14314, 2708, 10517, 2574, 5865, 6874, 16365, 13429, 13919, 15400, 14470, 7341, 12204, 14599, 1652, 7509, 11216, 6155, 14222, 7532, 15461, 6833, 3299, 8541, 5020, 989, 4576, 3234, 1308, 4039, 16854, 8687, 11212, 2300, 10925, 8626, 5144, 874, 1245, 6844, 5788, 12696, 11805, 4152, 8864, 9623, 4755, 11684, 7327, 4620, 6935, 15724, 6192, 9145, 298, 4485, 5419, 5396, 314, 10581, 4194, 6798, 699, 13510, 9442, 13330, 2438, 15067, 4432, 5062, 13142, 10768, 1786, 11379, 13648, 14455, 5984, 14508, 7397, 11405, 14009, 15389, 15872, 13983, 10778, 9094, 9447, 11592, 14510, 1762, 2868, 6180, 8159, 9356, 10001, 3489, 3635, 9837, 9149, 8997, 14552, 2576, 1617, 13440, 3419, 2526, 10223, 7428, 3723, 6543, 13158, 9069, 13732, 16039, 4609, 9646, 8749, 9865, 3102, 11633, 14109, 3713, 13961, 5018, 7012, 16758, 4008, 6188, 5376, 13315, 4856, 7063, 9233, 2949, 16736, 6800, 15760, 4068, 5384, 8632, 14827, 13723, 9230, 15081, 1848, 12573, 8064, 11463, 9840, 7920, 15607, 16417, 8099, 5798, 16237, 7762, 13707, 1211, 1095, 12984, 5336, 479, 8767, 12286, 491, 15319, 12781, 1634, 3263, 16783, 5340, 14133, 1139, 2939, 1887, 8553, 16206, 8523, 6007, 1117, 16473, 12153, 15500, 14125, 3834, 1928, 13750, 13614, 8106, 12852, 10994, 5528, 6937, 7910, 3830, 10760, 14086, 488, 6816, 11278, 15806, 1735, 687, 14257, 2862, 5465, 7583, 7593, 9426, 2163, 15860, 9121, 14949, 8981, 14828, 2877, 14329, 14104, 16310, 3038, 5445, 2225, 518, 13852, 3900, 8008, 10301, 1331, 16819, 15283, 4697, 3363, 1188, 15969, 2234, 11168, 1940, 16227, 13771, 13345, 2309, 4619, 14825, 9510, 470, 12264, 10264, 1175, 4388, 223, 3381, 16080, 1185, 3242, 3763, 440, 1958, 4789, 7740, 12239, 1638, 15677, 12344, 16743, 12906, 12387, 3546, 12431, 1481, 8704, 7421, 16663, 6561, 3139, 15395, 6869, 42, 4209, 2313, 14994, 10849, 6478, 6371, 15803, 6764, 2596, 16781, 9514, 3315, 940, 11041, 5902, 11324, 8873, 14026, 9358, 4452, 7791, 15322, 15279, 10724, 2608, 8629, 2403, 8287, 12683, 8300, 3794, 6980, 9107, 9925, 9751, 9320, 3413, 5079, 7724, 9800, 12534, 16763, 15307, 16200, 14428, 976, 8383, 12636, 12220, 8832, 7470, 8916, 14480, 10062, 7317, 9114, 15449, 8407, 12189, 14128, 4872, 5432, 12466, 735, 16664, 15822, 12499, 8197, 5879, 11468, 2846, 2507, 14775, 2468, 4623, 6372, 13660, 2720, 9282, 8510, 4853, 3143, 15066, 11297, 5665, 12266, 5401, 13996, 8666, 15832, 16212, 4526, 10325, 8878, 11920, 14458, 7442, 12951, 9951, 2250, 12244, 3923, 5578, 4236, 15142, 11628, 11256, 3972, 15208, 5096, 313, 569, 948, 7110, 2699, 3955, 4896, 741, 12744, 15567, 16600, 10099, 7143, 7710, 13133, 12178, 12319, 1641, 6807, 6454, 255, 11185, 15950, 3004, 939, 832, 2637, 8970, 16347, 11745, 4654, 6393, 14497, 10245, 5954, 16194, 4315, 6336, 7949, 4307, 10070, 7483, 16537, 11754, 8594, 1895, 7485, 8917, 16029, 5674, 2569, 11334, 16896, 12109, 16941, 1504, 13536, 684, 14665, 11630, 9563, 10102, 5429, 8540, 9126, 15098, 5947, 6227, 14359, 11393, 6812, 2238, 5597, 15365, 7264, 1503, 6487, 6414, 16868, 10730, 3001, 2317, 4685, 6886, 7251, 14390, 6272, 16332, 12194, 11354, 3704, 9475, 1286, 13789, 1200, 6752, 737, 1755, 15299, 2447, 16660, 6529, 11698, 12687, 4061, 2549, 3921, 16023, 12303, 11211, 16888, 3876, 1075, 12411, 7494, 15676, 16984, 2834, 16358, 13566, 438, 10351, 11903, 3131, 12055, 13886, 16732, 149, 15100, 6668, 7612, 10222, 13046, 9262, 14774, 11160, 15983, 10529, 51, 6981, 2147, 2989, 12893, 12002, 11196, 1049, 14144, 11565, 7768, 7170, 6350, 10363, 2523, 16983, 2954, 5296, 12175, 12301, 10997, 1680, 6303, 5511, 8485, 13266, 2342, 10806, 7192, 8826, 5260, 4638, 3505, 11066, 9764, 241, 2873, 14224, 4725, 11514, 9649, 7186, 4296, 14631, 12422, 4571, 15438, 1833, 1543, 3771, 4780, 11410, 16762, 9274, 13374, 11886, 6750, 8659, 428, 11666, 16951, 7184, 1648, 15719, 14797, 2849, 12890, 8705, 11636, 2460, 13470, 6518, 12278, 3346, 6646, 5868, 10880, 16686, 8071, 4861, 10850, 5753, 9387, 6948, 9585, 11421, 11948, 4921, 12430, 84, 4851, 4933, 14098, 9197, 14640, 11671, 9213, 7134, 3229, 14177, 15454, 7749, 14907, 12323, 14535, 6158, 12310, 1522, 3417, 14545, 3367, 16284, 13851, 3207, 4235, 15421, 12540, 6922, 4730, 10324, 16249, 8245, 15785, 15245, 2337, 16152, 8205, 5956, 10662, 9176, 14910, 10087, 14806, 1975, 4123, 4757, 4109, 9884, 13641, 7372, 6142, 8237, 7898, 14999, 6509, 9379, 4260, 9146, 7810, 11483, 6769, 12590, 11966, 10084, 14914, 7899, 4316, 3947, 16694, 8102, 10839, 1074, 2127, 1873, 4973, 15897, 12520, 13508, 5625, 9844, 4413, 4957, 7292, 3082, 336, 7595, 2961, 6262, 7386, 2414, 10766, 15489, 3888, 4840, 5854, 9565, 4468, 6680, 10127, 14686, 8075, 16772, 11439, 3183, 8989, 12957, 9381, 8009, 8593, 8999, 9750, 12664, 7514, 11204, 16336, 6493, 4935, 16123, 7450, 11669, 16342, 13724, 5763, 1022, 12541, 65, 8834, 694, 16386, 11506, 5302, 5985, 10869, 7803, 14927, 9109, 1602, 11172, 11408, 13434, 6447, 12245, 16592, 6363, 16281, 6101, 13423, 1345, 11053, 15503, 8017, 14334, 3156, 16290, 12639, 16779, 3055, 15309, 1113, 11222, 6386, 5123, 1824, 3592, 8984, 152, 4733, 2105, 2910, 8433, 4404, 16735, 1910, 7323, 2829, 15306, 1827, 10828, 15836, 4898, 12561, 9803, 4615, 6516, 16125, 11058, 15815, 3326, 1939, 9738, 2109, 11706, 10088, 16481, 15105, 7869, 6064, 6642, 8465, 2518, 14908, 6943, 8174, 3473, 16577, 5928, 15367, 4658, 10146, 5543, 2848, 10174, 16548, 14721, 5247, 10309, 11724, 16345, 14604, 4357, 15032, 5874, 13602, 5237, 2318, 12944, 12257, 14093, 4026, 5847, 4408, 2746, 16578, 509, 1766, 12969, 12838, 11093, 10564, 6583, 12099, 16311, 7585, 1850, 14199, 6916, 13075, 8120, 15561, 2489, 3863, 2157, 6194, 4932, 2186, 11109, 1178, 11747, 14027, 6708, 11383, 3582, 7062, 8495, 9622, 4925, 792, 5787, 7620, 6999, 14493, 4702, 13410, 942, 7140, 14724, 13068, 5286, 7279, 9359, 5710, 10946, 1794, 10320, 16767, 15447, 10447, 12805, 15525, 2717, 6375, 686, 1626, 879, 447, 13849, 4874, 14466, 9512, 11939, 5507, 1624, 6920, 10659, 16331, 2330, 14341, 2817, 4900, 13918, 16476, 16604, 15715, 3336, 15935, 11532, 4515, 8397, 12649, 7838, 2335, 2005, 11766, 4436, 9749, 9478, 13320]
    def ゆヷパりだひばアぇェハばにふぞたセ(self,吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜,リびッヶヶへばゔサへかヸロぢゥピ):
        눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕=list(range(256));っぁなぶゔぎグルシゐ=0
        for 쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨 in range(256):
            っぁなぶゔぎグルシゐ=(っぁなぶゔぎグルシゐ+눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨]+リびッヶヶへばゔサへかヸロぢゥピ[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨%len(リびッヶヶへばゔサへかヸロぢゥピ)])%256
            눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨],눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[っぁなぶゔぎグルシゐ]=눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[っぁなぶゔぎグルシゐ],눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨]
        쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨=っぁなぶゔぎグルシゐ=0;帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童=[]
        for 朶崝伥蓡爆凔纹袚鹴道骆 in 吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜:
            쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨=(쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨+1)%256;っぁなぶゔぎグルシゐ=(っぁなぶゔぎグルシゐ+눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨])%256
            눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨],눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[っぁなぶゔぎグルシゐ]=눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[っぁなぶゔぎグルシゐ],눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨]
            帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童.append(朶崝伥蓡爆凔纹袚鹴道骆^눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[(눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨]+눖뷌철켭쩵뗅칁썿뉸즯꺸껁챦풕[っぁなぶゔぎグルシゐ])%256])
        return bytes(帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童)
    def 퀉썬믰븠룡괟팗귙쟮뿵잻톲폱씓(self,吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜,ヾぶァキハイプホレざゐばユとァズヹゥ):
        帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童=bytearray();路陻摤棋菺也曭鵖蛇塸聄牀篍驲蠾寘僻=ヾぶァキハイプホレざゐばユとァズヹゥ&0xFFFFFFFFFFFFFFFF
        for 朶崝伥蓡爆凔纹袚鹴道骆 in 吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜:
            路陻摤棋菺也曭鵖蛇塸聄牀篍驲蠾寘僻=(路陻摤棋菺也曭鵖蛇塸聄牀篍驲蠾寘僻*6364136223846793005+1442695040888963407)&0xFFFFFFFFFFFFFFFF
            帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童.append(朶崝伥蓡爆凔纹袚鹴道骆^(路陻摤棋菺也曭鵖蛇塸聄牀篍驲蠾寘僻&0xFF))
        return bytes(帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童)
    def 튟믷벝쌼퀝밷멃댍뼵쉥앟낁똻(self,吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜,リびッヶヶへばゔサへかヸロぢゥピ):
        return bytes(朶崝伥蓡爆凔纹袚鹴道骆^リびッヶヶへばゔサへかヸロぢゥピ[쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨%len(リびッヶヶへばゔサへかヸロぢゥピ)] for 쪿쿅눸묂졕툰갠룫닗햞쑒뫐쪢왰슨콨,朶崝伥蓡爆凔纹袚鹴道骆 in enumerate(吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜))
    def スぴヹゟテペばみだフ(self,吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜):
        帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童=[0]*len(吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜)
        for 誗塑蒥帯勨駫荏痻財刴,킶뒡겓퀟괼엽뙐녥넋뼋졞봸 in enumerate(self.ヾコまホひェゥへデャピヴぺアゃ): 帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童[킶뒡겓퀟괼엽뙐녥넋뼋졞봸]=吮蛟巯檤慂东隿锰虉儠巰埖闟滿颪嬸儜[誗塑蒥帯勨駫荏痻財刴]
        return bytes(帐鹡牝缓蟔疞掃嗧捽鞞躧鉃籖寏吧颎童)
    def やるョへァワヾぱてぽ(self):
        앫항쳗쿳뚷쏂톤묫쵘궏밴 = __import__(''.join(map(chr,[98, 97, 115, 101, 54, 52])))
        뇨덗뾄혴릯쬖줃롍쾯첳싻죸됿끩꺃픳쵔헼 = __import__(''.join(map(chr,[98, 122, 50])))
        漈祒鹌質檡涴軖坯洈飃繪  = __import__(''.join(map(chr,[122, 108, 105, 98])))
        끒혣긂쨰렎붚퇎욃쪵삵맇  = __import__(''.join(map(chr,[108, 122, 109, 97])))
        듧깹콴뮽뀎퍡퀕촔팅랲빭픞긨쫯즖떫  = __import__(''.join(map(chr,[109, 97, 114, 115, 104, 97, 108])))
        ヱレぶニアゖヒンゆぇワズゟ = 앫항쳗쿳뚷쏂톤묫쵘궏밴.b64decode(self.ゐトぱみグヲせゴねきぶまゲえざを)
        ヱレぶニアゖヒンゆぇワズゟ = self.퀉썬믰븠룡괟팗귙쟮뿵잻톲폱씓(ヱレぶニアゖヒンゆぇワズゟ,self.のザタヂプにらツぃゕトタてガハよどイ)
        ヱレぶニアゖヒンゆぇワズゟ = self.ゆヷパりだひばアぇェハばにふぞたセ(ヱレぶニアゖヒンゆぇワズゟ,self.켇뫚깦덍끍꿓뫹돡뫉뽀쵹)
        ヱレぶニアゖヒンゆぇワズゟ = self.スぴヹゟテペばみだフ(ヱレぶニアゖヒンゆぇワズゟ)
        ヱレぶニアゖヒンゆぇワズゟ = self.튟믷벝쌼퀝밷멃댍뼵쉥앟낁똻(ヱレぶニアゖヒンゆぇワズゟ,self.킃뒦늂뙔겁훯햯쏛멲뉭틠짨)
        ヱレぶニアゖヒンゆぇワズゟ = 앫항쳗쿳뚷쏂톤묫쵘궏밴.b85decode(ヱレぶニアゖヒンゆぇワズゟ)
        ヱレぶニアゖヒンゆぇワズゟ = 끒혣긂쨰렎붚퇎욃쪵삵맇.decompress(ヱレぶニアゖヒンゆぇワズゟ)
        ヱレぶニアゖヒンゆぇワズゟ = 뇨덗뾄혴릯쬖줃롍쾯첳싻죸됿끩꺃픳쵔헼.decompress(ヱレぶニアゖヒンゆぇワズゟ)
        ヱレぶニアゖヒンゆぇワズゟ = 漈祒鹌質檡涴軖坯洈飃繪.decompress(ヱレぶニアゖヒンゆぇワズゟ)
        ヱレぶニアゖヒンゆぇワズゟ = 漈祒鹌質檡涴軖坯洈飃繪.decompress(ヱレぶニアゖヒンゆぇワズゟ)
        _pycool_code_ = 듧깹콴뮽뀎퍡퀕촔팅랲빭픞긨쫯즖떫.loads(ヱレぶニアゖヒンゆぇワズゟ)
        _pycool_ba_ = bytearray(ヱレぶニアゖヒンゆぇワズゟ)
        for _pycool_wi_ in range(len(_pycool_ba_)): _pycool_ba_[_pycool_wi_] = 0
        del _pycool_ba_, ヱレぶニアゖヒンゆぇワズゟ
        return _pycool_code_

樸訶槓젡떧漖ロ쩨酎汊嬂쟐兴퍜齇椹엱漀丨법 = [[(lambda 圏捠霠緶與봦焴콡贓쥗廩: 圏捠霠緶與봦焴콡贓쥗廩 ^ 193)(i) for i in range(12)] for j in range(10)]
拥詞冄揗錈焭柟叶죝孏蜫僇志瞅锪叕術똉昱臚 = (lambda 큯蛍퍓區赩嗵楓蕫媏涺鰵魻籖: (lambda 倅跗캺覞壅鏢椅꿰: 倅跗캺覞壅鏢椅꿰 ^ 31)(큯蛍퍓區赩嗵楓蕫媏涺鰵魻籖 + 9836))(113)
'''
勆榲輫珕摌揳碹汏縷嚂繺瞣鍮込柯閽燺飋篪櫱舅愷崅靔髯師慦龎墘窣崃塅査闗罨淭鄱玽壂勽邵钤驡捻餒抭錺颡佤葛倷萿歌棣狭佈瞬懄芕抰瞕顁疌巩嫤矅衞嵠煘躦埡膖赞坓鋘隖焌佟鱎帿谊熡襠軘骱屠龀樫嗫颲嗻膌刵绔躁眞抠燛楃険鞍碐氏鉑綁戦颶娾寨鯶湺扞篜怼鱪馊瓇蘘枧槏崠縛詈業蛚竍箯甦銡矹様杫筸嘻帵砗嘁鉐泫箣迮赴惗姻靀均埏隽昝鞇柣用鼫萖羠臱煰闩餫婓拾延樜喑桉睨懴鐑察侵耖熷颜詋敡吻袖贶终剓
'''
螹饌욶퀬荍홭휑黽쎷殶啩塛 = 4824 ^ 217 * 38 + 110
맴吶珔誆汯籽缘찖吏뽁详窞硴璾 = lambda り퇏聩貑큶鉻阵翼齺蚔텎뮾鍀琏躯銳檅: lambda 蠰蓠屛矣陘扣뾭栦듐岘铋: り퇏聩貑큶鉻阵翼齺蚔텎뮾鍀琏躯銳檅 * 174 ^ 蠰蓠屛矣陘扣뾭栦듐岘铋 + 5832
솭扫맪蒠蛽闺隆鸒팫谵礎겞虶뗈靌쒧鸈씹倳肰뎰컾貜짒찘띬 = {(lambda 鲻멀띚깲磜셜쁣톉똜镴絸뫅穰믤捖塅: 鲻멀띚깲磜셜쁣톉똜镴絸뫅穰믤捖塅 ^ 68)(i) for i in range(18)}
뀴歎난幍늹뎑鶋퇦訯齑擱骷吵 = {6555 ^ i for i in range(62)}
站菩쨲閁輵山쥬煢乷碋髷礩徊魣嵋캧釒堭錧旆跨몯渹륦 = (lambda 苣ド颣秼鬫퐹쳉梊茅胬馢呈熀: (lambda 鉈鹃狋띈떇徱옘鉣: 苣ド颣秼鬫퐹쳉梊茅胬馢呈熀 & 104 ^ 鉈鹃狋띈떇徱옘鉣)(8031))(73)
넝蒲쩠쪳턑햰칆죑폿뎨젨쾱쏉炔꺦컻솜墠屓诳엋協糭뺣迂 = {(lambda 珊盬篔뒫阬낎뛔涗졌鸰憑瑠雾뽰丅혭蔝닜: 珊盬篔뒫阬낎뛔涗졌鸰憑瑠雾뽰丅혭蔝닜 ^ 104)(i) for i in range(5 * 8)}
윧蓷豘噓훒笛떖킑뗀軲蟅틆팘겥醂썹擇瓱螬芕敍럄쿂젇휻崊얹晧 = [8024 for _ in range(53)]
룇왑咁뵤냍쯆靉躛팿涾稂풙흄静 = [(lambda 뷾矙騔俉걮樀崞쮓뀕轏谋: 뷾矙騔俉걮樀崞쮓뀕轏谋)(3022) for _ in range(32)]
뽖稾꺹쳾类靴텞샎鳼乻꼜甮攺 = {6797 ^ i for i in range(7)}
莅驄饻뎌无鎤큅堌졓橹鲞넊 = [(lambda 빂庛뀅艀恀糚댐唎蛉庑黻摭븫툔犕맘딸闧: 빂庛뀅艀恀糚댐唎蛉庑黻摭븫툔犕맘딸闧)(524) for _ in range(56)]
虍믒鲆땓넢莧뻹줬酃纀粭賭縗漑緝쏷쇦젒윈郄뽱꺯 = (lambda 鋨쭗좛鈆鼣퍻嚠잹瀃亮쌒鵑昩: (lambda 屁攼찛鉁渆寮浕儦綠溉쾭틴作赧: 屁攼찛鉁渆寮浕儦綠溉쾭틴作赧 ^ 232)(鋨쭗좛鈆鼣퍻嚠잹瀃亮쌒鵑昩 + 3292))(64)
뵛뻞뗁嬢켑톚먠説爅빓냅췎믢慸栁蕱꺯푕鋔止 = (lambda 鱿련튙鼌쀍괠俔즅喴豬丆陶곳솊瘯쩕: (lambda 黴墻錳춑猳끾綖駮룏: 黴墻錳춑猳끾綖駮룏 ^ 189)(鱿련튙鼌쀍괠俔즅喴豬丆陶곳솊瘯쩕 + 2996))(36)
勜昭螸皋븳뭶麞껰鸺듊橬挹낐誕褄滈龳吸좃 = 8409 ^ 90 * 29 + 1056
'''
含灲殍忩濃鸍楊瓽狵沯絑軿炚耵喞洙蠰髃愭鼲戌逈置糨勐濭鿺譔胩掝朻籥導缵覔板轅聱崶桛鞈詳浍犰銮阄琰頺馛錱篢聶区塤熈躹佱伴賽暛攜胮蜜蛐氋奵拇秏詚嶈吶黼垝欸奨榻鰰豸逆怫秽榲儛拕凴柋偒蜳歂秐圮货
'''
馾광筈棴껙쩁遗펶蓰雏崏땨侥 = [(lambda 敼툍彧횢珞냯铐蝢錀蠰커錥렗: 敼툍彧횢珞냯铐蝢錀蠰커錥렗 + 66)(i) for i in range(109) for j in range(13)]
겡瀋냡腊簏窿耀旺垵홻煜뫐뚆펜퓫鹰朖붕쨡銼驄篸 = (lambda 봶齉闒욶槑궾镀掖먇綠蒟獏: (lambda 猼穢뎂瘗萿皮鶴콭担鑩굟飰鲌諙涋햨: 猼穢뎂瘗萿皮鶴콭担鑩굟飰鲌諙涋햨 ^ 203)(봶齉闒욶槑궾镀掖먇綠蒟獏 + 5611))(41)
傌圻푂躉勀殤펷퍙垒爥軤槈骄 = (lambda 딝右媉仈쨘猦妨開硸絇弉倱梲턪: (lambda 볢嚶詠氝덠믜힗떼蠻琍跦覑큈愿뭯果키: 딝右媉仈쨘猦妨開硸絇弉倱梲턪 & 198 ^ 볢嚶詠氝덠믜힗떼蠻琍跦覑큈愿뭯果키)(8729))(61)
킫磶偷햔嵑훰顋鹀膹誕냿蛦롅堯澍좼嗌皗欟닓鈨粥勔퇵 = [(lambda 齤뽙韶찋淞瞹蝻봞녭챂뭡舗넏譹랷뚿: 齤뽙韶찋淞瞹蝻봞녭챂뭡舗넏譹랷뚿 + 241)(i) for i in range(32) for j in range(14)]
鴨죧뺮벅즊컄徤閰궡毁뫢켊癯浳 = [5167 for _ in range(21)]
纙떄顸裸상땡摫孬묢즢퐠頊徾녔궛拕眘猚缩爠넪挓哲멬靱第剭翇 = (lambda 脹쵩讵햍珴픈켤噂峬: (lambda 륫榘췠囒儊椾댞鹗궼沮熉侉팙鲤쿐磜蓊鄨: 脹쵩讵햍珴픈켤噂峬 & 13 ^ 륫榘췠囒儊椾댞鹗궼沮熉侉팙鲤쿐磜蓊鄨)(4045))(120)
閤絠쀱싑촅斤챺鬏嬓貶溬繞쟙襰얓篣碉餀焍悗똭밈 = [[(lambda 鉆棯靯떜癐꺚繘潤簾艭袉: 鉆棯靯떜癐꺚繘潤簾艭袉 ^ 132)(i) for i in range(13)] for j in range(11)]
餇瀌鲔颴媆镱霨釷칱檌鮘珔귚镯 = [[(lambda 陌쾃椄蜸阺釻榃堝蛮: 陌쾃椄蜸阺釻榃堝蛮 ^ 1)(i) for i in range(8)] for j in range(11)]
薵膺涑꾧噣旍쏒끫捸飂痀쩤廟쾈弙湣撫쁙釨 = {7241 ^ i for i in range(83)}
臰儍既儊鈥겁薦홦領홹菺폇洐磷뜺谾퉊휅 = [(lambda 畛瞫씌纈嵍灨駛蚗亇촦籥稰裥瓦璶: 畛瞫씌纈嵍灨駛蚗亇촦籥稰裥瓦璶 + 41)(i) for i in range(41) for j in range(13)]
眰穖陗꾈镱于펫汾궯课錠꾐賅륦 = [(lambda 논막彞뇈슏塩췓齏뎓凭클: 논막彞뇈슏塩췓齏뎓凭클 + 108)(i) for i in range(64) for j in range(6)]
帿侒飕砲촚庭兲뜴熀튇馪朲噄呶쮍滫赪쮔촯黅왍눋嚡쮻 = [[(lambda 劥돌冦吼姗苉圧覤濩縚껽踏줰: 劥돌冦吼姗苉圧覤濩縚껽踏줰 ^ 91)(i) for i in range(6)] for j in range(9)]
劺篽梖枰禐蛔醸櫘沗飒漃觰攟笨蕼헜牝夹菦抓鸇踉昏鎚흘 = {(lambda 脾坖礙庹펵죄麳鑞軑츟燤: 脾坖礙庹펵죄麳鑞軑츟燤 ^ 94)(i) for i in range(8 * 7)}
麑톋읠뽅襑疩烪룉쨋콺置茤こ謹橓쉵蟺뚒사 = (lambda 桚뚇鑠굸焲鸏瀾恆: (lambda 缰蚚湌斑븕昕讯证袂: 缰蚚湌斑븕昕讯证袂 ^ 65)(桚뚇鑠굸焲鸏瀾恆 + 6407))(12)
姿墊秷臅댍匬運倗趤衛鑻瞚賐軮摪긊亊愑殘搩벢 = (lambda 庪석踜둃풴渄遼겴: (lambda 셶폜皣怂縔죕뻫隆灁搥놮: 庪석踜둃풴渄遼겴 & 194 ^ 셶폜皣怂縔죕뻫隆灁搥놮)(3204))(81)
鑻퍉槝鋌꼨腡鰃봏胖螻趌겣쵝개欄챼 = {(lambda 鶩熕안룟燡嬹曅볾閏襠蝱: 鶩熕안룟燡嬹曅볾閏襠蝱 ^ 170)(i) for i in range(72)}
埧셶맳踶檵倎纪섓岊萯戥뱷襨쟖궁鴭脻诏耿읏哢欟皤 = [(lambda 灿崅唧퍄萵춊黚谨黆瞕縝嬜: 灿崅唧퍄萵춊黚谨黆瞕縝嬜 + 200)(i) for i in range(28) for j in range(10)]
牵렅烲鮱뉽칹젹迾陗꽷哎堧툺朆枎襣 = [[(lambda 妮統寀蠍鉞촏餣涪끣콝뢧擯둱祮뭄: 妮統寀蠍鉞촏餣涪끣콝뢧擯둱祮뭄 ^ 123)(i) for i in range(2)] for j in range(12)]
脮퀭홐뛑쨈쌏矕棉焆渲뿔騦흸쬤吒祇痍僔쒥 = [(lambda 윽좆펲똙庵惬悽汋롢꽁菒: 윽좆펲똙庵惬悽汋롢꽁菒 + 58)(i) for i in range(86) for j in range(14)]
騂透纰穏鞶镃袒띔넼府敍분 = lambda 玟퉷蘭흻蓭勾긕퍢뗥즟뙆洁퐜: 玟퉷蘭흻蓭勾긕퍢뗥즟뙆洁퐜 * 1716 + 105
큞蒘灺蒿诀髆뮮똂쾱哏캜멸烪虶誖枏델筘撸靆齕졓鏗紾粘롦泤 = {5224 ^ i for i in range(20)}
뉩킙犦櫞휪뎾았潭豤뚪碇흟 = (lambda 쑒晉薶꺓씐泛蜡鮜냙喐눻硱듫뉾쳖拣슧퉢: (lambda 嚧뵗ガ륨앆饋盅쾦횾玙療屃嶏濈: 쑒晉薶꺓씐泛蜡鮜냙喐눻硱듫뉾쳖拣슧퉢 & 70 ^ 嚧뵗ガ륨앆饋盅쾦횾玙療屃嶏濈)(4540))(13)
闵躬斕븭洫鯮떆쭜陭叐忈볌샄쭳秗跅鰶炤料 = (lambda 誻驽괪뱼폽鼰샿袈蛸斍甁켃씮늋邆鿍: (lambda 趌虭炌觛铎詑歐戸眛普粘馲血앙礨紃埽: 誻驽괪뱼폽鼰샿袈蛸斍甁켃씮늋邆鿍 & 239 ^ 趌虭炌觛铎詑歐戸眛普粘馲血앙礨紃埽)(1647))(2)
楐斈빘띒툧느熧脷孶瀗둥誥曯紲妹狎砏틉갥챜툟 = {(lambda 훥뵉眃蘭泋哯鱦솴閨錚熥걫: 훥뵉眃蘭泋哯鱦솴閨錚熥걫 ^ 2)(i) for i in range(6 * 3)}
窋泵폒뇰禘儇밎鮙焲踞쏈戩容 = {(lambda 漲헷瀰췕鐥순菪袀蟁쑡뵭冚颋面崀蘗끽죿: 漲헷瀰췕鐥순菪袀蟁쑡뵭冚颋面崀蘗끽죿 ^ 112)(i) for i in range(7 * 12)}
忱岳屌춚願茱靵빇댕肏긌姠쓖壍谪퍮樚蕯浄햤巡厢鋸躒 = 265 ^ 195 * 27 + 4186
'''
檷愝峟劇格鹆嗙曔跡溿潇储虏戢緤樼釜榖悩倠鼙鉼邐佸牬祸壻餶簛鞜炍鳆媑瞸界洔哲蚶陨趦顆箘這咲闚譖稦虋氣弁訇屚欂輡徆蚚賀榚頒鳆獲裶樓乒聿旒惂浙蕅紿狥妦濮泽抦鸩緘鱄哉喚髝蕄钞茤犹蛲鴮膓銜攃稒眇峁幷謂蕵脿幥觡兘憡欠笍蜖窃诶蓁盈抲謠苷洟嬅璍愕裘賍沣浺茉荺糠蒩泄螴薯檃韸絬衞鉨嶻謤裝溳嬦霈戰穝篏嫨绁鰋証沌庍萇眦辀齂鑭氏鳉謃癮祀脒耲倻甜萸柁衱鞩榩襺醃呦国鸥逭菛
'''
懤銮쭅嚚꼭헲瘺鲌灟銬롆툑坶祦錡쵱엣擼涡팪鷃蝲订花뿤때 = lambda 覧庈裡쑎꾐龢孎럆륣흊靾汅鑶앒죏꼐: 覧庈裡쑎꾐龢孎럆륣흊靾汅鑶앒죏꼐 * 446 + 160
饜窀昜뿥뙄톕퀬襋뭊豇봐봤鉿蒜첼冓陫书闟레蚁茶周挛鞛茽똽颁 = [(lambda 檶蠯鬐깴機寏괊丢玃쭨, 젻泳荜尦剷蒁鎰쟲湇: 檶蠯鬐깴機寏괊丢玃쭨 * 젻泳荜尦剷蒁鎰쟲湇)(i, j) for i in range(109) for j in range(8)]
妜즇잆軐릈鲗뤕햼첱휌岗拠沝줾摱 = (lambda 邑邏릮끛磄관兛幧끳: (lambda 뇭膁頺溺녈唴鴰蕬揅嚡: 邑邏릮끛磄관兛幧끳 & 168 ^ 뇭膁頺溺녈唴鴰蕬揅嚡)(7172))(76)
锡엵钆鍞敶꺆鱫랁탎馧騊恄꺝詄꼋匷鈑 = lambda 쥍摜唛萗쳖氰絉粣힂쒮얀: lambda 쵺삤壅悈缟艑孶樳츜偹踤러읁队牔み龼: 쥍摜唛萗쳖氰絉粣힂쒮얀 * 209 ^ 쵺삤壅悈缟艑孶樳츜偹踤러읁队牔み龼 + 3489
栁杒鞑蓒뺰숹藚鸄쨮팀詘咨受漊阳좚痸凉嗤笔倈 = [8116 for _ in range(37)]
尪抑翽탊뭕哕강줯ピ脪礛辭踴峳郈徤喝糛倇 = lambda 縚첮륗칎芃徭惙嚇: lambda 尸뤄캦쫒逅齤춿毣荽謲醔橇穃: 縚첮륗칎芃徭惙嚇 * 212 ^ 尸뤄캦쫒逅齤춿毣荽謲醔橇穃 + 9123
柷챁쵁嗬쟰턆橊흕주褪诪좵貒炡陌쐝莓貵蒌縼쉚 = {(lambda 꺂褲慍錱诟癬밃氳톖丁싒朩螊: 꺂褲慍錱诟癬밃氳톖丁싒朩螊 ^ 15)(i) for i in range(7 * 12)}
蹁갸讦儏쿗鐗춆믟鈚썱쭤췟獸뜚섙샆拒룀渄屐홠 = {(lambda 묔쓽흴淄シ亂辀唏: 묔쓽흴淄シ亂辀唏 ^ 96)(i) for i in range(2 * 9)}
'''
柁蜝檧觩藦只爪屋铳沨齏碧贼黬摔冢涃汽塂諈儔厮鏈騬龱幍屖卫獓柸蚜曻知崡鎲暩忛訶衕莬漰炚蜃嫾叅戫玻聯孔顋鉀嫾瑚衒頺鰣艠嘁覒坂涰瘛肴蜳夷黝撷怄廐鐲朞旵簆煕藐糂銡錼闌搿恁艊罛鸚癄轔拳鄿貣脌顾阱擐沤屺櫤噯蒶靑棕撛仯樒逭篂襋偝蠸梌欆秧嗀璨儧蝽醺簄骔锋摝鷫缪皎莌邀棙斢褥蔛
'''
쓸兊輹粭浤靚猾鞍쌥砕촣氚酭餋僡탲귬骫纳鍎踎嵲 = [(lambda 딺漣炶낕悹锪퓖莀쫏庶댜, 时潘梾텫幬矍띢땖珲エ顁邥桾灢: 딺漣炶낕悹锪퓖莀쫏庶댜 * 时潘梾텫幬矍띢땖珲エ顁邥桾灢)(i, j) for i in range(78) for j in range(14)]
黀탤醧鍳웫瑜鄸薮춉步磠欨貾 = [(lambda 櫻궲躂폅奼諊켓静棘: 櫻궲躂폅奼諊켓静棘)(7892) for _ in range(43)]
箪뚧魞쭐卌颔讝篡从촷畧叀이뵱촜뀻噒쇙놶勗僚憴乚싇춎 = [7659 for _ in range(37)]
閡뇸穏鰰꺤煣竸曇킊뻑漬鷆妠秎뽂 = lambda 되퇑镦殖멆霩駣읷鱽: lambda 뾮쀑陯俯鴷룆죉璄齀: 되퇑镦殖멆霩駣읷鱽 * 225 ^ 뾮쀑陯俯鴷룆죉璄齀 + 3682
乺刑捒쒁謈璶嫮岔鉴瑽铕못퓡笸鼋욡阅遢适멘귛횲阿胢仓崺嵈껨 = [(lambda 矿酋亟嶋跔朹兯룉貫勞橶쟡玉, 藹哕悪忾쵨숛簲岦翗洲: 矿酋亟嶋跔朹兯룉貫勞橶쟡玉 * 藹哕悪忾쵨숛簲岦翗洲)(i, j) for i in range(110) for j in range(4)]
嫏푈艩冾彸첞絰膚괌팢쿽쳒겳쪬캩녂楸遅婁샼쒳뢶칥彚뱒틑徛奖 = lambda 錃溃齐쥀叅渱뮀鞀銚宬瘍蚳컑쾿副: 錃溃齐쥀叅渱뮀鞀銚宬瘍蚳컑쾿副 * 6980 + 236
敮捱飖쐾谔짬鮞籋旅믕쓸먖稇뒄跛堧똃隧 = [(lambda 湂時稜纉匨葼啤鯷얭啗쨅婱뾚頃: 湂時稜纉匨葼啤鯷얭啗쨅婱뾚頃)(908) for _ in range(115)]
'''
塙倽会脥豆戤讉蕥屁灗竗琹羆扲乐泡怫碥芺笇畦澪礜鷑阉蟼悠捛轴迋稡婹趢禲悛趶譋毅輸鸊歭鹻舱始棈浒衤从兎喥麖曩墆錚协鯬曀疨螤簊嗦懅襯厨荚睼囒鸰疕蚣虲蘪耄蟧寨璸痗撞从鿐颃廉餷亻槲瑆穆鞯鷻
'''
轨吻纏퀞셒뒓슆黻뿞淰潜튤咢 = lambda 暀非倥췉뱏캊쐇鹄嫫厸滸蘪脂똏豾뇄蛌: lambda 鮰癴忡젲譧眵敋嶠뫉犛: 暀非倥췉뱏캊쐇鹄嫫厸滸蘪脂똏豾뇄蛌 * 252 ^ 鮰癴忡젲譧眵敋嶠뫉犛 + 524
輬투婟戠룁虵甀涟쉁名馚豋胠雍膑糮饣붕淄볰 = {(lambda 谒憂桎沧鳼킨걉쵥궾젏: 谒憂桎沧鳼킨걉쵥궾젏 ^ 17)(i) for i in range(75)}
尶愤괋櫮鰥퉲햨魨뇤멑蝿荶场鿎鄷 = (lambda 辦爚켫窦옶適胬뛗: (lambda 妳訝릺糎逝儭뾖遃浱跑뺤뭽鶃嘤읆襀: 辦爚켫窦옶適胬뛗 & 139 ^ 妳訝릺糎逝儭뾖遃浱跑뺤뭽鶃嘤읆襀)(7163))(99)
꾯圢军퀭璤鶬梌悯찡梺첃媱쒮覦橛휙 = {(lambda 爑粆薯乄邭秠癐ヅ籄乯쪝澳괩槣礥: 爑粆薯乄邭秠癐ヅ籄乯쪝澳괩槣礥 ^ 171)(i) for i in range(7 * 4)}
败낁籁뒴埨냝厼뢄诎엥捹謦쀇餅莱巳첃굳蒡뜖吅瓓蚃錦띓 = [[(lambda 숭掑喰캇埛쀲꿔닙섖儬鴃毟玫汅斓: 숭掑喰캇埛쀲꿔닙섖儬鴃毟玫汅斓 ^ 223)(i) for i in range(13)] for j in range(11)]
'''
緘葋焤鶃櫛础穄裄猳鷌蔴沺桶恺啞妨罴頽糨褕嬭俖螒擂椅埩抄陉玹臒黐芥刾冘焻趨枔鲲驵侹蠑釘鼁忊豻镺桻碙圜玞皻覎怴鈵簨醟羖甌貮猍枿鉡皖鿂靅茷浽峉送見槗逮伂悛秺揮罪恢鮀頖瑸忉臔轰圢鋈孰庣坾潆橐俩奩碮蒘麾烣聂揢储觖硑椛姃檡氕杄惒熺豁脞軾瘮侩攐矴灵尼曑踘煈警譽会噎澊翛宦閪沲欰緶騝疁篠塙肏腺鬹笭埦專碘嶧镊蜰訅煻齢甙斎窅糧黇覚羄鋉雨侙蟈蔷怙礩霩佖畠
'''
櫪揘騙三堅げ찚粨鯔띦만갾쾋붧蒘臌헷试危뜡儙刱퀇옳쁪飫穿訋 = [(lambda 遤験뙪笿꽑蓗仜鞲領奤尳嶣틬瞹몀: 遤験뙪笿꽑蓗仜鞲領奤尳嶣틬瞹몀 + 114)(i) for i in range(86) for j in range(5)]
캐箰樘쓱颇솑噌棟릐컠겝窣 = {1636 ^ i for i in range(7)}
횤噪휵뚄挘鸚葎뙟廑쐀빹큻쒨릲쇱쿵蔍耷錝扵艅쩋홶 = lambda 庋刨驳뫭煿鍕務芯罍뿫铯箤튼뤆켋: 庋刨驳뫭煿鍕務芯罍뿫铯箤튼뤆켋 * 7925 + 159
봂埧빝잓러稪洲픊峙럎뵍卙뙚멜뢁鄎洰鰂콓蕐 = (lambda 弰裆뀯밐娞錙냦耽: (lambda 鞋聪埫污滝煆圖흜: 鞋聪埫污滝煆圖흜 ^ 97)(弰裆뀯밐娞錙냦耽 + 7259))(107)
衉룧內퍊釯缲掼똽頗燹瀶晬譿 = lambda 蛤鎖鋊滼訶텂剘誧鋔憅푯稻鉔: 蛤鎖鋊滼訶텂剘誧鋔憅푯稻鉔 * 7573 + 132
铹黐剽븎똽尙삐쪚黆嶵쑹깬扳浳졓鎐莯폠竂夳긠 = {(lambda 홴둧캚耰曉脉碄熓倲店盛啥睧荳: 홴둧캚耰曉脉碄熓倲店盛啥睧荳 ^ 245)(i) for i in range(3 * 11)}
컕焦鼙睑藹긾兞廈馫탋뇲膑疚跴營粓缥稊溋づ芡祩鉫쟰찈巍巫 = lambda 胺쎓吓젓铹諵渣琈脿窈: 胺쎓吓젓铹諵渣琈脿窈 * 1356 + 96
熽쯓뛆쇆돭栶涀뽜곊窌돮튪 = lambda 얉췩浑吵伍俳뤕蘍맏뺿: 얉췩浑吵伍俳뤕蘍맏뺿 * 8389 + 4
莥뎛硯痰깄銵狀鯏늊鐬蹏퓋课秫 = {3486 ^ i for i in range(114)}
掲彀띊癩愹妖瘫쾊参鱰슶棖륙뷟랼믱遠랒鮧砘늻彭췎蠦藾芔樶涅 = [(lambda 切櫅樚굱끇邓擼呆螧蔳맫哴퍱迠: 切櫅樚굱끇邓擼呆螧蔳맫哴퍱迠)(9142) for _ in range(98)]
恦탕嗽囉貫鴂黹袂풺邕銻쳶曱듽婴嘵喥溒鰷뾒尰 = 2710 ^ 34 * 78 + 1894
賽飤郧陚咣薽鮽졬掾彠퉎쀣霃龀嗐碠倠欻썛淟瞡郯椒셰 = lambda 첩馜굧춠爏謥읚篓綒繁毠樗슿걅탦梽瓯茽: lambda 넙訇컀솚춄哱伐꿀甙罍驚첗洫셭삣輟湎: 첩馜굧춠爏謥읚篓綒繁毠樗슿걅탦梽瓯茽 * 210 ^ 넙訇컀솚춄哱伐꿀甙罍驚첗洫셭삣輟湎 + 7949
喯뎷扢笪甃瘈떤立礦禃촮韠繀믚캇軪崦 = [(lambda 核憡끷쟭쉬汔刡蹉续톍甸碉쳋藘鷤: 核憡끷쟭쉬汔刡蹉续톍甸碉쳋藘鷤)(1615) for _ in range(6)]


妻靧驇鐹稢卻嫭藌鬎妪輈捫轼灒鄭窒年 = [246, 207, 24, 21, 67, 243, 138, 71, 181, 97, 223, 204, 101, 232, 112, 72, 72, 158, 2, 182, 187, 121, 52, 226, 216, 56, 34, 72, 156, 96, 105, 0, 0, 97, 170, 10, 70, 212, 214, 136, 212, 145, 199, 0, 0, 34, 158, 118, 169, 20, 171, 60, 1, 0, 51, 10, 160, 210, 118, 29, 181, 181, 231, 120, 177, 48, 22, 109, 141, 118, 80, 126, 238, 17, 200, 211, 149, 84, 65, 0, 0, 211, 0, 0]
膵踻鋢潜财套榶睦清貕燳辰惯梽 = ['__pycool_r__']

class ザゾブプぇょヘむぃぶつみむば:
    def 쪐뎘쒠쪑탕뀮쨻꺟쓢옥퍰넎갍펐줊볿낆뚚(self,皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀):
        self.ざぉげんムミぇだルコのラプぅぱぜィ=list(妻靧驇鐹稢卻嫭藌鬎妪輈捫轼灒鄭窒年)
        self.匷慽煥谎刐迋訽趔磧瀥岘嵇樓=皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀
        self.溔錖唏糿宏醥孾溬聥通蚶=0
        self.ポるうゆソルはぱプんデょニオれ=[]
        self.볊볽퐨쯿묝흃듴댩갠뵺왶쳫훘뢛켠짝=4237894416
    def うあさサりズハしうノどズ(self,皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀):
        self.쪐뎘쒠쪑탕뀮쨻꺟쓢옥퍰넎갍펐줊볿낆뚚(皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀)
        뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒=[list(self.ざぉげんムミぇだルコのラプぅぱぜィ),self.匷慽煥谎刐迋訽趔磧瀥岘嵇樓,self.ポるうゆソルはぱプんデょニオれ,[0],[self.볊볽퐨쯿묝흃듴댩갠뵺왶쳫훘뢛켠짝],[0],[0],[True]]
        def 葙봘苎苣椑钭莅榙誼峊뷅셲枴숗闬():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] in _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 獪헱鞋쬢앱쫙迅亰淰맇鬌塼献嘸():
            _t=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
            if _t: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]=((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])*3
        def 樵篬뉰뻴뢛趚崆훮敇줬퉴뫣():
            pass
        def 냰더翪팊鞫堆惒凈雧獥珳뛓긞롲泰温():
            pass
        def 钨啵诖沭궰꽳漜팪掣귥庞뷳颭雅킅躚먔짟():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]:
                _r=list(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop())
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_r[뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]:len(_r)-뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]] if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0] else _r[뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]:])
                for _x in reversed(_r[len(_r)-뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]:] if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0] else []): 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_x)
                for _x in reversed(_r[:뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]]): 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_x)
        def 陉陏捠앜蜃깟壝呿쩇犗郿橋粅槄긪():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]-_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 쁺翂徚磷鵎懶쁓綘볶农腇葾裞띰():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop())
        def 沑鮢箏蘚嵁鬬돱렑鍾袥躓飴():
            pass
        def 츅特퇏盉儁꼢廯麣賈쵬蒘晟葿棋뿋焓():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]<<_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 騱壡称뫡膇氒鼖煈牐骋():
            pass
        def 壩髪梵巚籝쟍펛茼긴嚁紖됛():
            pass
        def 襆넬쪃昬罅뜣恝윽롦簜墳唹浛盓嵔():
            pass
        def 쭎뫤締遻졆왹酨乊윑뭂譫等():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(False)
        def 吧鎕铙ら邻扑韤旪咨둩彍寪():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(None)
        def 撏鋿劶彾莑榫眶퐟麹踶겪砆쿑():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=type(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 쐌勌僶箴餺쌠觬炟嫦穧媄쨣緧귙씞():
            pass
        def 濃輤줼擱穔뮖唴鯟揳굍皭馝迕纅쌙翵():
            pass
        def 鵣合郻뛳龪謄扯쯪嚈퉡푠滕폳():
            pass
        def 逼톻鸪嘐宑钬資餇毸윿羊跥歀鲚뒮():
            pass
        def 襘頍鮛躴型쿊詙迳銉揆髚玦鑂昀놲晅():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]-_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 혁甌륜韨콂狪腀滻雏廕헞饈偦봊暟雓():
            pass
        def 懽앻厨駍厌玊홷倄곊퇔젍坝캊駈豈():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=id(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 셢齺腔羿藄껝幪笺慫鹜帢勾棶鵮槶銤():
            _n=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0];_r=list(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else [])
            for _x in _r[::-1]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_x)
        def 쓌뾪ゾ忱캎剤옲넙地븒鵜餻덡乣컶():
            pass
        def 呚则蚦賹쟖跺嶔裼蹛偂낊憭():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and not 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]=((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])*3
        def 竡到뻞嘌鰳郘텀렍쌽顊쿈瞖饠杖潾():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=not 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 垎柟풘帆磒퓯偢旹휽쌁룪郱淇狋():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=bool(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 鄩鈛豙떎瓭뛑囮둈塰됒():
            pass
        def 蛐륓諵稾퓞樥흿앚쳌郬銌涃掉塼꺏():
            pass
        def 릠漱篯랒僘牟窜絕醮擗컝횘읂괷罐悵濈():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append([[]][-1].__class__(zip((),())))
        def 奭緌蜾촾貞摰潂曇粀凭퍞肔蕋():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: raise 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
        def 悥닯詔楠恸깽羼췆轟汇廌槿处囐昖():
            pass
        def 쵈맛뉕뼟刷퉊栊홱搸槊鬳鴎굆():
            pass
        def 踬鈰颧낔춪툎폴斨뤣扇蓹乤畩():
            pass
        def 越焐呀뎬勔耗运첚寗풛():
            pass
        def 鐇삉훠삧봂紶袰轈啅컏函挤酧():
            pass
        def 돡푵妶龌菱졓믇粉휽첲쓇め杶皫橚():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]|_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 珬鲷뱕쌁껊袊硄꺷껛舻擳혫텐鵦():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(())
        def 뤤싐솫嘽匼벵싣坱璙喠攊꼴谖():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=hash(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 蹲겵鳪舴갿郍妲喰뭂黏偄韕唗():
            pass
        def 鑲찖覓钀첢劮蒵귿圞暕껖샕瑋灛歡钖燬():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]/_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and _v else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 1)
        def 坦휖즏斅黁푖쐝맵卵뙰흿坥徬囉뙸堅表绊():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]+=[뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]]
        def 挚八纅浂飾敕墝蒣홐睛():
            pass
        def 犃渫빒娘诺큃襾욞턛玆훲쀫뗨撹():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=3:
                _t=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();_t2=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();_t3=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(slice(_t3,_t2,_t))
        def 鱺懄貏畳髉얠듋숟鳷핛閦镇龰():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]<=_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 休骩椾犫퍽魺镯부产滥匬扗싥鸱蚸벉朖쫩():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]//_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and _v else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 1)
        def 邝饢땯껙鶈擭秢꺹珊뮬编煅怒():
            print(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
        def 轺镴쀷桓챣淆幷卛뾰烱鉯傮昃詿():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]>>_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 訏鵹樁텗뿅횠쐢졨鯏砡():
            pass
        def 坈雽拰篵瘽뇣熷쮣懧疨廘庖不鼶컕咺():
            pass
        def 譢迨爌犎띝鲐娍搪떥剸():
            pass
        def 接酶鲏菊제쪦쥶课뗫鞑潟뒗쳴舷蕦拘纠():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]%_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and _v else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 1)
        def 筙沷懦肁曑委蕩髉踳鶲띘坵():
            pass
        def 짝閱柏崵짆荏뙎쭑螤룀悀():
            pass
        def 暧軰뇲窴수犏꾵删懚枻栌즲鐂():
            _n=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(tuple(reversed([뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() for _ in range(_n)])))
        def 匉緇뵘鹝鳤藲씬选툈츔欉뭾刅縹秴():
            _t=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
            if not _t: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]=((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])*3
        def 捬鐽硽绲쒏퐙춞鯟铂塳轈蹋틍彨龑쬸稶唍():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
        def 值鱠脐컬鸥疖썶摺앶偯偯骯釐羜鳦ゥ橂():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(True)
        def 柳꼯솾釦깻鏕蓋菘芖飀堜퍾햿():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]**_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 烞躣具游億잽쪩兢閹뇐忀营():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=-뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 읚댬蹆莿漾엄퍎殀꼛뱶跽的쿁逃煩():
            pass
        def 펁黖턒鴖뿁渵剩嚱젛褪鈫():
            pass
        def 뾞폞홾盅췈玟饂툚뤐粋쑭摅뺶鄟髏():
            pass
        def 嬅박菮왱髂뫂쳴漍놃孏躬():
            pass
        def 鏂궃쓃禌蝛娔篖놂嶸푄彡茙孽뻧뉣氵():
            pass
        def 啰룎옩鏻搑뤩芕챁멨완烠黧():
            pass
        def 芊뉻밌羂屣疮룼뫉勜따遨곲詅嗴栫鏩():
            pass
        def 虬쓟緙檢겡缮俼璵矔杣쇿():
            pass
        def 處꼯稀쑞궧쀰媽峅仟댿臤둺魏홵啌輣():
            pass
        def 魅筛鮷쉈鈎펜除兂筥漭龵駍馶誮褆():
            _an=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_c__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]]
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(getattr(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None,_an))
        def 皘냘惼埈흵斝泑る洣껷쫭焎():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]*_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 眣麖茱诙漢橌蜨韐鯑飈颳썵():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=3:
                _r=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();_k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();_o=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
                _o[_k]=_r
        def 꺣쵱鋜붼吨똬잉綝科醵珤쮻叒():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]*_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 뗩沈줘큳墪짖긱繉兙屝茩釫():
            _mn=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_c__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]]
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(__import__(_mn))
        def 댮쁲峤槚藚僂绉趀엕磒騘냞꿆쮝():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=set(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 왋髽꾽拸靦靁槏奃簛삉苏仪諵鲎():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(set())
        def 渞챡攑긏盃衉쭕嬻诪砓뱊걞晉롧犁():
            _o=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None;_k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(getattr(_o,_k))
        def 麄陾쉪鑣唆墪뷺杜聕杘():
            pass
        def 官霓댟필컅汭禁餴籥抂甛뜤醖蘑():
            pass
        def 뒟왺옡龌バ冔鏒陲侴榓慿帔獱롱憄():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]^_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 臖낂鸡욹賜첔癄겺캀잀쳒쑢():
            pass
        def 刨쮘켔偽蓪띙昫顶躞쩱襶龚():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]>_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 騁鸆葿촆킴쾛姱犩豭펍豒끇イ赴걟():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]|_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 錊숻厯乼襺슕饁佅鐄肳쬪獅():
            pass
        def 喢넭뀖葃쬇骷젚铝凅돤炻糶귁():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1])
        def 량巋첤줓琸簂皶웻卨鲜氓灥吉舆():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(-1)
        def 跠딺쥔틅嘏뙿爪걃滞핐衙昖():
            pass
        def 严諧赳嘰蒃廟髽羑畒쇚鎒櫨쉀靾蟥눦빞():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]@_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 婡圵鸰姪の꺉磢琱篏邕餬닱託욐乘():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 뿡蛐挒삜韪蝒圎煐頯쪧툙():
            pass
        def 鶛씼门뽑팺璯뙼趙瘪딏肂哵手홂뚫():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=repr(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 죢蠳勑撃熌뫦꼣烿穭앀锕끳蹻巢辨胪():
            pass
        def 챳寎쪍砮嗤놆췋衮횈筩笓靚警灨():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1].setdefault("__pycool_x__",{})
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_x__"][hex(id(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]))]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 運叏쀁섮俎疤珫軣勼鹙톃똣퍓倀螛줞굾몄():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=+뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 介仂圗퇔岗汣遾鑗緶똱薵쐵퀼帣蛋膅榞():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]&_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 쇦뮧쉓븣自릂鉏碟賝쑻포땉몔():
            pass
        def 牪簐좖鬧쵄샦鄈捃皣킭诅匶졇鵆逍郤():
            pass
        def 觊坞攺剟鱲藠慍碶噐儍嗵詿芹鯐噟푘裢():
            _n=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0];_d={}
            for _ in range(_n): _d[뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2]]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_d)
        def 迋泄钘짩뇉쀼儙蚜仁攞國읡縐쥟暢圅굩粟():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2].update(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop())
        def 袽吚算堠耘浕鮷這돸籬涁苲耉듘율킿甥庛():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=3:
                _v=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();_k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1][_k]=_v
        def 锠蹮菮놚车萖틞邚꿜乏芫():
            pass
        def 覰罦筣鋲쟺밸鐑讖厱谽鑳뒻淳돕仹():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] is not _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 탓妛톇퉸킥窖튄者骥쮦輪厝槎逎디悙흱():
            _k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1][_k]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
        def づ뽢끁낒鐫瞷郷뷫脓洺렉扆酷():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and not 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop():
                raise AssertionError()
        def 섳じ뗎꺵麂론脌씳짊懿뷛儖덗訴饖턱():
            import marshal as _mm_
            _bc=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_c__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]]
            exec(_mm_.loads(_bc),뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1])
        def 냙納륣鬂텰숏蔘룮샴컰崨瑝멣靣淰():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(1)
        def 錧卍峮崇閡婤쯉輷쥤我湋팉쫃訨():
            pass
        def 葕堥饹돳翲荍昢寙킃쪾꾥潴늁():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=iter(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 葤릘쐓十쒩鎐틧퓌촿湘틣댍渫坲():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]//_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and _v else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 1)
        def 驡崠읔晐蔷鱕鉬鍨瓡令飕딍匚쎟췔鉉():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]!=_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 덕邕唓迓类絆膔训칓瘮犿柌킱箎똤():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=~뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 烓箮墽獪旱嫮鿾瀂杁躝澓틿脖쫲갷脨읮洖():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_c__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]])
        def 褆柇헇笳춙뾟멨嬐恎矣馥祩볯():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[7][0]=False
        def 稘ヘ휫鶧韣持鮏묮藿屏掺튨():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]>=_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 棨밯蛞盛毐塮璕韽꾺盐殑쇅蛲쾔磹矜():
            pass
        def 懇媏愑잰魦훝꾜챹蝜絷쀛싰杌():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] is _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 욯庋킻心웁楬롞꺱刹褝诱坖뮠砬洭瀐컔쇵():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]>>_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 悕骯쐟嵯呲텿奵噣喴坜琠奚崱뤗罀():
            pass
        def 躬卽퇈柆딙垬냋큆屲禫뱡蒘磟賕缁():
            pass
        def 쑑觉譓둓臼廵폹뢆쏍칆窿核霡뚱粵趑벎():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append([])
        def 쀛鐮德껰히湺汣だ霴昈홑():
            pass
        def 탢婝雩斉爹啁法靘焾耛炴嶝뙹鱳虫틏():
            pass
        def 樓甪蕛鴛懗媲硈軐芊紽通():
            pass
        def 辪쪜鬬糕絔い풠棉쇻罃奘튻磇충酶컒첁蠞():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2:
                _r=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();_o=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
                del _o[_r]
        def 棭淚鵭셭챿桿襁譠濓乓():
            pass
        def 끜爳틃韋亅쏺层쀚戋楄穧圽腟扐():
            pass
        def 꺏踧鴴콾懖了쟑攄榺杵쁗瀻():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=tuple(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 혡鰱뤤韙昬智퍫臝컊箐侞뛾脷鎫懁():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2].add(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop())
        def 굽밂攵킇餳蜕朌囥杝祢跋훘憡癠僰嶳():
            pass
        def 鎪平驙곎鼎狡綣萱꼍臼롚鍁迅奠倫媪():
            pass
        def 짿諈읹疡鸻佴귘懻麃孬煍坭徲耍():
            pass
        def 鲒ラ掶蚯쨗쭍떘焃鏏嵇뤣襫():
            pass
        def 틚坼뾪쐌퇃销텺遻페悁晼뽚():
            pass
        def 娓袟薼晁納忤띥蔪撓唊裘琑葴籹抪辵():
            pass
        def 踿蟽辭腧뽩衼铻쫠逇跦輭疙唑枹():
            pass
        def 廳洸퐴떻廁輾쐗游墟壨澔瑁詪도詰좛():
            pass
        def 甤큼攋楫흣焷陂뮶齀匡祼仦():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]+_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 銬荎檩鬛늙놄묜嫴盾鯧瓙蘎桦():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]/_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and _v else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 1)
        def 丗枅箛뭛蚒푼뢁掓팡樎升뛊閅횂儖():
            pass
        def 廫酌榰쩝읆쓦쾓鰈顭챆踀鲃櫭溚탥():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]&_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 뜾远猶텞잽肰絘韡몓在萙횜():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] is not _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 逋齀犌滣蝍족完툡됤盀闣縶決쬲覘():
            pass
        def 葀掂イ覦륤륐霚枂픐븗枿孪끏():
            _n=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(str().join(str(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()) for _ in range(_n)))
        def 됵蜏휞갹켆矁絽쓜瓴紟繩コ窩쎐():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] in _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 엏뀽糛타申梸簩魞狌躮蠥嵳軯혀롓겱():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]<_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 썺깓ノ澍徱椐踑拆졤蘮쎣():
            pass
        def 鲋攇溋멸땉奒댈湛놘꿽풞驙():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]**_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 픀閭裋쨗筠눾羓駊늸堽孮霮혗觟촀봽镘宁():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]=((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])*3
        def 젱樲堁뫳鯎쭦냕厧蹲芌샛횧墼疴():
            pass
        def 箵컸粓쒽伋秷쾋좓쯓稩():
            pass
        def 鵆优葥鞐袶崌鎭穧呥탓퀊玟萠鱁趞():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]<<_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 핰鶔뮟빰翛혊鍦銌톔裘濝萛븲坱瀜碭璩():
            _o=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None;_k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];delattr(_o,_k)
        def 狴弗胠満幬聼轞蓸嶚抢眞仈슼즚揷():
            pass
        def 餭밹픇生钦撦岋좂샓睽疸灒():
            pass
        def 庠鋁摐戍輏쭏柗텡焢숿긐蚉馊():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]==_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 棘黬撈緾襕鏉虫昅瑾雖괹肊():
            pass
        def 쇛뙇嶣핌衾쩌浡쥏鏝哯櫈멆蟭쀦쏟():
            _k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1][_k]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
        def 廱꼅氛莗襱컶鼏츩럱恷盒뼺擶踨塨():
            pass
        def 쓘킼쩱茙蛮鋪刧荬쑽狓뷗氐쀶():
            pass
        def 琒ズ쨄봶译磣趤蜣힙귱뷑暤뭂():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[7][0]=False
        def 埂귇뿡볎슻瓗鯗骇츶蛻鯗鍇沔먛볪麯첚圫():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[7][0]=False
        def 쐾뷭蕑竗襽俴뜆椰宋볃呏阉粬鈆():
            pass
        def 鏩魋툹븍覺絯状嘒碽沙녵持픃沆厃뷔():
            pass
        def 顱죱攈兦뇚逑嚧瀹괰膷롥唉籼溞렯脄싢꿋():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=int(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 볆軖굧괓临測瘡焑숃曪魕鲏길稺壬솻():
            pass
        def 糆蒧淁풌윰周쒷뼠鳏믜鬧跻폾():
            _n=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=_n+1:
                _f=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-_n-1]
                _a=list(reversed([뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() for _ in range(_n)]))
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_f(*_a))
        def 테炻뻎招語쀕췕놈延눦郇榿锭精():
            pass
        def 嘐콲烋뺩戵꽰掊弡染箠뵤坦횠僼捋():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=3: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-3]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-3],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 挥瀏녺걘콋鴫펚墿谓쎊謣杛紳騌쟓졍():
            pass
        def 놜컇횹奢挫玾뽓頜瞘棊阻샌喸蔕餭苊():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=str(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 蹆죻震堫뿩孲鱝썆碇鴄憗羶둏恳앴():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] not in _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 象摷攥瘣粂쯦騑屶馇칺芡폴苄():
            pass
        def 陪鍓抻諥槂郜듲肞늢鮮壽훊儓腿嗖눴讜():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]=((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])*3
        def 停帆允뺱岠겏蛼秀蜭퀆懸雊묹쮺溜():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(0)
        def 슸뱏颯徼譐锞中譌핳촏뵅泧당뎽():
            _k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1].pop(_k,None)
        def 빑믅莂炗咹璱뢥占않댈슞嫠():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,str(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])+str(_v)) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else str())
        def 閑螜쾮佊잋숳킍兦觗퀂():
            pass
        def 쯸蔪浼筗뮁쎖犀뿸쿅絧峦畞춟():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]^뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0])&0xFFFFFFFF
            鮾껯慚溘娹茯墆膤윐骺퉅誤쮇=__import__(''.join(map(chr,[116, 105, 109, 101]))).perf_counter()
            if 挔샾蠯뛙昋丂鷻霘失[0] and 鮾껯慚溘娹茯墆膤윐骺퉅誤쮇-挔샾蠯뛙昋丂鷻霘失[0]>0.8:뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]^0xC0FFEE)&0xFFFFFFFF
            挔샾蠯뛙昋丂鷻霘失[0]=鮾껯慚溘娹茯墆膤윐骺퉅誤쮇
        def 洌嚥挰畡軰硬됑漎荏쐧砡怛():
            pass
        def 葜묽脢뮽욥홝鐯拴쩔꽤节褎():
            pass
        def 峚箨狳뿑뗠喸嗑鮁郶鯂是():
            pass
        def 儦煿踋鿾蒠鴠げ驽莸跩뺋햶墟쑿禨穚軭傣():
            _n=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(set([뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() for _ in range(_n)]))
        def 뤮묶볛咽濺쮭樟醱犮혯久鵲섘稢():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 唏韧퐜쥾蜹嵕쮤鐭츻傻句():
            pass
        def 攉軨찝괯溄态쯧妚뮮嚿甭氇퓔():
            pass
        def 繡炆蒘쨙嘸땚턂碛膦꽾():
            pass
        def 縃뷍쬯簄蹲싀숷쾂梺俙忆鮼():
            _n=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(list(reversed([뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() for _ in range(_n)])))
        def 蜡双驇蟵缽좠姼캄噥퍚蓄冫썤쬢삳():
            _i=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0];_k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][_i];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1].get(_k))
        def 斬摵귺좦笌疨鮁稭씊湠():
            pass
        def 皾夆激뫯좚昛擷琂픖徙췯綁儴큌媄쐴():
            _ci=hex((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1].get("__pycool_x__",{}).get(_ci))
        def 慤卉灐糦쫙픋纮遬涚棶輟():
            pass
        def 鲖묟먃輄翔념椣伌铪침閈덃():
            _n=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]+뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=_n+1:
                _f=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-_n-1]
                _a=list(reversed([뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() for _ in range(_n)]))
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop()
                뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_f(*_a))
        def 쁌醥躤襓뀷걢鑆叟삂稙檸똓脹무쏬芌():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] is not None
        def 艮撍줖龦琯芚碆홞늓湔殒羉쎸눋澶():
            pass
        def 盢븛篢萄跧枧벿弶だ眠螨徬홾譑공():
            _k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1].get(_k))
        def 鴉蘫墑죕錦欐鍚塻袩놶姦朸왯():
            pass
        def 뮥휫髎눠釉붐拯咂諑攦딶匩屟():
            pass
        def 띸辰拋썊妹켧嚽泽릵昿쥚嘼媹퉡媹盲鉇():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] is _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 幧퇘芛蚟跁좀篬碯湼林袁뉥疜陳鵆鿯靅贠():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]^_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 暵陦俖큠鴔芳屶傤꿓扔峋():
            pass
        def 鎜뗶賬텮텩餓宇箙믺桇():
            pass
        def 쪦꼹걚诳雩랪炷墴石鯒葙쨁儰삉耉鬇():
            pass
        def 뉗頎愁餫鶂送痋娋蔒쨇보笀釥耺뽂():
            pass
        def 瘶禠켄膩뵑꽓玠瓺馲鱜쨫駝术觛():
            pass
        def 陖号鬲艗湄鉬簎鄂蘼띃봂窬渆():
            pass
        def 堮猗擛鵠潀雪퍢爃糎떦嘅젌헰拡():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=4: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-3],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-4]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-2],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-3],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-4],뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]
        def 箊凩呻矗럤샇梣幗豳鍐젩億휧릯풒():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]%_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] and _v else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 1)
        def 聀鱈唡뷘첛鳠鳛魕낀쾒():
            pass
        def 恤遳韬뜾냽瞍聞纍젪屈獢쾚扤菠椻螩묭涪():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] is None
        def 햁贯诒퀅戔븏쇾脸繃墿媿먦뽡숖蓐蚌():
            _ci=hex((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1].setdefault("__pycool_x__",{})[_ci]=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
        def 궶霱케伺쀁엥枨狞銾栙践讋샋왼퉯챏():
            _r=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None;_o=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None;뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(_o[_r])
        def 맯銺곷嘓셆佣쁫鴶烳鄎囘瑻攓暯댥쨂샤():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]+_v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else 0)
        def 韊揮퀵憟뙉麀夭궩휠拂砪琺쏯鼊쟯窞():
            (lambda _v: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].__setitem__(-1,뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1] not in _v) if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None)
        def 멝幸쯦蘯쬔颗粀테鐊悓睸():
            pass
        def 꽋槯衃圇겤惭霱髦怂歃鹤箛():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(dict(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]))
        def 訬럆胿柽등泔輧遬鍪珅퓂孤捁峛耷뗎牾():
            if len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2])>=2:
                _c=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop();raise 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() from _c
        def 륙줣獾뿔嘽诼릘쮪뭛鈻쯙뷅쑐馓鴹芵():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        def 幪벖踒삜嵭队螻羁듖棛锔줥谓쨶頸滷넟뻫():
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(str())
        def 尉僼놼磶岑찈犀铕鳭啵쾕硯녧鱍():
            pass
        def 겸犏焰進몙瑕썆唒燐享짎푽彫崷():
            pass
        def 費웯솬鮇띡鮔聒롩岵栫指訣叁崌啴():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]:
                try: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].append(next(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]))
                except StopIteration: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]=((뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0])*3;뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None
        def 폭곅受씿箦毷챂官潱푴譕鶱():
            _v=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None;_o=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2].pop() if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2] else None;_k=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[1]["__pycool_n__"][(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]<<8)|뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]];setattr(_o,_k,_v)
        def 끆뱳퐍荁瘿섯迋鱦騱渾匊鶐硂搗():
            pass
        def 핺쒾呌뤢渡삞존監듊픏젴鿛胋碰():
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2]: 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1]=list(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[2][-1])
        禺툼덤褡뤝榞쫎礌负뢃졙髤礞럕偙 = [葙봘苎苣椑钭莅榙誼峊뷅셲枴숗闬, 獪헱鞋쬢앱쫙迅亰淰맇鬌塼献嘸, 樵篬뉰뻴뢛趚崆훮敇줬퉴뫣, 냰더翪팊鞫堆惒凈雧獥珳뛓긞롲泰温, 钨啵诖沭궰꽳漜팪掣귥庞뷳颭雅킅躚먔짟, 陉陏捠앜蜃깟壝呿쩇犗郿橋粅槄긪, 쁺翂徚磷鵎懶쁓綘볶农腇葾裞띰, 沑鮢箏蘚嵁鬬돱렑鍾袥躓飴, 츅特퇏盉儁꼢廯麣賈쵬蒘晟葿棋뿋焓, 騱壡称뫡膇氒鼖煈牐骋, 壩髪梵巚籝쟍펛茼긴嚁紖됛, 襆넬쪃昬罅뜣恝윽롦簜墳唹浛盓嵔, 쭎뫤締遻졆왹酨乊윑뭂譫等, 吧鎕铙ら邻扑韤旪咨둩彍寪, 撏鋿劶彾莑榫眶퐟麹踶겪砆쿑, 쐌勌僶箴餺쌠觬炟嫦穧媄쨣緧귙씞, 濃輤줼擱穔뮖唴鯟揳굍皭馝迕纅쌙翵, 鵣合郻뛳龪謄扯쯪嚈퉡푠滕폳, 逼톻鸪嘐宑钬資餇毸윿羊跥歀鲚뒮, 襘頍鮛躴型쿊詙迳銉揆髚玦鑂昀놲晅, 혁甌륜韨콂狪腀滻雏廕헞饈偦봊暟雓, 懽앻厨駍厌玊홷倄곊퇔젍坝캊駈豈, 셢齺腔羿藄껝幪笺慫鹜帢勾棶鵮槶銤, 쓌뾪ゾ忱캎剤옲넙地븒鵜餻덡乣컶, 呚则蚦賹쟖跺嶔裼蹛偂낊憭, 竡到뻞嘌鰳郘텀렍쌽顊쿈瞖饠杖潾, 垎柟풘帆磒퓯偢旹휽쌁룪郱淇狋, 鄩鈛豙떎瓭뛑囮둈塰됒, 蛐륓諵稾퓞樥흿앚쳌郬銌涃掉塼꺏, 릠漱篯랒僘牟窜絕醮擗컝횘읂괷罐悵濈, 奭緌蜾촾貞摰潂曇粀凭퍞肔蕋, 悥닯詔楠恸깽羼췆轟汇廌槿处囐昖, 쵈맛뉕뼟刷퉊栊홱搸槊鬳鴎굆, 踬鈰颧낔춪툎폴斨뤣扇蓹乤畩, 越焐呀뎬勔耗运첚寗풛, 鐇삉훠삧봂紶袰轈啅컏函挤酧, 돡푵妶龌菱졓믇粉휽첲쓇め杶皫橚, 珬鲷뱕쌁껊袊硄꺷껛舻擳혫텐鵦, 뤤싐솫嘽匼벵싣坱璙喠攊꼴谖, 蹲겵鳪舴갿郍妲喰뭂黏偄韕唗, 鑲찖覓钀첢劮蒵귿圞暕껖샕瑋灛歡钖燬, 坦휖즏斅黁푖쐝맵卵뙰흿坥徬囉뙸堅表绊, 挚八纅浂飾敕墝蒣홐睛, 犃渫빒娘诺큃襾욞턛玆훲쀫뗨撹, 鱺懄貏畳髉얠듋숟鳷핛閦镇龰, 休骩椾犫퍽魺镯부产滥匬扗싥鸱蚸벉朖쫩, 邝饢땯껙鶈擭秢꺹珊뮬编煅怒, 轺镴쀷桓챣淆幷卛뾰烱鉯傮昃詿, 訏鵹樁텗뿅횠쐢졨鯏砡, 坈雽拰篵瘽뇣熷쮣懧疨廘庖不鼶컕咺, 譢迨爌犎띝鲐娍搪떥剸, 接酶鲏菊제쪦쥶课뗫鞑潟뒗쳴舷蕦拘纠, 筙沷懦肁曑委蕩髉踳鶲띘坵, 짝閱柏崵짆荏뙎쭑螤룀悀, 暧軰뇲窴수犏꾵删懚枻栌즲鐂, 匉緇뵘鹝鳤藲씬选툈츔欉뭾刅縹秴, 捬鐽硽绲쒏퐙춞鯟铂塳轈蹋틍彨龑쬸稶唍, 值鱠脐컬鸥疖썶摺앶偯偯骯釐羜鳦ゥ橂, 柳꼯솾釦깻鏕蓋菘芖飀堜퍾햿, 烞躣具游億잽쪩兢閹뇐忀营, 읚댬蹆莿漾엄퍎殀꼛뱶跽的쿁逃煩, 펁黖턒鴖뿁渵剩嚱젛褪鈫, 뾞폞홾盅췈玟饂툚뤐粋쑭摅뺶鄟髏, 嬅박菮왱髂뫂쳴漍놃孏躬, 鏂궃쓃禌蝛娔篖놂嶸푄彡茙孽뻧뉣氵, 啰룎옩鏻搑뤩芕챁멨완烠黧, 芊뉻밌羂屣疮룼뫉勜따遨곲詅嗴栫鏩, 虬쓟緙檢겡缮俼璵矔杣쇿, 處꼯稀쑞궧쀰媽峅仟댿臤둺魏홵啌輣, 魅筛鮷쉈鈎펜除兂筥漭龵駍馶誮褆, 皘냘惼埈흵斝泑る洣껷쫭焎, 眣麖茱诙漢橌蜨韐鯑飈颳썵, 꺣쵱鋜붼吨똬잉綝科醵珤쮻叒, 뗩沈줘큳墪짖긱繉兙屝茩釫, 댮쁲峤槚藚僂绉趀엕磒騘냞꿆쮝, 왋髽꾽拸靦靁槏奃簛삉苏仪諵鲎, 渞챡攑긏盃衉쭕嬻诪砓뱊걞晉롧犁, 麄陾쉪鑣唆墪뷺杜聕杘, 官霓댟필컅汭禁餴籥抂甛뜤醖蘑, 뒟왺옡龌バ冔鏒陲侴榓慿帔獱롱憄, 臖낂鸡욹賜첔癄겺캀잀쳒쑢, 刨쮘켔偽蓪띙昫顶躞쩱襶龚, 騁鸆葿촆킴쾛姱犩豭펍豒끇イ赴걟, 錊숻厯乼襺슕饁佅鐄肳쬪獅, 喢넭뀖葃쬇骷젚铝凅돤炻糶귁, 량巋첤줓琸簂皶웻卨鲜氓灥吉舆, 跠딺쥔틅嘏뙿爪걃滞핐衙昖, 严諧赳嘰蒃廟髽羑畒쇚鎒櫨쉀靾蟥눦빞, 婡圵鸰姪の꺉磢琱篏邕餬닱託욐乘, 뿡蛐挒삜韪蝒圎煐頯쪧툙, 鶛씼门뽑팺璯뙼趙瘪딏肂哵手홂뚫, 죢蠳勑撃熌뫦꼣烿穭앀锕끳蹻巢辨胪, 챳寎쪍砮嗤놆췋衮횈筩笓靚警灨, 運叏쀁섮俎疤珫軣勼鹙톃똣퍓倀螛줞굾몄, 介仂圗퇔岗汣遾鑗緶똱薵쐵퀼帣蛋膅榞, 쇦뮧쉓븣自릂鉏碟賝쑻포땉몔, 牪簐좖鬧쵄샦鄈捃皣킭诅匶졇鵆逍郤, 觊坞攺剟鱲藠慍碶噐儍嗵詿芹鯐噟푘裢, 迋泄钘짩뇉쀼儙蚜仁攞國읡縐쥟暢圅굩粟, 袽吚算堠耘浕鮷這돸籬涁苲耉듘율킿甥庛, 锠蹮菮놚车萖틞邚꿜乏芫, 覰罦筣鋲쟺밸鐑讖厱谽鑳뒻淳돕仹, 탓妛톇퉸킥窖튄者骥쮦輪厝槎逎디悙흱, づ뽢끁낒鐫瞷郷뷫脓洺렉扆酷, 섳じ뗎꺵麂론脌씳짊懿뷛儖덗訴饖턱, 냙納륣鬂텰숏蔘룮샴컰崨瑝멣靣淰, 錧卍峮崇閡婤쯉輷쥤我湋팉쫃訨, 葕堥饹돳翲荍昢寙킃쪾꾥潴늁, 葤릘쐓十쒩鎐틧퓌촿湘틣댍渫坲, 驡崠읔晐蔷鱕鉬鍨瓡令飕딍匚쎟췔鉉, 덕邕唓迓类絆膔训칓瘮犿柌킱箎똤, 烓箮墽獪旱嫮鿾瀂杁躝澓틿脖쫲갷脨읮洖, 褆柇헇笳춙뾟멨嬐恎矣馥祩볯, 稘ヘ휫鶧韣持鮏묮藿屏掺튨, 棨밯蛞盛毐塮璕韽꾺盐殑쇅蛲쾔磹矜, 懇媏愑잰魦훝꾜챹蝜絷쀛싰杌, 욯庋킻心웁楬롞꺱刹褝诱坖뮠砬洭瀐컔쇵, 悕骯쐟嵯呲텿奵噣喴坜琠奚崱뤗罀, 躬卽퇈柆딙垬냋큆屲禫뱡蒘磟賕缁, 쑑觉譓둓臼廵폹뢆쏍칆窿核霡뚱粵趑벎, 쀛鐮德껰히湺汣だ霴昈홑, 탢婝雩斉爹啁法靘焾耛炴嶝뙹鱳虫틏, 樓甪蕛鴛懗媲硈軐芊紽通, 辪쪜鬬糕絔い풠棉쇻罃奘튻磇충酶컒첁蠞, 棭淚鵭셭챿桿襁譠濓乓, 끜爳틃韋亅쏺层쀚戋楄穧圽腟扐, 꺏踧鴴콾懖了쟑攄榺杵쁗瀻, 혡鰱뤤韙昬智퍫臝컊箐侞뛾脷鎫懁, 굽밂攵킇餳蜕朌囥杝祢跋훘憡癠僰嶳, 鎪平驙곎鼎狡綣萱꼍臼롚鍁迅奠倫媪, 짿諈읹疡鸻佴귘懻麃孬煍坭徲耍, 鲒ラ掶蚯쨗쭍떘焃鏏嵇뤣襫, 틚坼뾪쐌퇃销텺遻페悁晼뽚, 娓袟薼晁納忤띥蔪撓唊裘琑葴籹抪辵, 踿蟽辭腧뽩衼铻쫠逇跦輭疙唑枹, 廳洸퐴떻廁輾쐗游墟壨澔瑁詪도詰좛, 甤큼攋楫흣焷陂뮶齀匡祼仦, 銬荎檩鬛늙놄묜嫴盾鯧瓙蘎桦, 丗枅箛뭛蚒푼뢁掓팡樎升뛊閅횂儖, 廫酌榰쩝읆쓦쾓鰈顭챆踀鲃櫭溚탥, 뜾远猶텞잽肰絘韡몓在萙횜, 逋齀犌滣蝍족完툡됤盀闣縶決쬲覘, 葀掂イ覦륤륐霚枂픐븗枿孪끏, 됵蜏휞갹켆矁絽쓜瓴紟繩コ窩쎐, 엏뀽糛타申梸簩魞狌躮蠥嵳軯혀롓겱, 썺깓ノ澍徱椐踑拆졤蘮쎣, 鲋攇溋멸땉奒댈湛놘꿽풞驙, 픀閭裋쨗筠눾羓駊늸堽孮霮혗觟촀봽镘宁, 젱樲堁뫳鯎쭦냕厧蹲芌샛횧墼疴, 箵컸粓쒽伋秷쾋좓쯓稩, 鵆优葥鞐袶崌鎭穧呥탓퀊玟萠鱁趞, 핰鶔뮟빰翛혊鍦銌톔裘濝萛븲坱瀜碭璩, 狴弗胠満幬聼轞蓸嶚抢眞仈슼즚揷, 餭밹픇生钦撦岋좂샓睽疸灒, 庠鋁摐戍輏쭏柗텡焢숿긐蚉馊, 棘黬撈緾襕鏉虫昅瑾雖괹肊, 쇛뙇嶣핌衾쩌浡쥏鏝哯櫈멆蟭쀦쏟, 廱꼅氛莗襱컶鼏츩럱恷盒뼺擶踨塨, 쓘킼쩱茙蛮鋪刧荬쑽狓뷗氐쀶, 琒ズ쨄봶译磣趤蜣힙귱뷑暤뭂, 埂귇뿡볎슻瓗鯗骇츶蛻鯗鍇沔먛볪麯첚圫, 쐾뷭蕑竗襽俴뜆椰宋볃呏阉粬鈆, 鏩魋툹븍覺絯状嘒碽沙녵持픃沆厃뷔, 顱죱攈兦뇚逑嚧瀹괰膷롥唉籼溞렯脄싢꿋, 볆軖굧괓临測瘡焑숃曪魕鲏길稺壬솻, 糆蒧淁풌윰周쒷뼠鳏믜鬧跻폾, 테炻뻎招語쀕췕놈延눦郇榿锭精, 嘐콲烋뺩戵꽰掊弡染箠뵤坦횠僼捋, 挥瀏녺걘콋鴫펚墿谓쎊謣杛紳騌쟓졍, 놜컇횹奢挫玾뽓頜瞘棊阻샌喸蔕餭苊, 蹆죻震堫뿩孲鱝썆碇鴄憗羶둏恳앴, 象摷攥瘣粂쯦騑屶馇칺芡폴苄, 陪鍓抻諥槂郜듲肞늢鮮壽훊儓腿嗖눴讜, 停帆允뺱岠겏蛼秀蜭퀆懸雊묹쮺溜, 슸뱏颯徼譐锞中譌핳촏뵅泧당뎽, 빑믅莂炗咹璱뢥占않댈슞嫠, 閑螜쾮佊잋숳킍兦觗퀂, 쯸蔪浼筗뮁쎖犀뿸쿅絧峦畞춟, 洌嚥挰畡軰硬됑漎荏쐧砡怛, 葜묽脢뮽욥홝鐯拴쩔꽤节褎, 峚箨狳뿑뗠喸嗑鮁郶鯂是, 儦煿踋鿾蒠鴠げ驽莸跩뺋햶墟쑿禨穚軭傣, 뤮묶볛咽濺쮭樟醱犮혯久鵲섘稢, 唏韧퐜쥾蜹嵕쮤鐭츻傻句, 攉軨찝괯溄态쯧妚뮮嚿甭氇퓔, 繡炆蒘쨙嘸땚턂碛膦꽾, 縃뷍쬯簄蹲싀숷쾂梺俙忆鮼, 蜡双驇蟵缽좠姼캄噥퍚蓄冫썤쬢삳, 斬摵귺좦笌疨鮁稭씊湠, 皾夆激뫯좚昛擷琂픖徙췯綁儴큌媄쐴, 慤卉灐糦쫙픋纮遬涚棶輟, 鲖묟먃輄翔념椣伌铪침閈덃, 쁌醥躤襓뀷걢鑆叟삂稙檸똓脹무쏬芌, 艮撍줖龦琯芚碆홞늓湔殒羉쎸눋澶, 盢븛篢萄跧枧벿弶だ眠螨徬홾譑공, 鴉蘫墑죕錦欐鍚塻袩놶姦朸왯, 뮥휫髎눠釉붐拯咂諑攦딶匩屟, 띸辰拋썊妹켧嚽泽릵昿쥚嘼媹퉡媹盲鉇, 幧퇘芛蚟跁좀篬碯湼林袁뉥疜陳鵆鿯靅贠, 暵陦俖큠鴔芳屶傤꿓扔峋, 鎜뗶賬텮텩餓宇箙믺桇, 쪦꼹걚诳雩랪炷墴石鯒葙쨁儰삉耉鬇, 뉗頎愁餫鶂送痋娋蔒쨇보笀釥耺뽂, 瘶禠켄膩뵑꽓玠瓺馲鱜쨫駝术觛, 陖号鬲艗湄鉬簎鄂蘼띃봂窬渆, 堮猗擛鵠潀雪퍢爃糎떦嘅젌헰拡, 箊凩呻矗럤샇梣幗豳鍐젩億휧릯풒, 聀鱈唡뷘첛鳠鳛魕낀쾒, 恤遳韬뜾냽瞍聞纍젪屈獢쾚扤菠椻螩묭涪, 햁贯诒퀅戔븏쇾脸繃墿媿먦뽡숖蓐蚌, 궶霱케伺쀁엥枨狞銾栙践讋샋왼퉯챏, 맯銺곷嘓셆佣쁫鴶烳鄎囘瑻攓暯댥쨂샤, 韊揮퀵憟뙉麀夭궩휠拂砪琺쏯鼊쟯窞, 멝幸쯦蘯쬔颗粀테鐊悓睸, 꽋槯衃圇겤惭霱髦怂歃鹤箛, 訬럆胿柽등泔輧遬鍪珅퓂孤捁峛耷뗎牾, 륙줣獾뿔嘽诼릘쮪뭛鈻쯙뷅쑐馓鴹芵, 幪벖踒삜嵭队螻羁듖棛锔줥谓쨶頸滷넟뻫, 尉僼놼磶岑찈犀铕鳭啵쾕硯녧鱍, 겸犏焰進몙瑕썆唒燐享짎푽彫崷, 費웯솬鮇띡鮔聒롩岵栫指訣叁崌啴, 폭곅受씿箦毷챂官潱푴譕鶱, 끆뱳퐍荁瘿섯迋鱦騱渾匊鶐硂搗, 핺쒾呌뤢渡삞존監듊픏젴鿛胋碰]
        쮂沧臲駝쩪倖픺뚐꿹従뼓慱 = 97
        诺遳孹잃鮲駑튟痮寷뱠鲐땙浂嘠 = [-1, -1, 238, 196, -1, 101, 90, -1, 119, 208, 7, 43, -1, 189, -1, -1, 109, 123, -1, -1, -1, -1, 76, -1, -1, 71, -1, -1, 204, -1, -1, 60, 41, -1, -1, 181, 111, -1, -1, -1, 161, -1, -1, 116, -1, -1, 179, -1, 6, 91, -1, -1, 13, -1, -1, 61, -1, -1, -1, 89, 72, -1, -1, 15, -1, 193, 17, 246, 194, 21, 39, -1, -1, 69, 48, -1, 77, 22, -1, 232, -1, -1, 200, -1, -1, -1, 12, -1, -1, -1, 2, 177, -1, -1, 247, -1, -1, 242, 108, 127, 0, -1, -1, -1, 57, -1, -1, 178, -1, 163, 9, -1, 183, -1, -1, -1, 97, 219, -1, -1, 3, 254, 45, -1, -1, -1, 79, 243, -1, 253, -1, -1, 74, -1, -1, -1, -1, -1, 114, -1, 63, -1, -1, -1, -1, 176, -1, -1, 206, 234, 52, 124, 172, 10, -1, -1, 42, -1, 251, 167, -1, -1, 215, 212, 164, 86, -1, 222, -1, 88, -1, 121, -1, -1, -1, -1, 51, 239, 205, 73, -1, -1, 30, 100, 103, 53, -1, 185, -1, 207, 31, 8, 40, 190, -1, 218, 120, -1, -1, -1, 4, -1, 16, -1, 68, -1, 233, 54, 105, 226, -1, -1, -1, 82, 14, 96, 175, 198, -1, -1, 59, 38, 18, -1, 203, -1, -1, -1, -1, -1, -1, -1, 182, -1, -1, 241, 78, 237, 87, -1, -1, -1, -1, -1, -1, -1, -1, 26, -1, 36, 220, 184, 46, -1, 188, -1]
        趧붗業蓠潳睎옴鴜瀮퀤 = [0]
        挔샾蠯뛙昋丂鷻霘失 = [None]
        筸퍒啉誁精蒅熉諱궅屶궲떊吺 = __import__(''.join(map(chr,[116, 105, 109, 101])))
        while 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[7][0]:
            if 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]>=len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0])-2: break
            ッコカぜペベホろゥゕヶベずシクごズ=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0][뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]]
            ジをベよイじなォカヹビワヷ=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0][뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]+1]
            ナカセぼぶぐびえひくざ=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0][뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]+2]
            육놪왿뼃꾬퍸헿믨춊깎넔뢈붸뜭혴늙룸꺛=(ッコカぜペベホろゥゕヶベずシクごズ^(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]&0xFF))&0xFF
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0][뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]]=(ッコカぜペベホろゥゕヶベずシクごズ+1)&0xFF
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]*1664525+1013904223)&0xFFFFFFFF
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[5][0]=ジをベよイじなォカヹビワヷ;뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[6][0]=ナカセぼぶぐびえひくざ
            뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]+=3
            杄풤帖롘哺줦閴滳叵撤夌=诺遳孹잃鮲駑튟痮寷뱠鲐땙浂嘠[육놪왿뼃꾬퍸헿믨춊깎넔뢈붸뜭혴늙룸꺛]
            if 杄풤帖롘哺줦閴滳叵撤夌>=0:
                抒혡鮃꾠愄廛諹镋賨=(杄풤帖롘哺줦閴滳叵撤夌^쮂沧臲駝쩪倖픺뚐꿹従뼓慱)%len(禺툼덤褡뤝榞쫎礌负뢃졙髤礞럕偙)
                禺툼덤褡뤝榞쫎礌负뢃졙髤礞럕偙[抒혡鮃꾠愄廛諹镋賨]()
            趧붗業蓠潳睎옴鴜瀮퀤[0]=(趧붗業蓠潳睎옴鴜瀮퀤[0]+1)&0xFFF
            if 趧붗業蓠潳睎옴鴜瀮퀤[0]==0:
                鮾껯慚溘娹茯墆膤윐骺퉅誤쮇=筸퍒啉誁精蒅熉諱궅屶궲떊吺.perf_counter()
                if 挔샾蠯뛙昋丂鷻霘失[0] is not None and 鮾껯慚溘娹茯墆膤윐骺퉅誤쮇-挔샾蠯뛙昋丂鷻霘失[0]>1.2:
                    뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]=(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[4][0]^0xDEAD1337)&0xFFFFFFFF
                挔샾蠯뛙昋丂鷻霘失[0]=鮾껯慚溘娹茯墆膤윐骺퉅誤쮇
        for 蒾躶驔烍箧픔饎긲憟 in range(len(뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0])): 뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0][蒾躶驔烍箧픔饎긲憟]=0
        뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[0].clear()
        self.溔錖唏糿宏醥孾溬聥通蚶=뽑솨휏컸튈졼윥칬찝쇦쥃삹꽀뻒[3][0]


殓蓰毽曄옍밵쉏멊汭廷愃篨柽絋淀瞣訰쫉玾雡竨嫄슈囏뇶山렑 = {2236 ^ i for i in range(9)}
'''
忍趸駢蜀檉骢链禫靖灹絆诋葓覝詍韆戽銻犩屫弘烔挤泶檝漌萴輝対剒碋穟熋塹漭集袬墽縫秀闾鴒癒訐脘鈅籑漥贷棶轱煭熭翱垅焹馓语鐮鉷惍龬捼焢驴剭悶咬冺竨輽跮赨瓋龛呋兆柨銢灙標謸囯罨舒鷔桲恷喴舶貴撑帖皈凥慢巼釕鳟銖骬
'''
噦鄴缮鉍湊阤焣烯뚌毖蹟빕헺藎嫒 = [[(lambda 셬魄灣箨阼쮳자썠덟胎踸과戡엀: 셬魄灣箨阼쮳자썠덟胎踸과戡엀 ^ 86)(i) for i in range(15)] for j in range(4)]
鐄퐃閮듭備阵蠅賯뱲朼酊堭옘斞눝巇覎篽쒀蝱鼟꽜 = (lambda 뷖킳뼇쫁뒌脞쑶檩: (lambda 渿鏞폗鈍炲笣赪醆莄烁闓蟮皹荟: 渿鏞폗鈍炲笣赪醆莄烁闓蟮皹荟 ^ 50)(뷖킳뼇쫁뒌脞쑶檩 + 9375))(58)
쁢煾꽨铤쪧滏犚汝扏礹囵雀癀覿찱 = [(lambda 쵯賥靐抽樷鸏낕쩎퀭씦ゆ憥戥猪夎: 쵯賥靐抽樷鸏낕쩎퀭씦ゆ憥戥猪夎 + 93)(i) for i in range(21) for j in range(3)]
龇븝絿鐋臹瀂蹄뀔톥皥줒폻诤滛듖쑲嗧쉙슔饏塳僂脗숞茑꽡 = lambda 终믵貿橭绂배巍둇갡燫푨: 终믵貿橭绂배巍둇갡燫푨 * 6584 + 255
汔쬿켦蔩嗄莝왗瓕姆侥튫响맰蠘啯랅汫톭뎧桁堘雃윿箆荡蠅 = (lambda 嚴撌뫢캥糏鯕巆燾忻: (lambda 煯巆뙰퓭챏觘哵蝙噮햽勆旌鑻쫣鴠泰: 煯巆뙰퓭챏觘哵蝙噮햽勆旌鑻쫣鴠泰 ^ 187)(嚴撌뫢캥糏鯕巆燾忻 + 1158))(18)
'''
諎蜷埡科瓬牺縿桹祱顡菌備蓎悄涠蝏嵴長鞮赕煜怱幮袈赮柕秨筡兣螏迥僒蛺椋睵銅俵坧揱痊晍觸棅洜梇僚髨鶏蘥育跼圬莙衎儖茀賆愚鸉恕俤氞僧溓抎籓怰喞姺睰楌潊冗彵閇碇叮頖酄侪凄龝玚夘窜濩傥永
'''
볉宾纉센蝦읓눿讎粽灔槴쥗峿煰 = {(lambda 砧諻턁洘땫跓뺼랆쩢돯쪬씥會쐑댲찶笋: 砧諻턁洘땫跓뺼랆쩢돯쪬씥會쐑댲찶笋 ^ 224)(i) for i in range(7 * 11)}
쮓釞퀢뙉栄딲嚚뫕趽凬푲튒 = {3293 ^ i for i in range(116)}
틔뺘誁槤뿋龰咹郇밤り埆컕彡 = [9266 for _ in range(112)]
쫐併慠꺬뭙댿쾆撹赏玹糦瀾涆 = (lambda 쐛쾀彦栴泼椷쇦겒倎蔨: (lambda 億캵鹭弃錜땓격韀氻轺축컳唯会웰桁蔓: 億캵鹭弃錜땓격韀氻轺축컳唯会웰桁蔓 ^ 116)(쐛쾀彦栴泼椷쇦겒倎蔨 + 6775))(97)
穊砻鍕땩拹껱셚傷덄擅捙물瑧綵閹瑂緛緊衡 = [(lambda 훲溘殡쎤婽틃졍熑圠: 훲溘殡쎤婽틃졍熑圠 + 247)(i) for i in range(66) for j in range(15)]
秎產眧鴎쳲嗍鏽촗쓙幏扂뾭慶륓댢矦囇똪벍됒肩鄂텊갪叞갊鳳 = (lambda 怤亯틂켨鉴싼쌬룦脚섍쳄: (lambda 켗謥滥刟폎諕舜莦훈怜铉뾀윾棎: 켗謥滥刟폎諕舜莦훈怜铉뾀윾棎 ^ 222)(怤亯틂켨鉴싼쌬룦脚섍쳄 + 7093))(97)
놝阺鼗믙瞝谯졮末鮖鰨蓧萏딞橽抜梋烳誈皍 = lambda 퐫뺵츅祫뾲蚠焺乔睦嚟甡: 퐫뺵츅祫뾲蚠焺乔睦嚟甡 * 5215 + 215
售宆少瞌鉻鰵哛瞈覷蠒餂銁띫迚鱂퇍鍴貞圖쒡煨豬 = {(lambda 迯庨쮡撸퉫搼텷蟘몕쒺쒒蛝刂: 迯庨쮡撸퉫搼텷蟘몕쒺쒒蛝刂 ^ 115)(i) for i in range(50)}
熋쭺繸澀樏뀲箌矄禷찘웃洴튜穲铠떪硬읞쌁徊櫚 = [[(lambda 뱀裳楻펕靾뫘烣膋券艒现褬醮轡: 뱀裳楻펕靾뫘烣膋券艒现褬醮轡 ^ 56)(i) for i in range(2)] for j in range(12)]
폊繬渲骤巁孢鐸洇쭎褙甴冐豂뷎那廪慈늇歯쉏謉쁧坆蠎状膀궽 = lambda 荀輘熉茨愽跫曷篼蒅僖輀钷窳魷硜권欟쉯: lambda 噒魰쒘忕襘땀駠辢来캛: 荀輘熉茨愽跫曷篼蒅僖輀钷窳魷硜권欟쉯 * 122 ^ 噒魰쒘忕襘땀駠辢来캛 + 5288
뛾噑딇맗溽뙤鸃噽켩狗葄鍀 = [[(lambda 赓튎浺훝せ햸晦戼墯悰遈撋: 赓튎浺훝せ햸晦戼墯悰遈撋 ^ 213)(i) for i in range(3)] for j in range(8)]
껫싘쇴矴峨譬촚잤荆穚춐窜 = [(lambda 妜솈蘦減졉县娆愋箩蠛芇뱳쨢吩띵萳쌍藝, 蘸贐듖뗧쟦뷐렓波繜蚠폱프: 妜솈蘦減졉县娆愋箩蠛芇뱳쨢吩띵萳쌍藝 * 蘸贐듖뗧쟦뷐렓波繜蚠폱프)(i, j) for i in range(20) for j in range(6)]
슽백瓤嫥쎄洇밪歧뚰꼎咦外滔璥垪鯂큫簺 = [(lambda 힔뺹稃餶籮및作坱뷞輸ゝ: 힔뺹稃餶籮및作坱뷞輸ゝ)(6360) for _ in range(25)]
皜虚芔統쁍崤媖읝漦넯啜闪뵷쀃夲旼指畉깂度偞 = {(lambda 濪쓧綖놽늃透嬱삨솚霍: 濪쓧綖놽늃透嬱삨솚霍 ^ 32)(i) for i in range(85)}
闰輁賶棈꾃赧葖渐韣대圴폆癬翽搅撣羸 = {149 ^ i for i in range(59)}
쟷렅遪뛁玦렯覔굊关铟첟綘媨揅뷸珁 = [(lambda 뻺싹嗜库蘍鿅嘖霕鿁絘棒堏徰洵漩赫嶊뗹, 伡짯螹丫퓴閭両豻杛팊程칯: 뻺싹嗜库蘍鿅嘖霕鿁絘棒堏徰洵漩赫嶊뗹 * 伡짯螹丫퓴閭両豻杛팊程칯)(i, j) for i in range(117) for j in range(6)]
誇蘓殛콘隢쩖姰跉剫糃襷羍멒盟衔 = lambda 駽뢄槝铹覚殳멮煨钫明: 駽뢄槝铹覚殳멮煨钫明 * 5363 + 233
쳱쓓贿釧貀콾髬綪眒쪴뜓踄圻젎쀖珜黤잸剣륢ゆ峖栫拳顒 = {(lambda 娠琤沎揇盪啚骒臯襆: 娠琤沎揇盪啚骒臯襆 ^ 37)(i) for i in range(52)}
룃陦뢐屩澉먦쨡繅댖뚜塷퐰쉃얔鏰않钂羛凞率 = {(lambda 祰謎尤黇鞶巧瞩눒云蔎껦: 祰謎尤黇鞶巧瞩눒云蔎껦 ^ 105)(i) for i in range(38)}
꾶軮镈콜큙墟籅褼햩묇퇶厑뛰縹뵖몁쉐槻푴맮嗾俛迀吟犀榡 = {(lambda 뻃栴曦艜鍸髷嚬핧餯싣눡췮: 뻃栴曦艜鍸髷嚬핧餯싣눡췮 ^ 20)(i) for i in range(7 * 7)}
爊弮艗弦敓녗矠洟涅秭椢杳펬鐈鏁뫏煶졾筣 = {(lambda 뫉臟랥绫爮他忍絕: 뫉臟랥绫爮他忍絕 ^ 252)(i) for i in range(5 * 2)}
샿쌆藦域仹쭃껱앲褟뱕綩苒쿌숌囆踾저灩疰盢鸢뀐蛎紫뜥맜뫧 = (lambda 虧曬狑험駄젡粴糠塡芟鿁큶纞: (lambda 箌먤곢퇽熩茕绰웛쭔: 虧曬狑험駄젡粴糠塡芟鿁큶纞 & 15 ^ 箌먤곢퇽熩茕绰웛쭔)(4732))(58)
倲罎亭퉼楩소蕗슸륱鶎뎄늴矮쯅栊蟚튬줦鮫弯銥쎟맗鳇옥绯 = [[(lambda 帛最쟻泂姇穽霚편렿獠艻愅: 帛最쟻泂姇穽霚편렿獠艻愅 ^ 102)(i) for i in range(9)] for j in range(9)]
惏螬첷씨湰잦窘檧똦畛쬖덗颔펉괍絧멝 = {(lambda 웒姒뉹藇躾醥콿饋髮: 웒姒뉹藇躾醥콿饋髮 ^ 163)(i) for i in range(7 * 10)}
콞媅쑃攧暑톙눍球럲锤磡븾蟋钇壇嘑奒뀯숺礧걔葎箿紌嚅揬鹱蕰 = [[(lambda 뿖鼄룁昛炯欔뺇雅萌뻨妚뢰哚밇憍찪捪뺼: 뿖鼄룁昛炯欔뺇雅萌뻨妚뢰哚밇憍찪捪뺼 ^ 118)(i) for i in range(10)] for j in range(12)]
맻躃ざ从不埵흚뷩芮寵铰삀쯬鿒듡砩빝桶榏媟劈쥱觍썳 = [(lambda 헨똃赛坎夜勈攜梲: 헨똃赛坎夜勈攜梲 + 97)(i) for i in range(74) for j in range(12)]
넲磝諺쓵躗袞됸莋癿칞떋쾪갣코턝攼혯偛덽궼つ廐眺氼뤬篠磋껟 = {(lambda 墂숁憞姚郡倧厜茎硓증衼諆셂샬芃쨞텘: 墂숁憞姚郡倧厜茎硓증衼諆셂샬芃쨞텘 ^ 91)(i) for i in range(8 * 6)}
枓跌찵풀誄澟샳猛痖厉턝뢽宄앰滫畿臂 = (lambda 吞슠洓叒嚯銥헧璴鋨쀫翥솊倞圏: (lambda 病棪蟞匠꾿朒앏胪吊筫胕渐釙퀦푽뫧妜: 病棪蟞匠꾿朒앏胪吊筫胕渐釙퀦푽뫧妜 ^ 67)(吞슠洓叒嚯銥헧璴鋨쀫翥솊倞圏 + 3737))(90)
鍻聚넗箌見깥曕裇賮烀렻嵦뫴馝櫫覥粆氅槇 = [(lambda 挀潪伝韻肥鵴필菊僌쬃躔嵋: 挀潪伝韻肥鵴필菊僌쬃躔嵋)(7598) for _ in range(87)]
嫎鶐鎇疢祍콑輑罷뢭煄衙솸驅亁퍇뭱눵뿻彶糚誂蜉죰 = {(lambda 藑磄쨹칭獡晢뮆쳀跫塌龵벁휕뷩: 藑磄쨹칭獡晢뮆쳀跫塌龵벁휕뷩 ^ 152)(i) for i in range(22)}
嶜麅봝閑똨甏蔟鸫먐嘠胔轡飏罀虩녿癦욖퐿匳槵텐膀 = [9604 for _ in range(73)]
끿귄琗쩍簇뚿蓿摃猛됔絠쫾澳쐄큃縰앲珈 = {1858 ^ i for i in range(23)}
毀蠥賆뗜嘄혒桏唙탞좦銙褘힜歶뺽偞忔따路椭鮓筂 = [(lambda 忉媆펚꼀꺭太뇈甸읉亥퇨颳瓨麖羕쇉峄蠖, 隱괦즁蹛抎熣鐿蚍貴혈: 忉媆펚꼀꺭太뇈甸읉亥퇨颳瓨麖羕쇉峄蠖 * 隱괦즁蹛抎熣鐿蚍貴혈)(i, j) for i in range(81) for j in range(8)]
彶痵吵荣꿱鑵왬訠닭硡멼杉쇖物囮랍 = [(lambda 寜쉾닠삙嬩轵愝卛픱ば嶤纥頟紆矚郵摁: 寜쉾닠삙嬩轵愝卛픱ば嶤纥頟紆矚郵摁)(1805) for _ in range(69)]
횲煰쥼욘댘疻紹鬻脖塗贴醀傟潟츲旝跬疒挣坋峽俻玗셯峔蕽릵퐵 = [6214 for _ in range(117)]
'''
納襣睏鉐攫纮忔赩竮稏絍颾狼躰閪薊驴遇蟒戓聖鉥骘從籱岠庴趮輯圵遷湒逰妝葱粹瓋贐攪彸淯箚瀜猤钚价箪幛踰胣兑駗媝騙訜犩蝴粑矽郵竬樕妊秆船偿掜渕躠鄭鴷聯渏奵憁湒垂罱擘峼坴卻茯娎栂喁锜潼淴蕥染痏黒弻弝顚颧罬鿮濊畯唆矢岗猽傧佫蕿爓韤暟襫
'''
湉얗왜攌겵犎꺬浑腞쳂赧뉰頬캠こ = {(lambda 랪봎븰遣皙쵗깫壝狳퐞碍枱瞓쭯忪폖: 랪봎븰遣皙쵗깫壝狳퐞碍枱瞓쭯忪폖 ^ 250)(i) for i in range(8 * 5)}
旅豘읷坤떋砡인攐诞ョ힘捦 = [(lambda 뤍춛켬竁踐몋磀꾠, 滐菼豷蒐辥入阋뇤慈맻舚幅慬푍媒쥤쁅掻: 뤍춛켬竁踐몋磀꾠 * 滐菼豷蒐辥入阋뇤慈맻舚幅慬푍媒쥤쁅掻)(i, j) for i in range(14) for j in range(9)]
婼췭곈먛薉鈡婇쵈题闲뙶潠뜭惤蚃 = [(lambda 됂횤묖뉑穬딖邹넶囋兴隙团: 됂횤묖뉑穬딖邹넶囋兴隙团)(408) for _ in range(119)]
兣蹪嗶閒亣땃搪蹭띭퐬鄽뻎杂堮塱콽嘛乚쏸돋晇碏闫璐탺퀟뜈覉 = (lambda 樵亩죣끤僆쾒嶯椗썼: (lambda 몮뜡攺舷뙋깤赔罪姦뺠離皦沜훡譛讬舏젻: 樵亩죣끤僆쾒嶯椗썼 & 131 ^ 몮뜡攺舷뙋깤赔罪姦뺠離皦沜훡譛讬舏젻)(4680))(44)
홿먻퓎験羟模陸밞瞗蔶殣牑婇 = [[(lambda 朋챧놛瓧뜨潘죔뢁筍熟: 朋챧놛瓧뜨潘죔뢁筍熟 ^ 126)(i) for i in range(10)] for j in range(9)]
撒欼啝蘉刻帄붛릉晻꼢솢栗買 = [(lambda 艗跊峸傑任耴큋싏掙뷁만촚蚢: 艗跊峸傑任耴큋싏掙뷁만촚蚢)(8241) for _ in range(92)]
픩厛徔쫱킡璺들繁깜愐섇撹嬈믦丟륐塾闒룛蒘쌼낆 = lambda 樹솑멛嵨鰭瀨焃됺: 樹솑멛嵨鰭瀨焃됺 * 7371 + 216
寖造煍俁穁昝牫畘쳇껝魷똈檬읾桯啶隐乍妡쪊庹 = {(lambda 컍鴿튜鲸騝씆呵禁뜺九枳옽쭥炀萚: 컍鴿튜鲸騝씆呵禁뜺九枳옽쭥炀萚 ^ 150)(i) for i in range(6 * 8)}
餡栱밄噶醁游텽壼俋躽愩蓴挃苿쭵繸直标쏖젮 = lambda 뢉鵇耡첤둒츘孹傣龧卮괻輗꺤: 뢉鵇耡첤둒츘孹傣龧卮괻輗꺤 * 3122 + 246
叿쏄皆簊샜뵡븐涺準忛诙젻絔溃仙콁데匱튱踇슳亗荹杳뚴춨労쌪 = [(lambda 雲갮銲癙恅쓇퍞巕젱붑阺, 敝훳쪵壪縓늶铵훥쓒띆샓젗: 雲갮銲癙恅쓇퍞巕젱붑阺 * 敝훳쪵壪縓늶铵훥쓒띆샓젗)(i, j) for i in range(67) for j in range(6)]
坹쫇긥谻쁘欶폗윩脷猬읜탔경쀌쪆韅퉎綶 = {(lambda 襺俁鎈歜벹촠粹搌慶泳仨簡灲: 襺俁鎈歜벹촠粹搌慶泳仨簡灲 ^ 213)(i) for i in range(4 * 2)}
'''
墙蚊浸嚬舙謶犜瑜栟睐螭佽肇晀氞陾訴鑞寞夔氆錄鵈趪羋凊垒枅鷇诫珂劎魐惋檗椞刔飛碿鉜勌亷敨認樜恹鉿畡牬醘緮嫠歄靭釹桿鳦忘婱瀎绫嚋鞻耤倢智鸓栝囍乨唶璟鄓牏鈧竈廑鴮槣抯弢锫輟瘋瑸曫狁憍粟亸漛譅糑芞贅蕯筕綎褼澦虅鉠咎蜱姹毌锘弃赋怪鉀拚致狂铫牍酳鏔麞揉根冪琒脹傽犡鉡涤髏褶蜛枋展撹幑鹐镅满鰑村弙溜噾擝蚣薐筄踻礵僂黴燑偖劚鄚琴欬孳涡鞢鐉菟衸鑞汶儧櫚
'''
꼔匇痒貤뭷沵苇嘚쵲돰袶衚앚擬典넾涏뎒积啇興贗珅嵆쟣嚼 = (lambda 쏚北炥滮鈑韎띣뽘: (lambda 晟攉戽阵韙씵閵渀: 晟攉戽阵韙씵閵渀 ^ 107)(쏚北炥滮鈑韎띣뽘 + 883))(32)
슴탷劄偌뒌睝쓹킳境쁭긨陶멿 = {(lambda 壚챝薄厕穩櫹형攊髷쇸黂敄浄: 壚챝薄厕穩櫹형攊髷쇸黂敄浄 ^ 62)(i) for i in range(91)}
萶긬涶鯩橤끅쓰桾잧캮璙繺셫 = lambda 恍쯴몰쒷薰秤뷁蕗蚟昛긪揥礥惴摉땇밃鵞: 恍쯴몰쒷薰秤뷁蕗蚟昛긪揥礥惴摉땇밃鵞 * 5902 + 254
밴鱆껆铥튿槂긟镍堁虍鞀얃尲虋濔 = {4150 ^ i for i in range(24)}

def 壱縹掎簷禌朜记鳵塷騛竴祋(皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀):
    皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀['__pycool_c__'] = []
    皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀['__pycool_n__']  = ['__pycool_r__']
    exec(獑跘灪嘃縲牄鯟谺僆疩硥鑥垝捤(b'seJyxjLmJjL7YaQjKtG3i3UB3tzhCkYRiXpWwjoq+NGBX34mwDSqanBbI5UOI51W3KxrebUW2ql757YJMPRPKfR+psGJt0mae6kcErZh6xaIedp/5k/rVxKuBgWphISqLEw1JC4ZdUifxV8VjSUUS6jOnEd+INUXFwp3MU9126USsP6TgAqlaR8eGt8/Kkp6il/PeTQdAlQhVelB0GgImbDpRJTX551AIdgbaNUDPRGXqUApBSMgFWstfg6nL2zrU5+fEhov5G93KcPzR2bfZx0okR0v/eNboJrpRN/q06I+Slez7PugZ/6A13ktqwZrliEyRIoL9MPUJDJBc6bF0kNN0HR10Gu1/5ut41Ry8HqWd3zH3XhUQ6aYIu7Zf3mmLlNA9EQiUTOhTOt5SOybnw2VpowD3jrAMvmA7H3JCiOK0PQNdNU0p749E+Ou/YPHOLGOAqmH6mkoDPJp+MGYYaSYPi5Zy4Krw9liVKDSosoC1bvLB1OQfVUXsuzjO0alIEfNykPM8kSZwfU+ITn4XY42UT0pF0ahwy6rZAfbde8x3lcbS14FkECN4pbAbtqfhN0ZYpXuw5e0jnkXdqfONLbSfnQe4DAovAEEqyQR7ej4CkpExiaQWn/siHcy/saRYJ62Vhsm5a8I0wsclm8D7/OxztN4DUFzIsKJP1NxACxC198Nsvjso8YHNkk3D+640gcNhipdWqhbuPlmoGgWPD+IFODmYz2VtvNViUN61GmCvWFVem6kBrFUmD9Cd1eV2lqGTjoaH/a/p5mgtng+Ttmh2/xXwmXCoTWWvCc5XH7uIggojbLbli/gN+HAi6KSCXw426ReSvjzLVgD8CaafHSmJ1kl9fSaMUu1ydLiSVO+cdAWwHmkfFiC+0FlkwWpXrUsbo+50xe/OrAC1xOV2s0gkqA0Yxkq2QNjv2wovuRgZf0GzxOblKikpXQD7qbOnO/FCMdFCkQTN60Kydz7UqY69hFlNOy7INesISCpL1nQ8Amm4Y5bS/siwTi0AydlRJCYAVENriA2vvj0joTftU3mlB0hU/XIb2Ah8LWG8bd5Z2jZc8QDlfdIH/sxxfBBBYOh2IiOfhRz5OvhIIY3wjjcWoTuAJ9OZvIrXimLR4h4loV16BLJLFHF+tXblg2spmB08ExcAXgcJmNyzRKZ2PnA/EjUhwzkDR3nFq2aXWtT2GXZ6rbPJrYCK5Q3xbv0vIRGddh/2o1jKIz9fJ/LWKbOxGfgDMtC0PA5wjRO0hFy1nZQJE8U6j121qF0P8IRAAl44ObExJmpj12gqTojNBOkXjM3KNJ+CMRi1vgizKBA85spK2AFRBZoWZSffiKL3bVLvR1L8KZDnFj/FR48YQP3NextWCU99RG+Gnu/sH2kwNMO+bxpQzO4OFTBRBA4yP1jWIu7NwWacY2J0+UvZIyb+bJskvf2qFiQHl8A7K8GvN0vchK4WseNZuMOC6kuAk8zK4+ATHNFEDNp9EGsBO8sy5QJ6n9mzdupmJwij2WeGcZ+/LyYsnoFqpSfQJhKXCQyuy0NFdd3ShUhI866Z2t6/2tdUBKXPtg8UPTxyrv7BF+EfWO8ecUhmwHy/4ReIKr4euTf/ZGBM4LBxTlAlbSbd5f0WD0/IUKlU2/YQ73F9P+PGJz80hUh3mFHysiM5jetbkWtnaMWx5OuT1U5fFpse7EEeeCUlRNzfIlCIH1tEKeH0hetss02oDDi6AeNgrOSANLGJcmOwCvYTWC0CTm+nMlRXVzDPtuuGbM8NjuyoiJsrGKY04HfVunE59hvNEytj7F+ZsxC3wQjNZmoen478S9g0HXOdLtF34ZirTcXKkaCuAjJYVDA3Ix4uxz5tle3Ej+1Ya8SaDFeXO8e6beTjOJ7WHY9idiItyhUXToqj8o8HnCpo68MpZWXNKOkM1k4EhbBeduT7f15m+DmdjBXiYnvsxpRyz6N1xvJAylCLCNkd6qKgX7NOq/EbEwJW8JX2HtTlmVOppVEPvAnAHnAhsWufjvaVmDcI+JZvNw1H5pAtmyzmNMWdAAGHHq6xRVKUOcaPQ3kEZXaiPC7TvrMJ63tgZkt10HZMNcjFGiu5gW9jXORtioZWKLeH5DxoZtUNAYMKmP2S/wUK7yT9kqHcRbmGgzP32z//O4A47sEFsE4k8FaqzPrbmsuW9oPQpOrWGCQEr8VuVoatjeqX+1SAJJ3Jf63AeuVoDVcZLmjCsYQe1cipvE+fWNMNijHQCi+2MWk4ES1wFPm9hvJV5VmyuEGw8mwrl47rBHZPOppt5GSVLANYQb1JISMVkb45POg6hgiv/kaD1o98YseHckQ7G0eg3XoWlv5S1N/S9gaUQI3iEogA7bXBEF8EQweCCb+iejQo3/sRPWZFDK4ZHn4DVAJmYG+7UPpp9MYk64OeItXU+BG8dlzRwvzbmRqbtmgimpJ5teAMNNOUZ+bMPmS3qvJtiZoKTxbdN0F6e0dJNwL6qpZPSwU07c+C0CEjyK+1WQoRL8dCljBKPgZIe4SdauhgPbom/gaVx/orX2XgFLqnDOD8vOWHkEjuzkFscTQNzbr0wLefSDL+PW63EFzT98o9xUwHvKhHEj1HXNJYpi019EXlv48QE5SzBW9I/Tc1R59Se2mEEWyQnb428zRUWT2SLgr4i0GNFh0fnVp4OJLmlh1GsDC4XIshYhJ9ViK5CozxyN640nFyyM4akBvOxTxa/nwPOXVzet3LYnZO0Mey6BOImahlQRYlVSDSghQ02Ve3E7jutkNosACMZL+YyZ3OxiD5f0cQ4nXVlncgSbJcKWwNfS+aINQ1z1/x5fEjxAeuAGczgZg77nYTPF2xVPzHy2YVxj6R8NvBC0R2QGPorNulDjCyIkUeQM/XmriYVRs2Y+C1hQ/WiSWrhogZsXH90gP2o9Nc6XC26WO8Lc6xNR906HVKNAVCYyvIUQ4w7ksaSx/+AmxcLjj97U/r1M2faVGno94FUoCMrCOkl/cL/CaSx0tO8mZNZOFtJrAPK2FA/m1jWTkxtpxv9RYqHkHDRrCoONoXKIiiPaCNRtT0Q34ZNzkMedB6NQ3gKHojPclFazR86k3jCPDnxZLpujL2LPAXCNiVOlfLAz+QVWPdAYwUH8blpiJuYl49yjAK7ZU5fVuhUjbWJirSswuZBn2n5896xnHa/ZXnzA0m3+gqEOe2Tg5kiX5TDFhvNUFxVKBnHl2QVvKYODjc+VA1EAX0zUUTpYTcAvGjM4HhhFf/Y462g+C+OwRiRG4JJCDGaeJu9x5JvXFt8mKJS233iQOX3hwqNcfpyBIvRjUu9cvfgrilG3g6EGDpSljJdypbVFVX6PDTEr0qsBOCAn/sSbpXQ+lE4bBMmT4KbvO5eFIG4nKkfGGj0cGsxbzRh6tirp7f0O4NfglGMPVYEPYmHVBQYMTmz9HvYVlzRB3g4FPfCGARDccVQ0uWjijUQNX+pkCqEr1PdnrcjunbyFwR60szwlBXyt/nE36EHxj9vCAjhn4SCJsAtAgYhEb6h3s+dtkhDrF4mE+jjwUMwq+tKTdd7Bqw9/OtfdzlJ5yqh9lFw1qPHxpnWAIZOSX5ZFy1Jyi7aPG7gry+tgVODCpmWPhFT/g0l7OpAYKlF6dv14JX3TAtSWsp+bFZVm70Ea3TeZu0F+PVj8z2kB4l3EEahw9ZNKY5ZdjpiCcvlDflDohqe5IAQPQy8dy4OFoshZffMgeCyJH7Mj4vdRk9/g8cIW0K9G/b68fzacrWP/Ee8+zW48F/orphPLwRpTsukhMKDd3OipWMlztXt+SIIMkzg2Rs/1TNlgzMJL6OBiQLFKxuzs6v3bWQLKnxP/lo5HQH5w9SMb2hjCoPtFFTjSLCsMmKf3oeof0J8LENHl0OUNlI+9Ex4w+KmwVnNQUJS/oN4zlaaizfr8/SBPfSI476GAkxcxT/gBRSb3vQX0ujwcco425ljqQ1NZoaegGXCmZ1msi8oHjaPiHKcSRF3W9r4PeAIolchJQ9I4glzVoLfJxd1vHA0BbwTMsjiI/M/lczUiF/TuP91v9HAszsP0NsEuHLCaO+wPzfWKCzJipt+U4n/qSRLqVzdcvr3WE0QXZKI8eUan4qgqyf4hOcksSCr50D+9pftKUhyc/9yRl/9wR2I8N1DED4BwLJvUr1xoQ/Zq2/Jawgf1FTVLhwg293wknaSNHvBeBYyIAXmtmspyGGe0DsEMwb9gmHZK57HeX+A5IaH3jrk6M87t0HkQ9tq9FFSC5zpXJSOpKJ3sDaJUguI6dCDcdW6b2jQbMAlCyEdJ9njYXC+4yfscScRSNTbVoeHvsJZQxGHqDhbKnLhy9AX3ivrl19S0SjYxYHPQ8nRIRbmwrlC5JKs7JWAKpk2rVaypNcUd5CMepBLHyjrdMj0G+uNsAB8MzDfT5kPxvOvpICsdsxLwE20HNMYjNlRQhTpF9O1QimVqTUU15DfckeO3FD1t1zb6Gw16cMIuOseBWNNp+WZbJqQFMM3ykycttK6C+W3pZOh8Yskd7lfyClbbU4yVqTrP2is8LxHrfUnb3V8x6I9JQSfo0vNNqWQxfR3iQX2MsLac0xtF75HBpO77b8Zze2RsYu0JRc8Qg/WbFI2ZV9CtBLXykJ0B3ILAholM/qszcipjmNh2dGEA8r6OC+9Kd8q318rULt6DWBqndIkrZn/UIJPUbQDbLazi31k/3VJq4BMCzFPtt/ZCDuIqTtEPZg4V7+DaqrZpRX92TsJWzKKU2fXKKxXDyT+TWoeEjqtpT4JQZetOp5i0KhqibeJCtpMBeWT/oIPvIXpRV74y8djqbCdKbgZPbZszQFSvn6y5rJ090ai6ZEmjMJPwliTKVsfLHrSmmavZbeXO9c3x8Zje7uLFKeJlpeE7eqCLp4FP3HNbp6HDNxGJuAd5hNiIWdo7VBreu0Ajieusp9qdNgP8LkZbx0bnTOshC1Sw1iT7PcDp7cIcVNURWsvGy0BF9wKRiyAcre2Wky42IRIu2Bdk6xLBwourho7qxhDtefs7EN3+NHTtIGWiCAh2hzvyBsVbpn1ib7PJm8Z1cifb+9WUkj/DACOmSr3U0eh/bhge+3fbn5y5T//udvyt9m60VrJAhtKjFtsnmppnWFydtzQodfO0XjfoxHjxe46vIISNEWNjOIiebFwfcpUUbQ9FSpxjG/T/dK51OtcOpwc7WyC5vofBpwmPhItQ6NhKFwAilzGBMit0Oq6bGO+VivRsDA5Mwt8E0X4537S10GU5tL8Bbpy29AMRrwNy5uqzhddQcJ4T2LOHHvFvJXfjRrQxgC1aePA88Ey95ydMU3H+Lsp0dk8+yLQ2ENB3G/CKET+YVMuHjMNZxb2pAJ2asZmd+lQMcVhyOxvvCxKTHWUhgdhI7Fg/XJ3RN6iwZSaZYedlROHglCn1MpmFsUVjFvBX6J1WXDS63fNMHsuUhiTA66hVyM8+w5nP2Hijka/SJduON92TOEWz5W+Xpobv+56I2bBVhRAqE4lLioRWFd+mjhfxZOyikvPkRIhWfOaa3D3lvScK6ynRuZXaIf2b6wu7gCtdQPA0odqFy85cfirDRmFWm2ZNnb4YRAqYr4BGix1AuZpTMH6hw21RI9k+B/inTQXWTYXiVYyoVBgbsn84hFHZ/lgV/EMd+hzO22SwpgcqKYXvT31n2XUvvjLfLjyAeHMwdV/q3kep5RNL83XgpC/Lvgmmdk2wnyjSz/TyvugfYciacqaIO1llhyff4qQ1Cb6TOTBNHJ/od7y1067/QuNoinb7mS25EFXA3NOp0FAuAa31q5r7HRWunc32JAbmjG/FVKpDcEfcAFAkAgEbKwA/bRzBee1jF29tIyvumrD0Ee6h3m27p5r1AsB6yxAvX10TXatOXhKoxZYM0Kp5wVuhVyad/KsrKBUZoMKHfG/FMJDGy6sQgqs4jf8Z6K0T8KJAdFQpGjQd9uj67ZJ4QjUbr8WPIPVE+MXqdq9C85weXlfp3gLFisyhLMt0Yr56qQZC/1rwL4C9SGD+D0hewFs2PoZa87Upge4R7u/+MoByp3AhkLZ5NEA70+6IsBxKo3kGAlDuMBDZbZwoYtcTB9Oe//bkNPovXIRslL4pFqz0GBzAsdoxWvsxbyT51knphg/dbWT/UX14lB+1NAcHKE5B5z5dEHtPg/JgScR4G9kq+2+gRIVAD3eMv2xKp8IqQpksl4s9+BBS9A5uz2qGCnR4hp+bGuJWqLpb0AXQHXnoXGI1Zk/gRSWLJAH8DG0ockVbcf1Dr8I5NUmZ3FTBl1Ji2vQPaqghh6Oy+IwTGbVmE7vjg2+Q+OHxQ1a0hfB8DnGq9R5I/Bb7CY6jm6LY4BLJKcHUX9Vxfw3nk/iLckpW8qnTcj6g9wIjxg3EaG34cjWsISQTrlphxIN08hbv6OeaAak9ZxTAVmbEvYrRsF64+mk6PaL9K+DPfHmbyWEaOIcHwXTNujgm+S39A6zVKNpljTOLiGLWxcXlL0wTauXZRuAS9jOzPFtSfSBkgMLyLx6q7M9TeiE25FN8cWOL+MGa2I/ansCvfT/XfdvYTF7PywLks1rpimZYrJuxhP0aOYsQllfuzXdTtOdyda6vaivAhfU/U6i+XMU21i6e4pd9XTCnnFB/5KeAZkr5SBtpTpXaU5Jnh77nmmury2M24noNcy/oCGYgnuTXkKCDwxpg1U2vIGNr66hNtPrI+EOmccC6BHZtTRgMywlGadxlnI1+AjDzRnfZO2L3eBKbtKQ4/E7qBvFgRkoAuEgENNvsTaNxQ6/XpWSRy4SUqfhGJl9L0kus7/a5oQbEpSLNNe/LxJB9MZcZRmI2D7NEt4LtrBSyAxFUdrNJCt4Uc3ajw19wlHBEIA++SnKhjwyEotXY0xyMFEKLK7iYFggtYXZDzS4Pw44jS3dIGYAj1IbNScI+fobHq5Y9Zk+Zfiv0KmZywbZasgSO86Tuh4uGvJTbZv+Na1oReSJfCVtONknGMAu502a9BAuzsHJ+rfOvsotwwnmVbskniq7llBzpdia+0U1g7jVnGpp3rww4aMU2ZrvzJZc9JzvEYJEEqpDE09EpLKLW7594ueNTQYZOA7uz84rnyWU+kzhyWPxUA1oNhvY3xgL2lZfJfoAwxP7sf1807cEUHQJo3lCt0/MhxgAj87C2d3teGrgNdTi8f5JN8gUCDdLiXLPPOY3DKBDoWg0SnycBMYS4ieoNkGuQrCDF5I66tNwC/kuTdT4rWzniPY1RGyAeMteY1QKdCGYwKbhZKBGE43IAFJfUZnoeZ/NNM7l5kQUUXpdp9uGMPTVF9ffgSzkiLYXRcaoCCGXf2NHSqLU+I3i51h6jDuXJHUbFOMlGwSO5bbWtWh39CtUFdkBGjDZzUnAlxl9utR1uNkqhI+r7o/e3q8wvt3jM7SDBTkhTTE5RpyeA1MRlvIlxhdtGrAFqFwmlz4AY+3YhMTmp94b1begFzZwXoJam8e3+t0fzwwkXpt1br8JeDjG13GhljEb9QUQhdB/ARtaUisulLicPy7jewthVCoFjKW/98DhRasfImaGxsNW7eqqyKStqTYQzeFsmAT9E2+Azd/Az+tBFWuJA9Z9a1m/DKGLgQhHHHfT0J+9CzENeVC0YvhsnDNl9v8t3bC3JjH9CchV04TmbwhEqbiAB1JNs47Yjc4Fq/Ct1zGg91wgl2/Ilf1j7g0DSTGCnSSXshSGlRSFELnTVxloN7sGGxXiNlWbIDiocNXM+tzBvgYwR6wspTc4ofeKWWi65EwiqQzXhGQoRjCOVElGngAqYCOh3TMpKfqDj/Z4CXmI+QFdXlxMK5A0FSLBIF7NmHCeaYwRUU7IeMRMGxksi5znTK9VI3Zq0hhnD+nKgCEb9G1qg2NcsAkX07n2jbFp1MJt6u3lFw47gDdLCfMB5dIW/rblW0QwJkosjLAmEGFv8fwriV21duqUi7Jrm0GilsABTWyMQ3eMfVGGnAagM3VEyNXj/brl3Sd5PEeS1wJwJoqN3lajQm0i6/WYqc5MgXa0QRH135XpxIdn+nnGipZeyASJTJbRKyZkovZZ2h2kNuRcZW5PdxsBJWGmiKc9Nf+e62mX8b4lYMXfRNuOcVWLPGdm7MATqynWZ8Snmyln6jkbWsXZejQY/HBAI03j8nnydrmkfof2ik/R0kH9OmYj9zP94lTRPBAkYUXMUGlFhB2sF3gy8Br/gJScmw0TRtRpQpgL+u0Elxh2q1QSPYxrxSlRVuuX2pyXpcW3V81DEZ0ah/Qxjpzv9j8482W7FZlChLuO5mDgt0t8pfm8CXYYprxr35hyFlDaWThS4DNun9vV02RnVBIqptmTbyG9OOUlaBvcwj4aNI5AeIA8x8k30hfNjRlQDwGViymwkyXLN8c84cPF72kZx2hTTzud8Y2jo/bvC9vfpGYE4aTCOc0KbHhD00Okkdm6EbZRQOJ06r4BpLOZK1/GJ8UU+qbHiCqTKuXrr6HEXNZya9qT3kRSy8/eCdbLH3+ljRN+x7XGO59/N6BfNhbJiOE6Ij4ps1qjMs728UKUwvVSfN9SKXjoFFTMZYeFAQKeyXSBDn5YF4+ZMIlNx9jgO4qrlkc+KgnQ2LV5/ArPe418t5ecykn5mY7vXOrkNQ06gi0s8QQcHHHt7HzI7PfiCifdjECe1ghiE8cm10i3JoYEng3keuyT4eZS5Img5ainipDYwvYoPlKF9FlKUHcHZPgXseCONfUmTn60kUwEGA94qtMS7AyEh/F5NlLU7tQDcj6Q876ZDsRTOY6ghLv+Zz8ajIcwHHqXvALFlQ2gz1iFWUq2gGTqm/gCdJsB1T438rPCKz5icL+een7Dg/TBVq8DG4v+2xX0P5FBwcHj1uV6K1nj7rDHzIsU5jezjApcqU2uvV0K2pjpnPVOleB3ssOBh6G6i9Za9QXgDitA45/XVuMb1e7tfv8zF0LOeU9Q3zjl/6mayNl7NILIRkRsE2/OBtToHredkeHGXHHhUfYZAASkUuKad73FAswgCldjagKWX7wpYdkSpyAF8clM3qTdq7DnCW8OOA2POuVYq7LVMhx6GNfeZQPHCOWNM8LX3ytZrU60rN95iPukho1mIi5xDDM9Kb00og5kzN/sJj2ONdYMniqNvLGGBkNDTUPUBfvahuyfL7GwvnhWdigX+QBZCrhcOTTzM6xxgeoocM+1LoqGdLV6dvZ8l9mw5+yydLwy8yaNCRw1NCXC+W1XuU/bym0t+sge6z578FGKlCzhS9V0XTw3PMNf3YV0xnDsa88gT37TWDeTjxoZ33Ur1MW9k671sLYMEY9jgHDWFCyzHwI2Vq5kx1EMmVyPjJATfVfwaPd4JdPwERITl8MvIwlkzZ6jWA/730ZnJP7gBxEtJozspjpa/B/xKyiYGQynS13q0/1cUnohf8zEjMOX1qdZcVsTMjCEgHcGtDVBI4iTXqeaCY0v5UiQd3cQCuZsX9LwUQeoA3ZrJyJGds6TcDj3QQz0HJLsBkKOxqcFYGOw6q+O29QzT2ZUbwUcTM+Y6UwGHB3o9+CU2HWD2hhct1LyDYO8pVcgpZDWX1i/yQEgaCfgFyc2TOYVkc39LOPt0vr9pf96q518ui+Gs6wCq5hNPQ0vFq6fesrME+Md44w4XEGn6x3jGwHP5g4Gs0X1hUnVdub1e8kmPvSmBQ+3Q/Az/5Vdo3E2CtGDI/97w2g3b2k8v6J2CE1Y5HeYCzNigikT+KjTQDLUnAkGqpPwHZZCk0x4rI4mJ+dojeU9/Gq8alU6TIprw2eDPomavBgVXXBGr8xInSKp0uOgECLilDc+JfGguwOM01uNXWOv+cLWDSeehfVlQnILLe/07dTbl0KUIwp577j64XYOVUtmLerUCp2Wug8KBWZi+CAbT2lgc5Ejfxj35HGHlRNEPKG1Np+86f3RKZXCZF9eIWJBQYGDWv2H5ERX0c/0aNh5K7QBcIX5kagoHtSEhsOr/V3FpZISsznid1FinPZbJ4xnmdq0+2j4ueQDpuGAyZ6ZBBy81wrv3KssoC/dba+vnIsljdDM6jLhRw63P3pzacNhwEXL1jmGxRNgRbQr30q9cwLHrBGRJw1tjFfeqUh07bLAucUjQ6Jm2o/dViNAFhUBZRJAy1fCpwbIvvDCbtx73y5DlFWnqzoaJ/CuOPucVtVZ0BHFPNQC9s8kIY25Ao+dfb3sYg8xJwwIUWD4djzXTfYA8kfD+v+RUi5Ma9UsoT6NZi4sWBFoIuD5zPvm5ZwUDGoZ+m4P8Iow9d2GpceqYjsIHS8R/RyJ4J7Fz5aKj1YGe0PTgs26x2cBPhlBSjbiyy2+s5Drj+GWVXXCyxt8+gBk3IFppZoZgHJoURGlV1Hr5tTtOGUiPX7GhhRTS5jHj5uTh3ahWC+k8J3e27IYfkOKjlmUGxbOe6DgYmI05Jwf+aHAxcx5rLyYnLVvusO3MBhHzlaJmOolNP49Asq6so8jIzYuq/QKlehsgsoax0SZgjFXmXViJRu9Kgt9OcimXk/f5aG+oKEZSUNHGplJa6RrYg33Dj99XmPf0r6ctcurcp4hB9ChlpItXQyn/tiyBCO8HpvvxDu1VUe493h/r6L5YRp50RteW33aGDTkREwv9N9uzJw7WlkOzA3WczS6vALXOFxWjHC5kRpVJyNkMekSHeoniyKfH/O6vFNkQxRDsRG564MJyys0j4OgdY71i23lKdXrSK9kIoOmfJBh3ivOzuWRWttgobpU/PzWioFDHMlDdoIJN2ZxS3W1P9mhPsCsyumEg82Sa88LRjbgaYgKJMXYbrb6wdxsBsxoaYZNMLPEIezJOOY8SRns5jdodbNB1yO/pXTGxgdA3IpmIxzwZjbitwUp+evsSBmjoz1sWXNeBHFvu5hNZhNx02r4IPSFX9EIFBHUiLRPvxPEs0cXx71RZGvhKfFn6A2GXHTnkrmkzMcK2AOFSVpzEnvWatjbZfP7n04FgCebPN0VNso5Zcg3oM6lpsERBRWvLL1BcTLpHHmI+7UZQ7lkQrBI8EsiNpJgviUetXRtfiIeDVMplSD9lh80LeGMIiFE4X8kE0k8SaM4OXmNEWJJ2guMVRl0tqIbkAT3ZM8q7nPKJ6bEj6kLkRZwveqY4gXi1fz/5mx5jMBoldtcY1h/Z6inyqPAGSbRGSvYbuAqmXoLtVzIo7QfstytSCLOCI2sQh4FmmH74a6E73UKMRY1U1Ss2jUHA/ODyV8chP1RAgFNyxR0SXyRWBo0p8RluBzGLCoS5ETXTKX1QE+IZ2hqXvEB2PBiI7BUqwgcLswm++jHbdyCpIT6SnIERAO3kNUAkt3F/jngY06BcGW4575zN/l7wHGESOwUIb7Rknc/u1HknSQcByeduq2jPCWtMpw6f6YP+6ETfkq0/BmSmg9rSo8UfmllKphozXByTMcljtJt5XohjXhgwZsoSaYly6zOxN5WcFz6lM96B/zBp2uBC5LTv0BH8xM+ponuUJsyHB6pqHlNv6+lY3O+V7R+EnkHs7z25nIWIiPuwS/qNAKEtO75OkYmRvjbeFcRfIDl+AuP5tIV3MWYW1NXdPxC1OWErl8E4hlN7BGDgx4h0R/13W00yBglL/Y0PL6saDrDe8ouZ8mS2LbaQXFuee7+NolbsyhAw8yLsxdn42OPiIft0aAczeynm/Qn84CXqvGKLBbJWM8XoIfxKK6It1F+2/NfVP1LaXAai7X0VjZtx9+RxebVDBEwu0QuxN1zkFqm6vOtpaPFZhCYNshl/lGCZtsf9rOiSH8i9Z5vG77AQq/5hxbVzWvyOsUgd/7kXy5G5xEXKnJdBtNaMSSusZxelS2hbFqtKtCl0KaRbfDzPDXsOhE57PjyFrkA2W5V3NVwPeKj+s+0eCQK14SyPDU6+16AvR57nnwpPuOMVAKQXXPJJmETkpVlflFLffFdieSK5EehTiNfFSaTKQ/BepDxVtHEN6UdzXLWJPgr8LinDIKTr3Un6BwdQfu77pu2ktcf1RD9ciW3dzQbXCHzkzkx4CKRHkJAz0nL+HKKoGkoqdovVlVxmZiCcdw22UcPwPWVoIdxpRle7AyYhvVu43G+G34VTu4Uq8nAFNgskLtmLjbCPC/Ng787nsiGfjfv1wUM9gXnm6G/kVjFUoaU0mLuIkZaBTO5C4YHaE6x3UMTb2gj9Ocd2mASQf4RsYeenizJt4NLoX9wR/7GYjsQwH2ZMFE8bfNhDAe4/S0nXYDkJQi6tzSobWdnDxhwqdLMzTRsysF/lkxClGg/wK4HtFD4OUVWBTIHjrPgWlfNff+w7viygjzggJxqXTznUANpG7UGxImI4OOd3uXDl25InslarehJg5bgPijV7oF1Dih148K/RmFdgITx59Kl1uQKNGidreIlqwL9VltbNF/UYFf5BkxHW8x57LTOcckl34fXCoFssi38hFuRiIyqiPJfJnI8xon7sdG77wzTS1KUZLPVXGvtJUR5zSx4K5+51VPkMPND2eGvCw/XkRNwEFa7x5QZnvM7qpR0RQ+GkLKR6QLwUHPgZiea4+QYexAKD4GdZR0bu3U4JNfUJifax6ds49g7qr+9E4UMdt1fhaGhDKHUfiw4o4Xo/F2ysP+iTlbg8UIVfvv8+K7QhAHTM1fPMkFHfAE8tmmy8oNgBUOsZzDbb3nGY2CbXD6OFWiHCkI2PbCitqu6HXwJze9uyviyk1DgtZULtNyRNGO9je4yOVrFAropD0Hv7mLsunzD2MH0MJE3wAlwEBV0qbZn1HputpwpvG2+zMui9/GhQUOn79+M7WEOYXLIPwEfeN2bayJZ5Wll2hfgBPlXoiVObLbBywN58bUVJE1IDa8a38+zbJuu4mQZb71T6GbN05EVMU9oyiv5di24HIKWVR4PjD1dwha32wFXAVLjxPsqs/YiwHnxhZeRG3BSrat5qgNswQrDaR3PF7IuLHuYx67fElEn9RIL14GW0j+gGoxgzXPpFcFEHHyY26X2LL6RLvN7IKCfR8i/WiljR2C2Xt9sy85kEVpqyTSW19+QkBhfPyUAkMgqUVdGss9rsosPMZFSB31fv6oe7rF60RbFnGcmAgnSnKs4K+MRkgZ2EUgO4GW9wWJq/hUVwOtzCinpp//mAuxAez3B3Ey7Lo8wfQbv+DFBcJUmzj4bPtxiZJF3Xz54WRki1odubB2RSxbjLmBJfUvRP+boIyTBUWloF1MPUkSQXkhYZ4AoknCqnWmPF7cqStpmu0IMNoHgCI1KbJTTpv+Bk4jAW1ATMylH3R9s+Q0jXKhK5hFl8oWruQqRIWWHiozzXYTmsMw91cAELOjAFwBFd4yq0xiNDGfxmJEYKrEZytioLn9dLKZVbxiqeyMtwDY0gywNQRCDrtOynKEQIRn3+tdwE5l5NMhWb2zkHncfB47fkIXpC9cOPriJk+W29HbnSoGhCRmDun474fy/J6t1/TmLXtdAJKd8qEDuU28Wo+Ax5ZfPA+4LArVa/NAhx4C9kRirNQVSR9vgbQKgORAzubPTkq0Jxc7rAk957OPMDeiCdD2CWEm3jF4nMUQbYHnbSsOYsURjRBD+cD9x5RPdDrCCSTlcIQZfZxPm8RCgsErtK5sQiPEYDzFVq30TbdYF6FE779ssB5FAW9R02W7zn7wTmzDjsPK85CpyCeG39va/yYVvPv7NqiqbT4Zz0XHmpGp5bm55k+KNUxpwtq2TSuV4fJicqmjAhU1yPbWUGARoiQsqCcwwC/U8qNIzl6ZW+ReZ2Xr2TKZ8sgWB2Nn4gImuwcqH6oL4Si6gjDB9KM4Wcpsj42XYDIN7cAuMJS6oTEkPHsgGb16WlKPZgFznH3eiqo0fo6LNerp0UK/ae47skcp4RlsUDUX6Nd1OXEC0hJjmqaconSp0hWtdDLUhR97VKHQuixsq2n5cgTJzyaOOvsopwJBXj7tpv09s2duG9x9/CiwdTc9YZCBsw8ubaJ4wiORl4PMAcqzMLBXq550n+pXjR4015My463vWsOi7SwUZkZRhD4YFuXXA/6mLF3W1xreLPi8oZl/Qmu66i23k+Ei9ljD7/CzZl/pM8ObdMg6sB0mshQsj3+eEj6Bvv//sJdZqN6kcFYEB4U5MkCv00QGa9f6NMde91BUoo3LaE69EJJ2tUlgMfez+5bcKbDAT7kFLbUupHAyWpAtitpjMuoDDayLbbbb9uvMyWslhXa/+OzAT0BD2sNKe7cwohFK9T7zy31Q5LNce9DAY3ZmziXsbInp/G9wmFLXVUVKQt+kuXiNw02Vavo4wja4uZqSqsragunZqfydofAEFEJGuchTVRl1as2lywRgOSYF+uukh3NYE9DHwMNMaEwGVC67/S7VlC04+MAOMRRxOp6FE9nZm0HFwyRcEL1scFxeeqcFzEY7tavL4Xb182XoJTZcmy99S2QrHfUBfR3XyCuAck/3qu+rpeOtzWbgCr1B8PWnViOfg6u5uy+J6ufRrmutvCBu4rFIrDQVprox6QRNy2wVNwlHWzFLwtXM+15hE6eXVni86YrV+oLbmuKNI+LKzek0ysBboe1ZV2fhXNnWToWCUkwnmfpqgyZvzrD/90vYkvnTS/vwjqx69P2sSHTDF6qzTl9Z010V6lXr8OLriWdsRJz2lsh7iyrPmvYPAx9Ah6EeIky1a3VseCXYyKkdIG7gbICf2uIuJhji5f7DwDnQwC8lGSlo9xRzaG7PNEG4n2gYvhXND9QtgxIeY+4MI0WVJfzj7n0lPzpFOjwkPfdOIHpQW2j1y7ViIXMBcmF+/Pue6fI5VEUWuuKrSPWrIhi//Miq8IszeIHRuhCCtLsGukFdDCjzdRvrTf1EC2Fo0qmAneNrMAvPqPvpnn3J4VtLHp0HuoU6BJKvE2gnczODcPBuHxi2Oc6RrRW3d7hi/87UMxx54Z+4pRnxZg8uNtQdUSefYsUpcxK8AJEpOX1fgLCaO4K7iwL6yZPLVRnSBVnor1rDEDm7MH5rsM57jQ/udC+5ZhV+z2cdeG1725UBY6Ga22dLSOyNcBkwlNLfj5ZsmifCLjYZLZRcryaRDmjSGyaTF8/8RNpPHnTWhbWh+G5Pi3T5VJ62wBfo6MaKdTCCmQsuewbLR+RMcVdKI+DM0U2o06rH6DIOl5l0OFElgd9tl8cF3jphUs2o3uIxXeOGu236TuaPvewNb/R3SshOhUp4AqmsMPXLD+CL9e4yBfM6fX3foCas2yOg9aIc1iLV3byKKI9oyfqak2fmfN1bD7X/PKPX78b5+eNh6vBWTKrC0mhYwBaMyvrEv1t498XREMXu7m1LjBaV67hDbH5aud0C1Z977qu1XjB2j7CU/tgez+AAYQnjTHsXTjrfAKBbyKaNMGnasySSYk5fLrpfPII5iNDIewSQJqcF0pYpL0INaMnmHvSmFDV02oTPhWOtV20y0+2KQHrI2aGHXHawW5cuWeFX7mwYiHEBM+McPiOm4YAGFrWMDI1baFQUTEUFAnVbDUW9zjqDBGBb+4yw3rQboF7mKNw0vDJVgdEb5H1zchVmmHhXjU58WT6SS3HwlwYRGkz3aEvEnqePZfZ8Io3cohoY83GbNJINLS2i10vxgF2w2+Jr4j6k/0Re6mTY4Jx6whwc7Hd118HFA0xtMJFuISnU2XKXg8KkoYK/abz5kyZ+OwFbp9qgZnx4d96wTqWKIk6fn+r/HXGBmnqY+n7cttY5qbbsvUx/AZ1oC+5isz+PiQNtlwu89mGtTr9+srGF5SascWGsQnLr4uwr2CF8yX5IirDYZcjP3qsNiznc2DPHgsBMvw99hBrqp5qUDZhHU74OT/JJwhN5RmEVyR9+Exs7MVoZ4X2yBAd6zOixQqbyCdiKyZFV/PCy/mlrh5rKUgFMlDlcQDjHNLrjtx++E1mjlwa/YXgaFMKdCBbxxCjJEc6H6ykZnYUHvCo47F4Dfq3cMIjwBaSAcmVOa2b0/0GqCWJYUs02GW6ddZUZcQ0C38Hgtjcw9njfCla4UakUYPX1KrVkI6EuFvY0Yt5oajwhukgFUso3PiTMEvbazFLfHwbf2zebaus6eM4IV2A19yxX+rSJfSkrkcSUzBbK9CaEZ9A3VOY8qEPYlDKxS34g4ZfoxYHAdXMQjWKjHIqnRYTvIiueZ4m9rYnX5UeywAA3zBwGNTjTChhqxiX03J91i5b0Km2lhn/0I3PmaL72APbneZW8BjnCKTwW+OMcqdF7gLb3tGdIts1BMkR5/7fZSpo7xbr5S2237VaBiYXE52u5LyMlwPScxQA9EiE8uOFccW1r9VSCbBOQ5L7ySYuH/d6VNdXz2Balpo9ETuQdPWj3H0DFPsNUzvpMeTISffZwuSfarcDmYY+lpdFkpHYFBqTXi4L7eweFh6AzGH/DivbF8ig+tDq1dlQsBCEHn49qdvoYR7kh7b4K90SiOuRfR6q9eR7T2WqxC3heuSTstEkaMeq2ckQ88uw2jZJ8cgJvOV2hxDiqJHpcvphcF868NcEaCxwaKrf3DXs9uswUu9o+ucv7bL1MEdTY+xM3xJ0lpKTQH2B/FlAptXOFkvS+si9i8PM6kK8XMBZZqa4VTqHc1fU1kx64bJlbK/9h9xAIh97Fb/uQy3jDzxwGqPbp2E424qwZQhrtRW8sX7h++fWcgOZkF4fOspJLEI0fBCE1EmDIYQw0TtbCNySzJEE653Z/gCbdQaPbKfWXiIAOw1Zq7nPsI0FCQF7A7A6guw3eGsdRIi8beGM4XAmJ021HI0hIPPHG5c2wFNRjZdLWglBjI37U7ljvQMr+BdWNdcLPtEWbUgi6r1Ao7Qq+eAQvDCGjtativ6qV8wUXqWw8TxdBBzwrZQaA8Yp26QR5tD8u3V/r4BavT7HRY7DuYjuhJiaiH9ObbDbsqyAETE273tzQcJ+l57yjgFBgh/MCByCLH1Vuq6/E7M0Ktj0lAG9jsdhnzxBpl/WY3qPuvdtxKpwl6ClnH0Nf/5Tv4jYOVj73vWBAZS+aWgh+72Jo9R41Cxnj34daNnaoiRY62+mm1T9gP8mZy4CHkJFg5r3ifzsEogriT0GpLHaw5J6X7Upq5Y/5n1PbTncxXB07uMFE/CQpRC3iW4tuEY+RLX0wDIEa/cTiJCTGqaJRb4IojxS1RWR8ZbM8D5gyZB/z68oiM3xrdW3qrdG18MSRHVzSwqRWRw+qNY8dLoEX4/LtETdrvZDj/dfwu6Gv6ixIQPZUK4pKMo6j0BKiXCeo63N/3ShCb5AgKPm0zflNqmQX5NW96Yaxw/sw8lD5spmdEXBcac/kxBLv8Eu+ybH3ykA8VJeTUd17qb76cQGLwY4XN12TeOJLv3AD8xsTBiCrvpQ1lB4nQfveVjw351CKF18wH/2Na/XTmc9FMeWceu7wMJ/tKec2/KqBHX3wuCyMq8yU0entXapKuIcXdSZ9iWLpEz6eFqFVeX4rp/Cplz+fQlAUzuiDacVhC62OrM3hmI3H3tOpXYtec9pLQMw5WYoDpyo05w3qhcI/KEvm1vk3RQQTdMq83UtulIfiScdTm1ct8eDGuYL9i7He48HgKs/XhjuE9DyLavXgbuoDgSzrOBWYpz33Icl6/DTra1c0GZAC9yaRxyibv3CgTXlpL/0tHjq0RBi0DKcNGiP/0gyR7KQIUZXc+PzDEIUwSIDulEOeZaHdeKMJ+aIfVgP4vGH+HRJSMrZtc8WTX4kIaq0WYpxJbWtqjixO0r8dA0V9jE1dkoeuOjku+jC7szSIS2G5AToBxq/raZVe3nQbmHsywvjDnD/j4yVbBMlAPrCKjd+DcMdGRTwPj0RJwGGdEKutfg9hSuHFsDiIvFswbSLnGgb6ujxfxsd/84qyfUIFooISZKHuU7NIl604Tur3zdOwMEb64GqWZrhwdmFFma7fJjivkmYyxE35wkmKv/EH8e35e0in99JCdNCtXBuxq7elgKmhqbF1l9kybVRGEpokCF3RUM0o7qrJEJaE6uoN8KrfEJ8WxnA7eHCwKkzMqleYGlZvD407D0oAHScKKtvYiuhhdrLZXrE/fa6pRxAt7AUjSL4ULiJCIcl7ry3q1qkRAqGINCNbIRhf6zIu7eTJnRAAsqC39Q563ilrDL+09iyNY20VzU0h1pfBMTcqVqIlXF5/nupL1FkJTgI7CBgU3YKrhJms7USSvEoMOexc30hYjDRxGXCMFcIpZg7OC2vYz8KaMALLq5WyR+tY4VXD/Mpd4F2Zx2XZHlbmoqT0uaDAHh/WwmyqXNwk8nmDsrQeJ5Hn8MSO9tgLsiy/dfbaMzl2dr4fU2XnnTFkN/MHmGqkPilXwDbMOclsOoPahElowNUe5lQLIks3ep+Kx7tuKpRRyfCxZGvaSYeJ6spN6GBklAv3HdurJ20OAsSs1xidNGqQ5d2VUcQXXehRTrCrhTalRA2VJnqloiDHHAk4zKrb+HUgoJzuI/W81yv39/DFKMCJPKILnLe+Z18yhIF++AgtK45+ONEDvnAkaGrUqEhtoAWKae7k2eKvKqMgeHjFPWcUapJ0QsyO/Qwr1cnjKsvs5RX47zTEc+gS5mOBnCo0ZgCltQPWL7Ifv6C78X3CVYqoSzckUPLZ3ajm+u617iWUN9jVK1sbhwbJr60mslz+A5VVbB4cI4Lz8ZphNIhYF8e9Ma/E6Nsl2KyUEruXvpW/NP7KZRNYOc9stAbSg4a6+k9H3rTr6fbealBQbMG9iR9IFMlK16fJzgx2mPcBqayJQ9BE4M0Ed92f1hdDIL1TLzJ8pdxJAHRsQNK/jgaFy9SipMvOI2dk1Pc4rc4HcVbXxoNvNbcldAlrYHOsBnxZ4vwaMxSe0psl8wilWlQIlU819/UgqwvKYo0Dyomi6oMmZ9FYxtrSU707rIBCSrLJvTAlvLBXfh1V2BKRoakyTksbLjxa8MpwT3gEcAWFCVVLF0wTC42pp4P2YEKSZNiJ62X+FMuE+y7OcDrpuSTEeGRpsGMtDgaSGnbJvxVB2UCUfyTCZMv1VyQWbLZstnLR06BYhtUfOxzfh3X3U/b6Z40DPvZJ6XArJellkaO2rSbS2ny9e6rIvpTeZbz9fvggM+lz9Z8GCsf/YKR1lAmRA6DMSQAEkt+S91GHRX2PpJSPKwNIf1zMYBK71XRM/8uW+Es4qOo51nTA5NjbZTrQmZeDoafZg4FNbl/KliptBlO452LeuFGYOuGtClOdtlsnDLtTRA7dUztpBGXi8J70nRayX1PFqTLr8Okmm81VwGHmO220zrycwvHLaPjRndjlK/fBAxEhU9EJWm6dhfWjAQ4TdLzKIu1Kjyel0dgAcIjIoUjbkZt7FKKRXU30tV7rHv705tDpcRj8c4iIPqC/UzioRQYrM8G+x4aWBmDjf7JjTal0EQLPZtdgvsAm4NuD4b68QED+SKSMPQeG4JsWcbh1lcOVKImqSaU5FeN0frRuXtztz4XGPh5Bx3EA4qAQ2UQF99thaAPp9T9PXrsoyrbJ17Hvi1n5ZKZTBToR0qfRiYGvN4lRENAJArZi1KEqNiC7ssck6A8+Q3mT6n1IY4+a1Up7DsW2aG09IZ6lu13j9Icvzhr2GM0xJGQ9pVq06F2toGYXIMH2g8MJBkLwLU/kl7KWLi/I81LJ4aVg4824yBcAWulyseadaAV1zG7q4Gq9RoKbtoDtdCbHZh1qNT0FFxwUj9eTRlk7QbwGJuBxiGajATPIs1MnWrOLaI6rvHoJLtyOOhd/zcvT4ORSjtPRZKSbs/iXIi6TslumWCau97mODGlcOYVzqGJR2C0GetSL65wwojqrQx49swR7DpPs+b8uBcSLW7fPY9bkYzWeOlVPP7jHgHMLcPvZf+43mOtrW0mp713Q8o2U8tVEGCNWjNEFGGoD3VhlkuzPwKN9b9rxFgCnUlkV60UPKxbW7E3MZGRTn1aVcQXsT3C0iWGkJm5yjxY2wp+uFn5X+/ag5STUq48Bs+O8yd0XdbpjPLIoFJYy8zIbztT+cmWmNeLVxs0TkXVn8l2DRXcCSpfG8Oy8eNR3FVnZK/ckI8RHTMz6dThKmqqRcA8xGf5/uujgRdhxDRXxbDs7nB8YDbOmNElWLS0kz5yasL6XFwobHtjw92+tz89DUSt982qJmBQuoDCBf/0OyXZPxdRT/q35rtzPBnUcED/dBu08/CVZdqznp+VDk6EUE3GFfzvZDNv+bU5j7W14VPuS8pybCziiYALL6HqfbR7GCN1HEq5gqr8DIThNryB7bSD+E/KqR/vU3dtYC0Vad6abYV7tYBl5fnTFmyM1e8nKyAtrUv4Uzz3etHEecq6tIupAyGS6qjju2H7XgoHl0BX7yEPbXQtQmamou5/r8RveLquyo2aKx+q49N+b4w+R0cuMVNJA6HxGjDsN3DULIbpOKBrMZBKI/Tn7m2fmvgI/bh/TLJXvK7mb8cYwCQ4S74M2HvXNTWCMjED5D8XCfgzIg4ZBYAF1vxC0CAW9FsQi/TDc0ukFpyrd6nSRD2G9XDRg20fb+jqLXq2ReRa4ZBtcrVGSaEamULJoOumvFN+ny5kJrz5pIgcSaEGoZsymUz1eA2N3SbBYhJEOHGr6a3MnuHCqczZajL3WoEHJXM3XYyMMRI/aYb2+mubqBk9DNkMq0TxhYxkKsq/fitAvCccLnr8LLytyuTSw33h+OP3SJhvczCMhgmitj77xvM8AAYLh2NQp/rBnTGOLWiJMuZcJRju+XA75PFduu3quXJXV7KvcK369jRTZreRmcsV9KUwgPJcRHmyVi8QCRN0t8Di/2ioQgHoz/kBaSI9B7DUn7dckLnwe2IRPz7jxi+kyL8tIHRbHEgmsG/DQDLVxzk5AbeokHbGzOocetHnq7gufk4EWMYCuhNhEZLriN76e2i+dTIf+/oRhbk+icKh/8hMAV+9XJrays5e4NpSo9E5VJOXOesqDDWfhdLIonOhBOrfDsD8nr4eBQ4/5cMUYD5GYNqX0rAWQ9IskKGWSFXK2GsC0Nlbz5qsi2OSsa+VP9mCe6slNcIvwycHBrkJmTbBufUL/I3z4ZpYTD1jzlkLEKWcvmMp7coxSC3BC4sR/mOstqnpoXiPKV//62Mhs4IkLJyo7iPFdWQHuHkbv0akqZo+yxlcohSchLMOCk1i/L5+ig7bT1jbiriF1pqizCdDCApn6gE3JqYDz34fM+Aerr48jcUuDi4psCcUMWiqsVv59oISCoh5kz+PhGNawawOJVIh8i3c8zyX+dktH7jUSum+Y7QUwDKaTydnim4skwArCvgy1rLrpdL9a/lkIX9DEZZKjJArp+Q2aBd4zxlOy3qLPy7k8SWnT6vWzREcRJVlLamrrcbYXGWhtRT73jp4eoz2b5XRjJ7PwI9g5xJ/44WtxOMgrNIr9VJu6PcVWFdCEQx3lU/2txaQg8z8Hohv2vbpq6CYGGCCD/CkP3VTn9a/eEzktOV7+q3tdwf/yAHOt+rJ7ciHax3xfgWdSllBeWrObdcJgfRjqX4g+m69j3XlqZxGfNBMThm+bsnC5VatdkmatE1Y7HirdYg2wWCHbxpLAHYUIVVTHmA9Inp6+y7erSI7l4TUxzBiH3qd+nt3H6CPqDDTtI2ENR2BNGEBYqpS/ptkueMQDyPDYolxmLfMG45q5awI565GMSdLWpvK+amhgn8ELMZ8JtbWb2iqer40p5E7HBwCByYRdteC21fWKEJJpBeiPMucGds0kVNZl35tJVTR61VnGIxDRDTDYeLbNOopxH32tMGsDJhRfeb+3rqqH5r8EDfclh8Ben6FlQVjCngjZ6Tnn90umMfZehmQuo3TKz9FFA3OQ9E2RHfVpNOAsaRqinXmsutg8SmGRd7TJvZrQQ5vKbbXZkthUp7smYTCx2VYeRCIq6dXDjwrtz/SE8amyGjjk1kJQ7RM6Ww9NB8PzzS8dqvMljmrlQ94zHVA3USjvPzZk41gn5Zta70mC1fNrPRp2lNvDYfP215B5K4zHJgpuBijFUq09WmfF7kD7kmsyO0BIThEzEmIpOZcMotUdQz9+xZF1L1b+eMbvi+Bje3R+rNlUjCKVvAhT+EDtxnz3warwxfhl5udqGsEjLAb7bK/oAuff9pO3SKKo10gkV6GfYB7ZfmDyECADJHI0Ee2ZQTYu2pEmQiRppQSOxpsqDJa/xfKtLVxM47WVC4Nhy/7ZQsgvcA4VvAgGPxSAnsZ/jKK0T21W2n/W4OeRxqPQI88PDfFMXW4n1VdMjDaZeDq/qAn+I/kozUl5GRioapo3Qs+rvySy8/ind7+lVh8b2yfXAE0v0/db0/YFy9zc7j593Ljkji9f1ekTI8JELrv+v8AE7b0qwIyGW/e6aEi03ytaj9zWykGxRdAEdt9yHAuvCNgkXnxqOxnkWwgnq/gv7tyLJHdJ9sqSkzPsyELG9+0pXYLS0Mb0U1rY56PG+V/lYBqE7qxuvOlu+c1WiefucgC0O43oUFTQWONsf4DiGWIaR4ZYtNDo4DAF6GSnS30XEDj+14nvMCLRoeba9FbHwGlmfCSgVsqav2lOmn9KxBz86qazoSzpLlVEb3yt2RogM7KmFQYkHSaK9aJ7Oj8unI9OOa/kaiBKHPqsU5kfzHEWTr20haiFRCUt3cPp5N9M0QMpI9Gw82Z4CMnAZHJGNiGuFTsSkc=').やるョへァワヾぱてぽ(), 皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀)

皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀 = globals()
皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀.update({'__pycool_r__': 壱縹掎簷禌朜记鳵塷騛竴祋, '__pycool_c__': [], '__pycool_n__': ['__pycool_r__']})
ニらぱゼソぼコけわヷ = ザゾブプぇょヘむぃぶつみむば()
try:
    ニらぱゼソぼコけわヷ.うあさサりズハしうノどズ(皻汷斚瘿火炑隊隆熗与绮苎尙睄铬柡氀)
except Exception as どォぺぬむっクグジヰちヱネョずそふ: print(どォぺぬむっクグジヰちヱネョずそふ)
except KeyboardInterrupt: exit('Exiting...')
